
. 
. *** Start with a test of the stand-alone nestloop.ado
. 
. use "$testpath/data/res.dta", clear

. drop v1

. order theta rho pc tau2 k 

. 
. * reshape into format required by nestloop
. reshape long exp mse cov bias var2, i(theta rho pc tau2 k) j(method) string
(j = expect fem g2 limf limr mh peters peto rem sfem srem trimfill)
(variable explimr not found)
(variable mselimr not found)
(variable covlimr not found)
(variable var2limr not found)
(variable expsfem not found)
(variable msesfem not found)
(variable covsfem not found)
(variable var2sfem not found)
(variable expsrem not found)
(variable msesrem not found)
(variable covsrem not found)
(variable var2srem not found)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              768   ->   9,216       
Number of variables                  53   ->   11          
j variable (12 values)                    ->   method
xij variables:
       expexpect expfem ... exptrimfill   ->   exp
       mseexpect msefem ... msetrimfill   ->   mse
       covexpect covfem ... covtrimfill   ->   cov
    biasexpect biasfem ... biastrimfill   ->   bias
    var2expect var2fem ... var2trimfill   ->   var2
-----------------------------------------------------------------------------

. 
. * draw nestloop for 9 methods and 4*3*4*4*4 dgms
. nestloop exp, descriptors(theta rho pc tau2 k) method(method) true(theta) legend(row(2)) dgsize(.2
> 5)

. 
. *** Reproduce nested loop plot in Rucker and Schwarzer 2014
. 
. * log transform - sadly yscale(log) doesn't work
. gen logor = log(exp)
(2,304 missing values generated)

. gen logtheta=log(theta)

. mylabels .2 .5 1, myscale(log(@)) local(labels)
-1.6094379124341 ".2" -.6931471805599453 ".5" 0 "1"

. keep if inlist(method,"peto","trimfill","peters","limf","limr")
(5,376 observations deleted)

. nestloop logor, descriptors(-theta rho -pc tau2 -k) method(method) true(logtheta) legend(col(1) ri
> ng(0) pos(9)) dgsize(.25) dgreverse debug ylabel(`labels') ytitle(Odds ratio) lcol(orange black bl
> ue gray lime) scheme(mrc)
Debug: graph command is: graph twoway (line logtheta __000001, c(J) lc(gs10) lw(medthick) ) (line lo
> gor __000001 if method=="limf", c(J) lcolor(orange)) (line logor __000001 if method=="limr", c(J) 
> lcolor(black)) (line logor __000001 if method=="peters", c(J) lcolor(blue)) (line logor __000001 i
> f method=="peto", c(J) lcolor(gray)) (line logor __000001 if method=="trimfill", c(J) lcolor(lime)
> ) (line __000003 __000004 __000005 __000006 __000007 __000001, c(J ...) lcol(gs4 ...) lpattern(sol
> id ...) lwidth( ...) lstyle( ...) ) , legend(order(1 `"True"' 2 `"limf"' 3 `"limr"' 4 `"peters"' 5
>  `"peto"' 6 `"trimfill"')  ring(0) position(9) cols(1)) ytitle(logor) xla(none) xtitle("") yla(,no
> grid) text(-1.376291631311177 1 `"Odds Ratio (1, .75, .67, .5)"', place(e) col(gs4) size(vsmall) j
> ustification(left)) text(-1.471202885756889 1 `"Selection (no, weak, moderate, strong)"', place(e)
>  col(gs4) size(vsmall) justification(left)) text(-1.566114140202601 1 `"Control Event Proportion (
> 30%, 20%, 10%, 5%)"', place(e) col(gs4) size(vsmall) justification(left)) text(-1.661025394648313 
> 1 `"Heterogeneity (0, .05, .1, .2)"', place(e) col(gs4) size(vsmall) justification(left)) text(-1.
> 755936649094025 1 `"Number of studies (20, 10, 5)"', place(e) col(gs4) size(vsmall) justification(
> left)) name()    ylabel(   -1.6094379124341 ".2"  -.6931471805599453 ".5"                   0 "1" 
> ) ytitle(Odds ratio) scheme(mrc)

. 
. *** Main tests of siman nestloop
. use "$testpath/data/extendedtestdata.dta", clear

. 
. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. 
. siman analyse
siman analyse has run successfully

. siman nestloop bias, lcol(black red blue) 
siman nestloop will draw 3 graphs (3 targets * 1 performance measures)

. 
. siman nestloop relerror if estimand=="mean1", dgmorder(beta pmiss -mech) stagger(0.05) dgsize(.4) 
> dggap(.2) dgcol(green orange purple) dgpatt(dash solid =) dglabsize(medium) dglwidth(1) lcol(black
>  red blue) lwidth(1) title(My nested loop plot) name(sn1,replace) xla(none) norefline
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * setup without true
. use "$testpath/data/extendedtestdata.dta", clear

. drop true

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) 
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            -

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop if estimand=="effect", lcol(black red blue) xtitle("") xlabel(none) stagger(0.03) 
Performance measures not specified and no true value: defaulting to mean
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * siman analyse with if
. use "$testpath/data/extendedtestdata.dta", clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse if mech!=2
siman analyse has run successfully

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3) 
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. * Graph should ignore mech
. 
. 
. // COMPARE METHOD AS UNLABELLED/LABELLED NUMERIC OR STRING
. 
. * method is string (as in source data)
. use "$testpath/data/extendedtestdata.dta", clear

. tab method if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effect"
>  & rep>0, su(b) // CCA, MeanImp, Noadj

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mstring,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. graph export mstring.pdf, replace
file mstring.pdf saved as PDF format

. 
. * method is numeric labelled in alphabetical order
. use "$testpath/data/extendedtestdata.dta", clear

. sencode method, gsort(method) replace // 1=CCA, 2=MeanImp, 3=Noadj

. tab method if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effect"
>  & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mlabalpha,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * method is numeric labelled in data order
. use "$testpath/data/extendedtestdata.dta", clear

. sencode method, replace // 1=Noadj, 2=CCA, 3=MeanImp

. tab method if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effect"
>  & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
      Noadj |  -.00349635   .19110948       1,000
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  Noadj; CCA; MeanImp

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mlabdata,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * method is numeric unlabelled in alphabetical order
. use "$testpath/data/extendedtestdata.dta", clear

. sencode method, gsort(method) replace // order is alphabetical: CCA MeanImp Noadj 

. tab method if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effect"
>  & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. label val method // 1 [=Noadj], 2 [=CCA], 3 [=MeanImp]

. tab method if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effect"
>  & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .00253414   .15817009       1,000
          2 |   .00217613    .1525731       1,000
          3 |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  1; 2; 3

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(munlabelled,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. ** NB name(string) gives funny error
. 
. * method is not 1...
. use "$testpath/data/extendedtestdata.dta", clear

. gen methchar = 11 if method == "CCA"
(72,000 missing values generated)

. replace methchar = 12 if method == "MeanImp"
(36,000 real changes made)

. replace methchar = 13 if method == "Noadj"
(36,000 real changes made)

. label def methchar 11 "CCA" 12 "MeanImp" 13 "Noadj"

. label val methchar methchar

. drop method

. tab methchar if float(beta)==float(0) & float(pmiss)==float(0.2) & mech=="MCAR" & estimand=="effec
> t" & rep>0, su(b)

            |            Summary of b
   methchar |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(methchar) target(estimand) est(b) se(se) true(tr
> ue)
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    methchar
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(munlabplus10,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * graph should be the same as mstring
. graph export munlabplus10.pdf, replace
file munlabplus10.pdf saved as PDF format

. !fc mstring.pdf munlabplus10.pdf > result

. type result
Comparing files mstring.pdf and MUNLABPLUS10.PDF
FC: no differences encountered

. * Check "no differences encountered" above
. foreach file in mstring.pdf munlabplus10.pdf result {
  2.         erase `file'
  3. }

. 
. 
. 
. // more tests with true
. * check mean 
. use "$testpath/data/extendedtestdata.dta", clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estimand
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

.  
. * only one method
. siman nestloop bias if method=="CCA" & estimand=="mean0", lcol(black red blue) xtitle("") xlabel(n
> one) name(sn2,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * incomplete dgmorder
. siman nestloop bias if estimand=="mean0", dgmorder(pmiss beta) 
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. * reverse dgmorder
. siman nestloop bias if estimand=="mean0", dgmorder(pmiss beta) dgreverse
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. * bogus dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech3 beta) 
variable mech3 not found

. assert _rc == 111

. * surplus var in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech true beta) 
Surplus vars found in dgmorder(): true

. assert _rc == 498

. * repeated in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech mech beta) 
Surplus vars found in dgmorder(): mech

. assert _rc == 498

. * abbreviated dgmorder
. siman nestloop bias if estimand=="mean0", dgmorder(pmiss be -mec) name(sn3,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * wrong pm
. cap noi siman nestloop rhubarb 
Performance measures not in data: rhubarb

. assert _rc == 498

. 
. * only one dgm
. cap noi siman nestloop bias if float(beta)==0 & float(pmiss)==float(0.2) & mech==1
siman nestloop requires at least 2 dgms

. assert _rc == 498

. 
. * no target
. use "$testpath/data/extendedtestdata.dta", clear

. keep if estimand=="mean0"
(72,000 observations deleted)

. drop estimand

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (36,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    -
  Number of targets:              1
  Target values:                  

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop bias, name(sn4,replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * numeric target
. use "$testpath/data/extendedtestdata.dta", clear

. encode estimand, gen(estinum)

. drop estimand

. siman setup, target(estinum) rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
Warning: dgm variable mech has been converted from string to numeric. If you require its levels to
  be ordered differently, encode mech as numeric before running -siman setup-.
Warning: dgm variable beta has non-integer values: converting from float to double (0 real changes
  made)
Warning: dgm variable pmiss has non-integer values: converting from float to double (108,000 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       beta (3) pmiss (2) mech (2) 
  Total number of DGMs:           12

Targets
  Variable containing targets:    estinum
  Number of targets:              3
  Target values:                  effect; mean0; mean1

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  CCA; MeanImp; Noadj

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse
siman analyse has run successfully

. siman nestloop bias, name(sn5,replace) saving(sn5s , replace) export(pdf, replace)
siman nestloop will draw 3 graphs (3 targets * 1 performance measures)
(file sn5s_effect_bias.gph not found)
file sn5s_effect_bias.gph saved
file sn5s_effect_bias.pdf saved as PDF format
(file sn5s_mean0_bias.gph not found)
file sn5s_mean0_bias.gph saved
file sn5s_mean0_bias.pdf saved as PDF format
(file sn5s_mean1_bias.gph not found)
file sn5s_mean1_bias.gph saved
file sn5s_mean1_bias.pdf saved as PDF format

. foreach target in effect mean0 mean1 {
  2.         erase sn5s_`target'_bias.gph
  3.         erase sn5s_`target'_bias.pdf
  4. }

. siman nestloop bias if estinum==1, name(sn6,replace) nodg legend(row(1))
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. siman nestloop bias if estinum==1, nodg legend(row(1)) methlegend(item)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. siman nestloop bias if estinum==1, nodg legend(row(1)) methlegend(title)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. * this is a good quality graph
. siman nestloop bias if estinum==1, legend(row(1)) ///
>         title(Good nestloop graph for estimand effect) note("") stagger(.05) xlab(none) lcol(red g
> reen blue)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. di as result  "*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***"
*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***

. 
. log close
