
. 
. use $testpath/data/msgbsl_inter_try_postfile.dta, clear

. 
. * targets are wide, methods are long 
. * so data are in wide-long format (format 4)
. 
. * need estimates to be stub + target
. rename inter binter

. rename main bmain

. 
. * set up true value variables
. gen trueinter=.3

. gen truemain=0

. 
. * set up
. siman setup, rep(i) target(inter main) method(method) est(b) se(se) true(true) dgm(parm1)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       parm1 (1) 
  Total number of DGMs:           1

Targets
  Variable containing targets:    target
  Number of targets:              2
  Target values:                  inter main

Methods
  Variable containing methods:    method
  Number of methods:              4
  Method values:                  CC; FULLDAT; IMPALL; IMPBYZ

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. 
. * analyse works ok with ref and replace
. siman analyse, ref(CC)
siman analyse has run successfully

. siman table

----------------------------------------------------------------------------------------------------
Performa |                                     method and target                                    
nce      | -------- CC --------   ------ FULLDAT -----   ------ IMPALL ------   ------ IMPBYZ ------
measure  |     inter       main       inter       main       inter       main       inter       main
---------+------------------------------------------------------------------------------------------
 Estreps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
  Sereps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
    Bias |  .0059115  -.0014899    .0015333  -.0024519    .0052478  -.0031501    .0059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
 Pctbias |  1.970502               .5110834               1.749251               1.970502           
         |  1.009701               .6896664               1.003759               1.009701           
         | 
    Mean |  .3059115  -.0014899    .3015333  -.0024519    .3052478  -.0031501    .3059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
   Empse |  .3029104   .2940812    .2068999    .201468    .3011278    .208478    .3029104   .2134977
         |   .002142   .0020796    .0014631   .0014247    .0021294   .0014742     .002142   .0015097
         | 
 Relprec |         0          0    114.3421     113.07    1.187411   98.98207           0   89.73528
         |         0          0    3.189075    3.04416    .2449551   2.833241               2.675898
         | 
     Mse |  .0917805   .0864773    .0428056   .0405913    .0906964   .0434687    .0917805   .0455843
         |  .0013657   .0012391    .0006159   .0005911    .0013496   .0006277    .0013657   .0006603
         | 
    Rmse |  .3029529   .2940703    .2068953   .2014729    .3011585   .2084914    .3029529   .2135047
         |   .002254   .0021068    .0014884    .001467    .0022407   .0015053     .002254   .0015464
         | 
 Modelse |  .3048548   .2922305    .2058274   .2019903    .3062941   .2079367    .3085094    .211888
         |   .000532   .0003659    .0002157   .0001489    .0004706   .0001678    .0004811   .0001907
         | 
 Ciwidth |  1.178335   1.136844     .802491   .7896402    1.187637   .8125015    1.195883   .8273879
         |  .0019894   .0014074    .0008355   .0005827    .0017631     .00065    .0017988   .0007282
         | 
Relerror |  .6419234  -.6293141   -.5184007   .2592178    1.715628  -.2596578    1.848428   -.753965
         |  .7330312   .7136225     .711162   .7128181    .7360551   .7098851    .7375182   .7074718
         | 
   Cover |     94.31      94.09       94.66       94.6       94.83      94.48        94.9      94.39
         |  .2316515   .2358118    .2248297   .2260177    .2214206   .2283702    .2199977   .2301147
         | 
   Power |     18.62       5.91       31.41        5.4       17.67       5.52       17.59       5.61
         |   .389268   .2358118    .4641564   .2260177    .3814146   .2283702    .3807351   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. siman analyse, ref(FULLDAT) replace 
siman analyse has run successfully

. siman table

----------------------------------------------------------------------------------------------------
Performa |                                     method and target                                    
nce      | -------- CC --------   ------ FULLDAT -----   ------ IMPALL ------   ------ IMPBYZ ------
measure  |     inter       main       inter       main       inter       main       inter       main
---------+------------------------------------------------------------------------------------------
 Estreps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
  Sereps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
    Bias |  .0059115  -.0014899    .0015333  -.0024519    .0052478  -.0031501    .0059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
 Pctbias |  1.970502               .5110834               1.749251               1.970502           
         |  1.009701               .6896664               1.003759               1.009701           
         | 
    Mean |  .3059115  -.0014899    .3015333  -.0024519    .3052478  -.0031501    .3059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
   Empse |  .3029104   .2940812    .2068999    .201468    .3011278    .208478    .3029104   .2134977
         |   .002142   .0020796    .0014631   .0014247    .0021294   .0014742     .002142   .0015097
         | 
 Relprec | -53.34562  -53.06707           0          0   -52.79164  -6.611879   -53.34562  -10.95167
         |  .6941441   .6705371           0          0    .6991529   .5173771    .6941441   .5893332
         | 
     Mse |  .0917805   .0864773    .0428056   .0405913    .0906964   .0434687    .0917805   .0455843
         |  .0013657   .0012391    .0006159   .0005911    .0013496   .0006277    .0013657   .0006603
         | 
    Rmse |  .3029529   .2940703    .2068953   .2014729    .3011585   .2084914    .3029529   .2135047
         |   .002254   .0021068    .0014884    .001467    .0022407   .0015053     .002254   .0015464
         | 
 Modelse |  .3048548   .2922305    .2058274   .2019903    .3062941   .2079367    .3085094    .211888
         |   .000532   .0003659    .0002157   .0001489    .0004706   .0001678    .0004811   .0001907
         | 
 Ciwidth |  1.178335   1.136844     .802491   .7896402    1.187637   .8125015    1.195883   .8273879
         |  .0019894   .0014074    .0008355   .0005827    .0017631     .00065    .0017988   .0007282
         | 
Relerror |  .6419234  -.6293141   -.5184007   .2592178    1.715628  -.2596578    1.848428   -.753965
         |  .7330312   .7136225     .711162   .7128181    .7360551   .7098851    .7375182   .7074718
         | 
   Cover |     94.31      94.09       94.66       94.6       94.83      94.48        94.9      94.39
         |  .2316515   .2358118    .2248297   .2260177    .2214206   .2283702    .2199977   .2301147
         | 
   Power |     18.62       5.91       31.41        5.4       17.67       5.52       17.59       5.61
         |   .389268   .2358118    .4641564   .2260177    .3814146   .2283702    .3807351   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. siman analyse, ref(IMPALL) replace 
siman analyse has run successfully

. siman table

----------------------------------------------------------------------------------------------------
Performa |                                     method and target                                    
nce      | -------- CC --------   ------ FULLDAT -----   ------ IMPALL ------   ------ IMPBYZ ------
measure  |     inter       main       inter       main       inter       main       inter       main
---------+------------------------------------------------------------------------------------------
 Estreps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
  Sereps |     10000      10000       10000      10000       10000      10000       10000      10000
         |                                                                                          
         | 
    Bias |  .0059115  -.0014899    .0015333  -.0024519    .0052478  -.0031501    .0059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
 Pctbias |  1.970502               .5110834               1.749251               1.970502           
         |  1.009701               .6896664               1.003759               1.009701           
         | 
    Mean |  .3059115  -.0014899    .3015333  -.0024519    .3052478  -.0031501    .3059115  -.0027479
         |  .0030291   .0029408     .002069   .0020147    .0030113   .0020848    .0030291    .002135
         | 
   Empse |  .3029104   .2940812    .2068999    .201468    .3011278    .208478    .3029104   .2134977
         |   .002142   .0020796    .0014631   .0014247    .0021294   .0014742     .002142   .0015097
         | 
 Relprec | -1.173477  -49.74422    111.8269       7.08           0          0   -1.173477  -4.647047
         |  .2392399   .7155758    3.137143   .5932311           0          0    .2392399     .30209
         | 
     Mse |  .0917805   .0864773    .0428056   .0405913    .0906964   .0434687    .0917805   .0455843
         |  .0013657   .0012391    .0006159   .0005911    .0013496   .0006277    .0013657   .0006603
         | 
    Rmse |  .3029529   .2940703    .2068953   .2014729    .3011585   .2084914    .3029529   .2135047
         |   .002254   .0021068    .0014884    .001467    .0022407   .0015053     .002254   .0015464
         | 
 Modelse |  .3048548   .2922305    .2058274   .2019903    .3062941   .2079367    .3085094    .211888
         |   .000532   .0003659    .0002157   .0001489    .0004706   .0001678    .0004811   .0001907
         | 
 Ciwidth |  1.178335   1.136844     .802491   .7896402    1.187637   .8125015    1.195883   .8273879
         |  .0019894   .0014074    .0008355   .0005827    .0017631     .00065    .0017988   .0007282
         | 
Relerror |  .6419234  -.6293141   -.5184007   .2592178    1.715628  -.2596578    1.848428   -.753965
         |  .7330312   .7136225     .711162   .7128181    .7360551   .7098851    .7375182   .7074718
         | 
   Cover |     94.31      94.09       94.66       94.6       94.83      94.48        94.9      94.39
         |  .2316515   .2358118    .2248297   .2260177    .2214206   .2283702    .2199977   .2301147
         | 
   Power |     18.62       5.91       31.41        5.4       17.67       5.52       17.59       5.61
         |   .389268   .2358118    .4641564   .2260177    .3814146   .2283702    .3807351   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. 
. * check get error if true is not constant across methods
. use $testpath/data/msgbsl_inter_try_postfile.dta, clear

. rename inter binter

. rename main bmain

. gen trueinter=.3

. gen truemain=0

. * introduce error
. replace trueinter = 0.5 in 2
(1 real change made)

. cap siman setup, rep(i) target(inter main) method(method) est(b) se(se) true(true) dgm(parm1)

. assert _rc==498

. 
. /*
> TEST LCI, UCI, P OPTIONS
>         use long-long data 
>         use non-default cilevel as tougher test
> */
. 
. * using SE: store results as comparators
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman analyse bias ciwidth cover power, level(80) debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p() method(method) id(rep) b
> y(true dgm estimand) max(20) bias ciwidth cover power clear mcse gen(_perfmeas)  level(80)  semiss
> ingok

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       16   ->      32
Number of variables                   9   ->       8
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table

--------------------------------------------------------
dgm and   |
Performan |             method and estimand             
ce        | --------- 1 --------    --------- 2 --------
measure   |      beta      gamma         beta      gamma
----------+---------------------------------------------
1         |
     Bias | -.0043991   .0005151    -.0025973   .0056354
          |  .0024993   .0025476     .0035644   .0035789
          | 
  Ciwidth |  .2014349   .2017357     .2899728   .2909772
          |  .0004004   .0003738     .0008642   .0008659
          | 
    Cover |      80.1       79.5         81.5       78.5
          |  1.262533   1.276617     1.227905   1.299134
          | 
    Power |      19.9       20.5         18.5       21.5
          |  1.262533   1.276617     1.227905   1.299134
----------+---------------------------------------------
2         |
     Bias | -.0046965   .0005948    -.0058509   .0065072
          |  .0028908   .0029417     .0039932   .0041326
          | 
  Ciwidth |  .2328909   .2329444     .3352942   .3359915
          |  .0004466   .0004316     .0009704   .0009999
          | 
    Cover |      80.3       79.5         83.3       78.5
          |   1.25774   1.276617     1.179453   1.299134
          | 
    Power |      19.7       20.5         16.7       21.5
          |   1.25774   1.276617     1.179453   1.299134
--------------------------------------------------------
Note: Coverage and Power calculated at 80% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. foreach pm in bias ciwidth cover power {
  2.         summ est if _perfmeascode=="`pm'"
  3.         local `pm'ref = r(mean)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8   -.0005364    .0047027  -.0058509   .0065072

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       80.15    1.606239       78.5       83.3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. 
. * using LCI and UCI: compare ciwidth, coverage and power
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. gen lower = est - invnorm(.9)*se

. gen upper = est + invnorm(.9)*se

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) lci
> (lower) uci(upper)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          lower upper
  p-value variable:               N/A
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman analyse ciwidth cover power, debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci(lower) uci(upper) p() method(method)
>  id(rep) by(true dgm estimand) max(20) ciwidth cover power clear mcse gen(_perfmeas)  level(95)  s
> emissingok

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       12   ->      24
Number of variables                   9   ->       8
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table

----------------------------------------------------
dgm and   |
Performan |           method and estimand           
ce        | -------- 1 -------    -------- 2 -------
measure   |     beta     gamma        beta     gamma
----------+-----------------------------------------
1         |
  Ciwidth | .2014349  .2017357    .2899728  .2909772
          | .0004004  .0003738    .0008642  .0008659
          | 
    Cover |     80.1      79.5        81.5      78.5
          | 1.262533  1.276617    1.227905  1.299134
          | 
    Power |     19.9      20.5        18.5      21.5
          | 1.262533  1.276617    1.227905  1.299134
----------+-----------------------------------------
2         |
  Ciwidth | .2328909  .2329444    .3352942  .3359915
          | .0004466  .0004316    .0009704  .0009999
          | 
    Cover |     80.3      79.5        83.3      78.5
          |  1.25774  1.276617    1.179453  1.299134
          | 
    Power |     19.7      20.5        16.7      21.5
          |  1.25774  1.276617    1.179453  1.299134
----------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .2651552 7.361e-09

. assert reldif(`ciwidthref', r(mean))<1E-8

. summ est if _perfmeascode=="cover"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       80.15    1.606239       78.5       83.3

. di `coverref', r(mean),reldif(`coverref', r(mean))
80.150001 80.150001 0

. assert reldif(`coverref', r(mean))<1E-8

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 19.85 1.704e-16

. assert reldif(`powerref', r(mean))<1E-8

. 
. * using P: compare ciwidth and power
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. gen pvalue = 2*normprob(-abs(est)/se)

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) p(p
> value)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               pvalue
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman analyse ciwidth power, level(80) debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p(pvalue) method(method) id(
> rep) by(true dgm estimand) max(20) ciwidth power clear mcse gen(_perfmeas)  level(80)  semissingok

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        8   ->      16
Number of variables                   9   ->       8
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table

----------------------------------------------------
dgm and   |
Performan |           method and estimand           
ce        | -------- 1 -------    -------- 2 -------
measure   |     beta     gamma        beta     gamma
----------+-----------------------------------------
1         |
  Ciwidth | .2014349  .2017357    .2899728  .2909772
          | .0004004  .0003738    .0008642  .0008659
          | 
    Power |     19.9      20.5        18.5      21.5
          | 1.262533  1.276617    1.227905  1.299134
----------+-----------------------------------------
2         |
  Ciwidth | .2328909  .2329444    .3352942  .3359915
          | .0004466  .0004316    .0009704  .0009999
          | 
    Power |     19.7      20.5        16.7      21.5
          |  1.25774  1.276617    1.179453  1.299134
----------------------------------------------------
Note: Coverage and Power calculated at 80% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .26515521 0

. assert reldif(`ciwidthref', r(mean))<1E-8

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 19.85 1.704e-16

. assert reldif(`powerref', r(mean))<1E-8

. 
. * using P wrongly: compare ciwidth and power
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. gen pvalue = 2*normprob(-abs(est)/se)

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) p(p
> value)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               pvalue
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman analyse ciwidth power, debug // NB default level
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p(pvalue) method(method) id(
> rep) by(true dgm estimand) max(20) ciwidth power clear mcse gen(_perfmeas)  level(95)  semissingok

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        8   ->      16
Number of variables                   9   ->       8
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table

----------------------------------------------------
dgm and   |
Performan |           method and estimand           
ce        | -------- 1 -------    -------- 2 -------
measure   |     beta     gamma        beta     gamma
----------+-----------------------------------------
1         |
  Ciwidth | .3080681  .3085282    .4434751  .4450112
          | .0006123  .0005716    .0013217  .0013243
          | 
    Power |      5.3       5.5         4.3       3.6
          | .7084561  .7209369    .6414905   .589101
----------+-----------------------------------------
2         |
  Ciwidth |  .356176  .3562577    .5127883  .5138547
          |  .000683  .0006601    .0014841  .0015292
          | 
    Power |        5       5.5         4.4       3.6
          | .6892024  .7209369    .6485677   .589101
----------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .4055199     .084523   .3080681   .5138547

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .40551991 .09986674

. assert reldif(`ciwidthref', r(mean))>1E-2

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8        4.65    .7910211        3.6        5.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 4.65 2.6902655

. assert reldif(`powerref', r(mean))>1E-2

. 
. * test with no se: compare bias
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop se

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    N/A
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman analyse bias
siman analyse has created variable _se to hold the MCSE
siman analyse has run successfully

. siman table

--------------------------------------------------------
dgm and   |
Performan |             method and estimand             
ce        | --------- 1 --------    --------- 2 --------
measure   |      beta      gamma         beta      gamma
----------+---------------------------------------------
1         |
     Bias | -.0043991   .0005151    -.0025973   .0056354
          |  .0024993   .0025476     .0035644   .0035789
----------+---------------------------------------------
2         |
     Bias | -.0046965   .0005948    -.0058509   .0065072
          |  .0028908   .0029417     .0039932   .0041326
--------------------------------------------------------
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. summ est if _perfmeascode=="bias"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8   -.0005364    .0047027  -.0058509   .0065072

. di `biasref', r(mean),reldif(`biasref', r(mean))
-.00053642 -.00053642 8.669e-18

. assert reldif(`biasref', r(mean))<1E-8

. 
. * test analyse with if
. siman analyse if dgm==2, replace
siman analyse has created variable _se to hold the MCSE
siman analyse has run successfully

. siman table

--------------------------------------------------------
Performan |             method and estimand             
ce        | --------- 1 --------    --------- 2 --------
measure   |      beta      gamma         beta      gamma
----------+---------------------------------------------
  Estreps |      1000       1000         1000       1000
          |                                             
          | 
     Bias | -.0046965   .0005948    -.0058509   .0065072
          |  .0028908   .0029417     .0039932   .0041326
          | 
  Pctbias |                                             
          |                                             
          | 
     Mean | -.0046965   .0005948    -.0058509   .0065072
          |  .0028908   .0029417     .0039932   .0041326
          | 
    Empse |  .0914144   .0930244     .1262755   .1306846
          |  .0020451   .0020811      .002825   .0029237
          | 
  Relprec |         0          0    -47.59274  -49.33068
          |         0          0     2.430245   2.314097
          | 
      Mse |  .0083703   .0086452     .0159638   .0171037
          |  .0003797   .0003795     .0007445   .0007105
          | 
     Rmse |  .0914893   .0929798     .1263479   .1307813
          |  .0020748    .002041     .0029462   .0027163
--------------------------------------------------------
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. count if dgm==1
  4,000

. assert r(N)==4000

. 
. di as result "*** SIMAN HAS PASSED ALL THE TESTS IN `filename'.do ***"
*** SIMAN HAS PASSED ALL THE TESTS IN test_siman_widelong.do ***

. 
. log close
