
. 
. // TEST WORKING ON THE NESTLOOP TEST DATA SET
. 
. use "C:\ian\git\siman\testing\data\res.dta", clear

. keep if pc==2 & rho==3
(720 observations deleted)

. drop pc rho

. local dgmvars theta tau2 k 

. local methodvals fem rem mh peto g2 limf limr peters expect trimfill sfem srem // not needed

. local pmtarg exp mse cov bias var2 // combines target and PM, I think

. 
. * reshape long-long
. reshape long `pmtarg', i(`dgmvars') j(method) string
(j = expect fem g2 limf limr mh peters peto rem sfem srem trimfill)
(variable explimr not found)
(variable mselimr not found)
(variable covlimr not found)
(variable var2limr not found)
(variable expsfem not found)
(variable msesfem not found)
(variable covsfem not found)
(variable var2sfem not found)
(variable expsrem not found)
(variable msesrem not found)
(variable covsrem not found)
(variable var2srem not found)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations               48   ->   576         
Number of variables                  52   ->   10          
j variable (12 values)                    ->   method
xij variables:
       expexpect expfem ... exptrimfill   ->   exp
       mseexpect msefem ... msetrimfill   ->   mse
       covexpect covfem ... covtrimfill   ->   cov
    biasexpect biasfem ... biastrimfill   ->   bias
    var2expect var2fem ... var2trimfill   ->   var2
-----------------------------------------------------------------------------

. rename (`pmtarg') (est=)

. reshape long est, i(`dgmvars' method) j(perfmeas) string
(j = bias cov exp mse var2)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              576   ->   2,880       
Number of variables                  10   ->   7           
j variable (5 values)                     ->   perfmeas
xij variables:
             estbias estcov ... estvar2   ->   est
-----------------------------------------------------------------------------

. 
. * extract target and PM
. gen target = cond(perfmeas=="var2",2,1)

. replace perfmeas = "cover" if perfmeas=="cov"
variable perfmeas was str4 now str5
(576 real changes made)

. replace perfmeas = "mean" if inlist(perfmeas, "exp", "var2")
(1,152 real changes made)

. 
. * save for later
. save zres, replace
(file zres.dta not found)
file zres.dta saved

. 
. // test with all going well
. use zres, clear

. siman_import, dgm(theta tau2 k) target(target) method(method) estimate(est) perf(perfmeas)
(0 real changes made)
(0 real changes made)
bias cover mean mse

. siman des

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       theta (4) tau2 (4) k (3) 
  Total number of DGMs:           48

Targets
  Variable containing targets:    target
  Number of targets:              2
  Target values:                  1 2

Methods
  Variable containing methods:    method
  Number of methods:              12
  Method values:                  expect fem g2 limf limr mh peters peto rem sfem srem trimfill

Repetition-level output
  Point estimate variable:        est
  SE variable:                    N/A
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            N/A

Estimates data                    not in data
Performance estimates             in data
_____________________________________________________

. siman table if theta==1 & tau2==0 & k==5, column(_perfmeas target) tabdisp

--------------------------------
Odds      |
Ratio,    |
Heterogen |
eity,     |
Number of |
studies,  |
method    |
and       |
Performan |
ce        |        target       
measure   |         1          2
----------+---------------------
1         |
0         |
5         |
expect    |
     Bias |   .029331           
     Mean |  1.029765    .077569
      Mse |  .0784293           
    Cover |      .999           
----------+---------------------
1         |
0         |
5         |
fem       |
     Bias | -.2753639           
     Mean |  .7592958   .0141768
      Mse |  .0900021           
    Cover |      .267           
----------+---------------------
1         |
0         |
5         |
g2        |
     Bias |  .0346562           
     Mean |  1.035264   .0776411
      Mse |  .0788422           
    Cover |      .999           
----------+---------------------
1         |
0         |
5         |
limf      |
     Bias |  .0309012           
     Mean |  1.031384   .0771716
      Mse |  .0781264           
    Cover |      .752           
----------+---------------------
1         |
0         |
5         |
limr      |
     Bias |  .0308544           
     Mean |                     
      Mse |                     
    Cover |                     
----------+---------------------
1         |
0         |
5         |
mh        |
     Bias |  -.280288           
     Mean |  .7555661   .0145753
      Mse |  .0931366           
    Cover |      .245           
----------+---------------------
1         |
0         |
5         |
peters    |
     Bias | -.0966765           
     Mean |  .9078496   .0327262
      Mse |  .0420725           
    Cover |         1           
----------+---------------------
1         |
0         |
5         |
peto      |
     Bias | -.2780032           
     Mean |  .7572944    .013945
      Mse |  .0912308           
    Cover |      .244           
----------+---------------------
1         |
0         |
5         |
rem       |
     Bias |  -.296165           
     Mean |  .7436647   .0140836
      Mse |  .1017973           
    Cover |      .304           
----------+---------------------
1         |
0         |
5         |
sfem      |
     Bias |  .0985691           
     Mean |                     
      Mse |                     
    Cover |                     
----------+---------------------
1         |
0         |
5         |
srem      |
     Bias |  .1997911           
     Mean |                     
      Mse |                     
    Cover |                     
----------+---------------------
1         |
0         |
5         |
trimfill  |
     Bias | -.2254566           
     Mean |  .7981517   .0152887
      Mse |  .0661193           
    Cover |         1           
--------------------------------
Note: Coverage calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. siman nes mean if target==1 & inlist(method,"peto" ,"g2")
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. // test with different varnames
. use zres, clear

. rename (theta tau2 k target method est perfmeas) (my=)

. siman_import, dgm(mytheta mytau2 myk) target(mytarget) method(mymethod) estimate(myest) perf(myper
> fmeas)
(0 real changes made)
(0 real changes made)
bias cover mean mse

. 
. // test with wrong PM name
. use zres, clear

. replace perfmeas="meav" if perfmeas=="mean"
(1,152 real changes made)

. tab perfmeas

   perfmeas |      Freq.     Percent        Cum.
------------+-----------------------------------
       bias |        576       20.00       20.00
      cover |        576       20.00       40.00
       meav |      1,152       40.00       80.00
        mse |        576       20.00      100.00
------------+-----------------------------------
      Total |      2,880      100.00

. cap noi siman_import, dgm(theta tau2 k) target(target) method(method) estimate(est) perf(perfmeas)
(0 real changes made)
(0 real changes made)
bias cover meav mse
Performance measures not allowed: meav

. cap assert _rc==498

. 
. erase zres.dta

. 
. 
. // COMPARE BEFORE AND AFTER EXPORT/IMPORT
. // load data and do benchmark analysis
. use data/simcheck, clear
(Simulation results from simcheck99.do in paper doi:10.1093/ije/dyad134)

. siman setup, rep(rep) dgm(dgm) method(method) est(b) se(se) df(df) true(0)
Warning: dgm variable dgm has been converted from string to numeric. If you require its levels to be
  ordered differently, encode dgm as numeric before running -siman setup-.
Warning: siman setup found unwanted variables: N

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (3) 
  Total number of DGMs:           3

Targets
  Variable containing targets:    N/A
  Number of targets:              1
  Target values:                  

Methods
  Variable containing methods:    method
  Number of methods:              3
  Method values:                  Full; CCA; MI

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    df
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            _true (created)

Estimates data                    in data
Performance estimates             not in data
_____________________________________________________

. siman ana, perf
Warning: missing values in df()
siman analyse has run successfully

. siman table, col(dgm method) tabdisp

----------------------------------------------------------------------------------------------------
Performa |                             method and Missing data mechanism                            
nce      | ------------ Full ----------- ------------ CCA ------------ ------------- MI ------------
measure  |      MCAR       MAR      MNAR      MCAR       MAR      MNAR      MCAR       MAR      MNAR
---------+------------------------------------------------------------------------------------------
 Estreps |      1000      1000      1000      1000      1000      1000      1000      1000      1000
         |                                                                                          
         | 
  Sereps |      1000      1000      1000      1000      1000      1000      1000      1000      1000
         |                                                                                          
         | 
    Bias | -.0000126 -.0168955 -.0063853 -.0075347  -.160113 -.0301532  .0000898 -.0203649  .0486318
         |  .0134727  .0137363  .0136254  .0163235  .0183634  .0170389  .0143525  .0146205  .0145317
         | 
 Pctbias |                                                                                          
         |                                                                                          
         | 
    Mean | -.0000126 -.0168955 -.0063853 -.0075347  -.160113 -.0301532  .0000898 -.0203649  .0486318
         |  .0134727  .0137363  .0136254  .0163235  .0183634  .0170389  .0143525  .0146205  .0145317
         | 
   Empse |  .4260444   .434379  .4308737  .5161938  .5807029  .5388181  .4538652  .4623407  .4595314
         |  .0095314  .0097179  .0096394  .0115482  .0129914  .0120544  .0101538  .0103434  .0102806
         | 
 Relprec |         0         0         0 -31.87852  -44.0462 -36.05369 -11.88377 -11.72998 -12.08366
         |         0         0         0  2.408183  2.292493   2.33216  1.713048  2.051793  1.881443
         | 
     Mse |  .1813323  .1887818  .1855072  .2662463  .3625148  .2909439  .2057876  .2139599   .213323
         |  .0090287  .0094203  .0089703  .0132095  .0179585  .0147555  .0097192  .0107484  .0102468
         | 
    Rmse |  .4258313  .4344903  .4307055  .5159907   .602092  .5393922  .4536382  .4625581   .461869
         |  .0106013  .0108407  .0104135  .0128002  .0149134  .0136779  .0107126  .0116185  .0110928
         | 
 Modelse |  .4096058  .4105874  .4073388  .4964768  .5483734  .5226676  .4334714  .4479698  .4341262
         |  .0011464  .0011822  .0011531  .0018082  .0025673  .0023293  .0014681  .0016925  .0015074
         | 
 Ciwidth |  1.599708  1.603209  1.590864  1.934587  2.129348  2.032631  1.697258  1.761129  1.703247
         |  .0043573  .0044883  .0043296  .0067032  .0093101  .0081325  .0056927  .0068824  .0058471
         | 
Relerror | -3.858411 -5.477135 -5.462126 -3.819691 -5.567305   -2.9974 -4.493358 -3.108309 -5.528502
         |  2.167634  2.132093  2.131855   2.18006  2.158397  2.212767  2.161009  2.198344  2.138808
         | 
   Cover |      94.9      93.5      94.3      94.7      94.9      95.5      94.7      94.4      93.4
         |  .6956938  .7795832  .7331505  .7084563  .6956938  .6555532  .7084563  .7270762  .7851368
         | 
   Power |       5.1       6.5       5.7       5.3       5.1       4.5       5.3       5.6       6.6
         |  .6956939  .7795832  .7331507  .7084561  .6956939  .6555532  .7084561  .7270764  .7851369
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. siman lol, name(lolly1,replace)
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 1 graph with 9 panels (3 PMs by 3 DGMs)

. 
. // "export" "to non-siman-format
. siman_unset

. keep if rep<0
(0 observations deleted)

. drop rep _dataset N df

. rename _true true

. rename _perfmeascode pm

. 
. // import to siman
. pda

. siman_import, perf(pm) dgm(dgm) method(method) estimate(b) se(se) true(true)
(0 real changes made)
(0 real changes made)
bias ciwidth cover empse estreps mean modelse mse pctbias power relerror relprec rmse sereps

. siman table, col(dgm method) tabdisp

----------------------------------------------------------------------------------------------------
Performa |                             method and Missing data mechanism                            
nce      | ------------ Full ----------- ------------ CCA ------------ ------------- MI ------------
measure  |      MCAR       MAR      MNAR      MCAR       MAR      MNAR      MCAR       MAR      MNAR
---------+------------------------------------------------------------------------------------------
 Estreps |      1000      1000      1000      1000      1000      1000      1000      1000      1000
         |                                                                                          
         | 
  Sereps |      1000      1000      1000      1000      1000      1000      1000      1000      1000
         |                                                                                          
         | 
    Bias | -.0000126 -.0168955 -.0063853 -.0075347  -.160113 -.0301532  .0000898 -.0203649  .0486318
         |  .0134727  .0137363  .0136254  .0163235  .0183634  .0170389  .0143525  .0146205  .0145317
         | 
 Pctbias |                                                                                          
         |                                                                                          
         | 
    Mean | -.0000126 -.0168955 -.0063853 -.0075347  -.160113 -.0301532  .0000898 -.0203649  .0486318
         |  .0134727  .0137363  .0136254  .0163235  .0183634  .0170389  .0143525  .0146205  .0145317
         | 
   Empse |  .4260444   .434379  .4308737  .5161938  .5807029  .5388181  .4538652  .4623407  .4595314
         |  .0095314  .0097179  .0096394  .0115482  .0129914  .0120544  .0101538  .0103434  .0102806
         | 
 Relprec |         0         0         0 -31.87852  -44.0462 -36.05369 -11.88377 -11.72998 -12.08366
         |         0         0         0  2.408183  2.292493   2.33216  1.713048  2.051793  1.881443
         | 
     Mse |  .1813323  .1887818  .1855072  .2662463  .3625148  .2909439  .2057876  .2139599   .213323
         |  .0090287  .0094203  .0089703  .0132095  .0179585  .0147555  .0097192  .0107484  .0102468
         | 
    Rmse |  .4258313  .4344903  .4307055  .5159907   .602092  .5393922  .4536382  .4625581   .461869
         |  .0106013  .0108407  .0104135  .0128002  .0149134  .0136779  .0107126  .0116185  .0110928
         | 
 Modelse |  .4096058  .4105874  .4073388  .4964768  .5483734  .5226676  .4334714  .4479698  .4341262
         |  .0011464  .0011822  .0011531  .0018082  .0025673  .0023293  .0014681  .0016925  .0015074
         | 
 Ciwidth |  1.599708  1.603209  1.590864  1.934587  2.129348  2.032631  1.697258  1.761129  1.703247
         |  .0043573  .0044883  .0043296  .0067032  .0093101  .0081325  .0056927  .0068824  .0058471
         | 
Relerror | -3.858411 -5.477135 -5.462126 -3.819691 -5.567305   -2.9974 -4.493358 -3.108309 -5.528502
         |  2.167634  2.132093  2.131855   2.18006  2.158397  2.212767  2.161009  2.198344  2.138808
         | 
   Cover |      94.9      93.5      94.3      94.7      94.9      95.5      94.7      94.4      93.4
         |  .6956938  .7795832  .7331505  .7084563  .6956938  .6555532  .7084563  .7270762  .7851368
         | 
   Power |       5.1       6.5       5.7       5.3       5.1       4.5       5.3       5.6       6.6
         |  .6956939  .7795832  .7331507  .7084561  .6956939  .6555532  .7084561  .7270764  .7851369
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries in the table, they are the estimated performance measure,
  followed by its Monte Carlo standard error

. siman lol, name(lolly2,replace)
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 1 graph with 9 panels (3 PMs by 3 DGMs)

. 
. * compare lolly1 and lolly2
. * compare results for both runs
. 
. log close
