
. 
. foreach feature in dgm target method {
  2.         local N 6
  3.         if "`feature'"=="dgm" local N 5
  4.         forvalues n=1/`N' {
  5.                 dicmd use data/setupdata_`feature'`n', clear
  6.                 siman scatter, name(scatter_`feature'`n', replace) bygr(title(Test siman scatte
> r using data `feature'`n'))
  7.         }
  8. }
use data/setupdata_dgm1, clear
siman scatter will draw 1 graph with 3 panels
use data/setupdata_dgm2, clear
siman scatter will draw 1 graph with 3 panels
use data/setupdata_dgm3, clear
siman scatter will draw 1 graph with 6 panels
use data/setupdata_dgm4, clear
siman scatter will draw 1 graph with 12 panels
use data/setupdata_dgm5, clear
siman scatter will draw 1 graph with 36 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_target1, clear
siman scatter will draw 1 graph with 9 panels
use data/setupdata_target2, clear
siman scatter will draw 1 graph with 9 panels
use data/setupdata_target3, clear
siman scatter will draw 1 graph with 27 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_target4, clear
siman scatter will draw 1 graph with 27 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_target5, clear
siman scatter will draw 1 graph with 27 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_target6, clear
siman scatter will draw 1 graph with 27 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_method1, clear
siman scatter will draw 1 graph with 6 panels
use data/setupdata_method2, clear
siman scatter will draw 1 graph with 6 panels
use data/setupdata_method3, clear
siman scatter will draw 1 graph with 18 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_method4, clear
siman scatter will draw 1 graph with 18 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_method5, clear
siman scatter will draw 1 graph with 18 panels
Consider reducing the number of panels using 'if' condition or 'by' option
use data/setupdata_method6, clear
siman scatter will draw 1 graph with 18 panels
Consider reducing the number of panels using 'if' condition or 'by' option

. 
. use data/setupdata_method1, clear

. siman scatter, saving(myscatter) export(png)
siman scatter will draw 1 graph with 6 panels
file myscatter.gph saved
file myscatter.png saved as PNG format

. cap noi siman scatter, saving(myscatter) export(png)
siman scatter will draw 1 graph with 6 panels
file myscatter.gph already exists

. assert _rc==602

. siman scatter estimate, saving(myscatter,replace) export(png,replace)
siman scatter will draw 1 graph with 6 panels
file myscatter.gph saved
file myscatter.png saved as PNG format

. erase myscatter.gph

. erase myscatter.png

. 
. di as result "*** SIMAN HAS PASSED ALL THE TESTS IN `filename'.do ***"
*** SIMAN HAS PASSED ALL THE TESTS IN test_scatter.do ***

. 
. log close
