
. 
. use "$testpath/data/msgbsl_inter_try_postfile.dta", clear

. 
. * targets are wide, methods are long 
. * so data are in wide-long format (format 4)
. 
. * need estimates to be stub + target
. rename inter binter

. rename main bmain

. 
. * set up true value variables
. gen trueinter=.3

. gen truemain=0

. 
. * set up
. siman setup, rep(i) target(inter main) method(method) est(b) se(se) true(true) dgm(parm1)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       parm1 (1) 
  Total number of DGMs:           1

Targets
  Variable containing targets:    target
  Number of targets:              2
  Target values:                  inter main

Methods
  Variable containing methods:    method
  Number of methods:              4
  Method values:                  CC; FULLDAT; IMPALL; IMPBYZ

Repetition-level output
  Point estimate variable:        b
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. 
. * analyse works ok with ref and replace
. siman analyse, ref(CC)
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------------------------------------------------------
Performan |                                    target and method                                    
ce        | ------------------ inter -----------------    ------------------ main ------------------
measure   |        CC    FULLDAT     IMPALL     IMPBYZ           CC    FULLDAT     IMPALL     IMPBYZ
----------+-----------------------------------------------------------------------------------------
  Estreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
   SEreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
     Bias |  .0059115   .0015333   .0052478   .0059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
  Pctbias |  1.970502   .5110834   1.749251   1.970502                                              
          |  1.009701   .6896664   1.003759   1.009701                                              
          | 
     Mean |  .3059115   .3015333   .3052478   .3059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
    Empse |  .3029104   .2068999   .3011278   .3029104     .2940812    .201468    .208478   .2134977
          |   .002142   .0014631   .0021294    .002142     .0020796   .0014247   .0014742   .0015097
          | 
  Relprec |         0   114.3421   1.187411          0            0     113.07   98.98207   89.73528
          |         0   3.189075   .2449551                       0    3.04416   2.833241   2.675898
          | 
      MSE |  .0917805   .0428056   .0906964   .0917805     .0864773   .0405913   .0434687   .0455843
          |  .0013657   .0006159   .0013496   .0013657     .0012391   .0005911   .0006277   .0006603
          | 
     RMSE |  .3029529   .2068953   .3011585   .3029529     .2940703   .2014729   .2084914   .2135047
          |   .002254   .0014884   .0022407    .002254     .0021068    .001467   .0015053   .0015464
          | 
  Modelse |  .3048548   .2058274   .3062941   .3085094     .2922305   .2019903   .2079367    .211888
          |   .000532   .0002157   .0004706   .0004811     .0003659   .0001489   .0001678   .0001907
          | 
  CIwidth |  1.178335    .802491   1.187637   1.195883     1.136844   .7896402   .8125015   .8273879
          |  .0019894   .0008355   .0017631   .0017988     .0014074   .0005827     .00065   .0007282
          | 
 Relerror |  .6419234  -.5184007   1.715628   1.848428    -.6293141   .2592178  -.2596578   -.753965
          |  .7330312    .711162   .7360551   .7375182     .7136225   .7128181   .7098851   .7074718
          | 
    Cover |     94.31      94.66      94.83       94.9        94.09       94.6      94.48      94.39
          |  .2316515   .2248297   .2214206   .2199977     .2358118   .2260177   .2283702   .2301147
          | 
    Power |     18.62      31.41      17.67      17.59         5.91        5.4       5.52       5.61
          |   .389268   .4641564   .3814146   .3807351     .2358118   .2260177   .2283702   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. siman analyse, ref(FULLDAT) replace 
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------------------------------------------------------
Performan |                                    target and method                                    
ce        | ------------------ inter -----------------    ------------------ main ------------------
measure   |        CC    FULLDAT     IMPALL     IMPBYZ           CC    FULLDAT     IMPALL     IMPBYZ
----------+-----------------------------------------------------------------------------------------
  Estreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
   SEreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
     Bias |  .0059115   .0015333   .0052478   .0059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
  Pctbias |  1.970502   .5110834   1.749251   1.970502                                              
          |  1.009701   .6896664   1.003759   1.009701                                              
          | 
     Mean |  .3059115   .3015333   .3052478   .3059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
    Empse |  .3029104   .2068999   .3011278   .3029104     .2940812    .201468    .208478   .2134977
          |   .002142   .0014631   .0021294    .002142     .0020796   .0014247   .0014742   .0015097
          | 
  Relprec | -53.34562          0  -52.79164  -53.34562    -53.06707          0  -6.611879  -10.95167
          |  .6941441          0   .6991529   .6941441     .6705371          0   .5173771   .5893332
          | 
      MSE |  .0917805   .0428056   .0906964   .0917805     .0864773   .0405913   .0434687   .0455843
          |  .0013657   .0006159   .0013496   .0013657     .0012391   .0005911   .0006277   .0006603
          | 
     RMSE |  .3029529   .2068953   .3011585   .3029529     .2940703   .2014729   .2084914   .2135047
          |   .002254   .0014884   .0022407    .002254     .0021068    .001467   .0015053   .0015464
          | 
  Modelse |  .3048548   .2058274   .3062941   .3085094     .2922305   .2019903   .2079367    .211888
          |   .000532   .0002157   .0004706   .0004811     .0003659   .0001489   .0001678   .0001907
          | 
  CIwidth |  1.178335    .802491   1.187637   1.195883     1.136844   .7896402   .8125015   .8273879
          |  .0019894   .0008355   .0017631   .0017988     .0014074   .0005827     .00065   .0007282
          | 
 Relerror |  .6419234  -.5184007   1.715628   1.848428    -.6293141   .2592178  -.2596578   -.753965
          |  .7330312    .711162   .7360551   .7375182     .7136225   .7128181   .7098851   .7074718
          | 
    Cover |     94.31      94.66      94.83       94.9        94.09       94.6      94.48      94.39
          |  .2316515   .2248297   .2214206   .2199977     .2358118   .2260177   .2283702   .2301147
          | 
    Power |     18.62      31.41      17.67      17.59         5.91        5.4       5.52       5.61
          |   .389268   .4641564   .3814146   .3807351     .2358118   .2260177   .2283702   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. siman analyse, ref(IMPALL) replace 
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------------------------------------------------------
Performan |                                    target and method                                    
ce        | ------------------ inter -----------------    ------------------ main ------------------
measure   |        CC    FULLDAT     IMPALL     IMPBYZ           CC    FULLDAT     IMPALL     IMPBYZ
----------+-----------------------------------------------------------------------------------------
  Estreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
   SEreps |     10000      10000      10000      10000        10000      10000      10000      10000
          |                                                                                         
          | 
     Bias |  .0059115   .0015333   .0052478   .0059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
  Pctbias |  1.970502   .5110834   1.749251   1.970502                                              
          |  1.009701   .6896664   1.003759   1.009701                                              
          | 
     Mean |  .3059115   .3015333   .3052478   .3059115    -.0014899  -.0024519  -.0031501  -.0027479
          |  .0030291    .002069   .0030113   .0030291     .0029408   .0020147   .0020848    .002135
          | 
    Empse |  .3029104   .2068999   .3011278   .3029104     .2940812    .201468    .208478   .2134977
          |   .002142   .0014631   .0021294    .002142     .0020796   .0014247   .0014742   .0015097
          | 
  Relprec | -1.173477   111.8269          0  -1.173477    -49.74422       7.08          0  -4.647047
          |  .2392399   3.137143          0   .2392399     .7155758   .5932311          0     .30209
          | 
      MSE |  .0917805   .0428056   .0906964   .0917805     .0864773   .0405913   .0434687   .0455843
          |  .0013657   .0006159   .0013496   .0013657     .0012391   .0005911   .0006277   .0006603
          | 
     RMSE |  .3029529   .2068953   .3011585   .3029529     .2940703   .2014729   .2084914   .2135047
          |   .002254   .0014884   .0022407    .002254     .0021068    .001467   .0015053   .0015464
          | 
  Modelse |  .3048548   .2058274   .3062941   .3085094     .2922305   .2019903   .2079367    .211888
          |   .000532   .0002157   .0004706   .0004811     .0003659   .0001489   .0001678   .0001907
          | 
  CIwidth |  1.178335    .802491   1.187637   1.195883     1.136844   .7896402   .8125015   .8273879
          |  .0019894   .0008355   .0017631   .0017988     .0014074   .0005827     .00065   .0007282
          | 
 Relerror |  .6419234  -.5184007   1.715628   1.848428    -.6293141   .2592178  -.2596578   -.753965
          |  .7330312    .711162   .7360551   .7375182     .7136225   .7128181   .7098851   .7074718
          | 
    Cover |     94.31      94.66      94.83       94.9        94.09       94.6      94.48      94.39
          |  .2316515   .2248297   .2214206   .2199977     .2358118   .2260177   .2283702   .2301147
          | 
    Power |     18.62      31.41      17.67      17.59         5.91        5.4       5.52       5.61
          |   .389268   .4641564   .3814146   .3807351     .2358118   .2260177   .2283702   .2301147
----------------------------------------------------------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. 
. * check get error if true is not constant across methods
. use "$testpath/data/msgbsl_inter_try_postfile.dta", clear

. rename inter binter

. rename main bmain

. gen trueinter=.3

. gen truemain=0

. * introduce error
. replace trueinter = 0.5 in 2
(1 real change made)

. cap siman setup, rep(i) target(inter main) method(method) est(b) se(se) true(true) dgm(parm1)

. assert _rc==498

. 
. /*
> TEST LCI, UCI, P OPTIONS
>         use long-long data 
>         use non-default cilevel as tougher test
> */
. 
. * using SE: store results as comparators
. use "$testpath/data/simlongESTPM_longE_longM.dta", clear

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse bias ciwidth cover power, level(80) debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p() method(method) id(rep) b
> y(true dgm estimand) bias ciwidth cover power clear mcse gen(_perfmeas)  level(80)  semissingok

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations               16   ->   32          
Number of variables                   9   ->   8           
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table, tabdisp

--------------------------------------------------------
dgm and   |
Performan |             estimand and method             
ce        | ------- beta -------    ------- gamma ------
measure   |         1          2            1          2
----------+---------------------------------------------
1         |
     Bias | -.0043991  -.0025973     .0005151   .0056354
          |  .0024993   .0035644     .0025476   .0035789
          | 
  CIwidth |  .2014349   .2899728     .2017357   .2909772
          |  .0004004   .0008642     .0003738   .0008659
          | 
    Cover |      80.1       81.5         79.5       78.5
          |  1.262533   1.227905     1.276617   1.299134
          | 
    Power |      19.9       18.5         20.5       21.5
          |  1.262533   1.227905     1.276617   1.299134
----------+---------------------------------------------
2         |
     Bias | -.0046965  -.0058509     .0005948   .0065072
          |  .0028908   .0039932     .0029417   .0041326
          | 
  CIwidth |  .2328909   .3352942     .2329444   .3359915
          |  .0004466   .0009704     .0004316   .0009999
          | 
    Cover |      80.3       83.3         79.5       78.5
          |   1.25774   1.179453     1.276617   1.299134
          | 
    Power |      19.7       16.7         20.5       21.5
          |   1.25774   1.179453     1.276617   1.299134
--------------------------------------------------------
Note: Coverage and Power calculated at 80% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. foreach pm in bias ciwidth cover power {
  2.         summ est if _perfmeascode=="`pm'"
  3.         local `pm'ref = r(mean)
  4. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8   -.0005364    .0047027  -.0058509   .0065072

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       80.15    1.606239       78.5       83.3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. 
. * using LCI and UCI: compare ciwidth, coverage and power
. use "$testpath/data/simlongESTPM_longE_longM.dta", clear

. gen lower = est - invnorm(.9)*se

. gen upper = est + invnorm(.9)*se

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) lci
> (lower) uci(upper)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          lower upper
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse ciwidth cover power, debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci(lower) uci(upper) p() method(method)
>  id(rep) by(true dgm estimand) ciwidth cover power clear mcse gen(_perfmeas)  level(95)  semissing
> ok

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations               12   ->   24          
Number of variables                   9   ->   8           
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------
dgm and   |
Performan |           estimand and method           
ce        | ------ beta ------    ------ gamma -----
measure   |        1         2           1         2
----------+-----------------------------------------
1         |
  CIwidth | .2014349  .2899728    .2017357  .2909772
          | .0004004  .0008642    .0003738  .0008659
          | 
    Cover |     80.1      81.5        79.5      78.5
          | 1.262533  1.227905    1.276617  1.299134
          | 
    Power |     19.9      18.5        20.5      21.5
          | 1.262533  1.227905    1.276617  1.299134
----------+-----------------------------------------
2         |
  CIwidth | .2328909  .3352942    .2329444  .3359915
          | .0004466  .0009704    .0004316  .0009999
          | 
    Cover |     80.3      83.3        79.5      78.5
          |  1.25774  1.179453    1.276617  1.299134
          | 
    Power |     19.7      16.7        20.5      21.5
          |  1.25774  1.179453    1.276617  1.299134
----------------------------------------------------
Note: Coverage and Power calculated at 95% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .2651552 7.361e-09

. assert reldif(`ciwidthref', r(mean))<1E-8

. summ est if _perfmeascode=="cover"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       80.15    1.606239       78.5       83.3

. di `coverref', r(mean),reldif(`coverref', r(mean))
80.150001 80.150001 0

. assert reldif(`coverref', r(mean))<1E-8

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 19.85 1.704e-16

. assert reldif(`powerref', r(mean))<1E-8

. 
. * using P: compare ciwidth and power
. use "$testpath/data/simlongESTPM_longE_longM.dta", clear

. gen pvalue = 2*normprob(-abs(est)/se)

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) p(p
> value)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               pvalue
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse ciwidth power, level(80) debug
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p(pvalue) method(method) id(
> rep) by(true dgm estimand) ciwidth power clear mcse gen(_perfmeas)  level(80)  semissingok

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations                8   ->   16          
Number of variables                   9   ->   8           
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------
dgm and   |
Performan |           estimand and method           
ce        | ------ beta ------    ------ gamma -----
measure   |        1         2           1         2
----------+-----------------------------------------
1         |
  CIwidth | .2014349  .2899728    .2017357  .2909772
          | .0004004  .0008642    .0003738  .0008659
          | 
    Power |     19.9      18.5        20.5      21.5
          | 1.262533  1.227905    1.276617  1.299134
----------+-----------------------------------------
2         |
  CIwidth | .2328909  .3352942    .2329444  .3359915
          | .0004466  .0009704    .0004316  .0009999
          | 
    Power |     19.7      16.7        20.5      21.5
          |  1.25774  1.179453    1.276617  1.299134
----------------------------------------------------
Note: Power calculated at 80% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .2651552    .0552666   .2014349   .3359915

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .26515521 0

. assert reldif(`ciwidthref', r(mean))<1E-8

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8       19.85    1.606238       16.7       21.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 19.85 1.704e-16

. assert reldif(`powerref', r(mean))<1E-8

. 
. * using P wrongly: compare ciwidth and power
. use "$testpath/data/simlongESTPM_longE_longM.dta", clear

. gen pvalue = 2*normprob(-abs(est)/se)

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) p(p
> value)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               pvalue
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse ciwidth power, debug // NB default level
Debug: options to pass to simsum: 
Debug: method values are 1 2
Debug: running command: simsum est , true(true) se(se) df() lci() uci() p(pvalue) method(method) id(
> rep) by(true dgm estimand) ciwidth power clear mcse gen(_perfmeas)  level(95)  semissingok

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations                8   ->   16          
Number of variables                   9   ->   8           
j variable (2 values)                     ->   method
xij variables:
                              est1 est2   ->   est
                                se1 se2   ->   se
-----------------------------------------------------------------------------
siman analyse has run successfully

. siman table, tabdisp

----------------------------------------------------
dgm and   |
Performan |           estimand and method           
ce        | ------ beta ------    ------ gamma -----
measure   |        1         2           1         2
----------+-----------------------------------------
1         |
  CIwidth | .3080681  .4434751    .3085282  .4450112
          | .0006123  .0013217    .0005716  .0013243
          | 
    Power |      5.3       4.3         5.5       3.6
          | .7084561  .6414905    .7209369   .589101
----------+-----------------------------------------
2         |
  CIwidth |  .356176  .5127883    .3562577  .5138547
          |  .000683  .0014841    .0006601  .0015292
          | 
    Power |        5       4.4         5.5       3.6
          | .6892024  .6485677    .7209369   .589101
----------------------------------------------------
Note: Power calculated at 95% level
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. summ est if _perfmeascode=="ciwidth"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8    .4055199     .084523   .3080681   .5138547

. di `ciwidthref', r(mean),reldif(`ciwidthref', r(mean))
.26515521 .40551991 .09986674

. assert reldif(`ciwidthref', r(mean))>1E-2

. summ est if _perfmeascode=="power"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8        4.65    .7910211        3.6        5.5

. di `powerref', r(mean),reldif(`powerref', r(mean))
19.85 4.65 2.6902655

. assert reldif(`powerref', r(mean))>1E-2

. 
. * test with no se: compare bias
. use "$testpath/data/simlongESTPM_longE_longM.dta", clear

. drop se

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    -
  df variable:                    -
  Conf. limit variables:          -
  p-value variable:               -
  True value variable:            true

Estimates data                    in data
Performance statistics            not in data
_____________________________________________________

. siman analyse bias
siman analyse has created variable _se to hold the MCSE
siman analyse has run successfully

. siman table, tabdisp

--------------------------------------------------------
dgm and   |
Performan |             estimand and method             
ce        | ------- beta -------    ------- gamma ------
measure   |         1          2            1          2
----------+---------------------------------------------
1         |
     Bias | -.0043991  -.0025973     .0005151   .0056354
          |  .0024993   .0035644     .0025476   .0035789
----------+---------------------------------------------
2         |
     Bias | -.0046965  -.0058509     .0005948   .0065072
          |  .0028908   .0039932     .0029417   .0041326
--------------------------------------------------------
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. summ est if _perfmeascode=="bias"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         est |          8   -.0005364    .0047027  -.0058509   .0065072

. di `biasref', r(mean),reldif(`biasref', r(mean))
-.00053642 -.00053642 8.669e-18

. assert reldif(`biasref', r(mean))<1E-8

. 
. * test analyse with if
. siman analyse if dgm==2, replace
siman analyse has created variable _se to hold the MCSE
siman analyse has run successfully

. siman table, tabdisp

--------------------------------------------------------
Performan |             estimand and method             
ce        | ------- beta -------    ------- gamma ------
measure   |         1          2            1          2
----------+---------------------------------------------
  Estreps |      1000       1000         1000       1000
          |                                             
          | 
     Bias | -.0046965  -.0058509     .0005948   .0065072
          |  .0028908   .0039932     .0029417   .0041326
          | 
  Pctbias |                                             
          |                                             
          | 
     Mean | -.0046965  -.0058509     .0005948   .0065072
          |  .0028908   .0039932     .0029417   .0041326
          | 
    Empse |  .0914144   .1262755     .0930244   .1306846
          |  .0020451    .002825     .0020811   .0029237
          | 
  Relprec |         0  -47.59274            0  -49.33068
          |         0   2.430245            0   2.314097
          | 
      MSE |  .0083703   .0159638     .0086452   .0171037
          |  .0003797   .0007445     .0003795   .0007105
          | 
     RMSE |  .0914893   .1263479     .0929798   .1307813
          |  .0020748   .0029462      .002041   .0027163
--------------------------------------------------------
Note: where there are multiple entries per performance measure, these are estimated performance,
  followed by Monte Carlo standard error

. count if dgm==1
  4,000

. assert r(N)==4000

. 
. di as result "*** SIMAN HAS PASSED ALL THE TESTS IN `filename'.do ***"
*** SIMAN HAS PASSED ALL THE TESTS IN test_siman_widelong.do ***

. 
. log close
