-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\git\siman\Ella_testing\data\testing_simandescribe.log
  log type:  text
 opened on:  16 Jan 2023, 17:11:07

. 
. 
. * Format 1: Long-long
. ***********************
. use simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longwide  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_longE_longM1.dta, clear

. siman_setup, rep(repit) dgm(d) target(estim) method(meth) estimate(est_data) se(se_data) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates variable is:        est_data
The se variable is:               se_data
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longwide  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates stub is:            est_data
The se stub is:                   se_data
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longlong

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates variable is:        est_data
The se variable is:               se_data
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. 
. use estimates.dta, clear

. siman_setup, rep(idrep) dgm(dgm) method(method) estimate(theta) se(se)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            1 2 3

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        theta
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longwide  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            1 2 3

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            theta
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longlong

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            1 2 3

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        theta
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. 
. * no estimate data
. use simlongESTPM_longE_longM_noest.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are not contained in the dataset

The estimates variable is:        N/A
The se variable is:               N/A
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. * Format 2: Wide-wide
. ***********************
. use simlongESTPM_wideE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) true(true) order(met
> hod)   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                              

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. use simlongESTPM_wideE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(metho
> d)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_wideE_wideM2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta_ gamma_) method(1 2) estimate(est) se(se) true(true) order(tar
> get) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_wideE_wideM3.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(targe
> t) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_wideE_wideM4.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(A_ B_) estimate(est) se(se) true(true) order(met
> hod) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong     

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_wideE_wideM5.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) p(p) df(df) true(tru
> e) order(method) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   df
The ci stubs are:                 N/A
The p stub is:                    p
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong    

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               df
The ci variables are:             N/A
The p variable is:                p
The true variable is:             true
_____________________________________________________

. 
. 
. * Format 3: Long-wide
. ***********************
. use simlongESTPM_longE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est) se(se) true(true) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_longE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est_) se(se_) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est_
The se stub is:                   se_
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong    

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longwide                  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. 
. 
. use simlongESTPM_longE_wideM2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(A B) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            1 2

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong     

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            1 2

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. 
. * Format 4: Wide-long
. ***********************
. 
. use simlongESTPM_longM_wideE.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta_ gamma_) method(method) estimate(est) se(se) true(true)  
(2,000 real changes made)
(2,000 real changes made)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. use simlongESTPM_longM_wideE1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(method) estimate(est_) se(se_) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est_
The se stub is:                   se_
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                      

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longwide

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. 
. use simlongESTPM_longM_wideE2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(1 2) method(method) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            1 2

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            1 2

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. log close
      name:  <unnamed>
       log:  C:\git\siman\Ella_testing\data\testing_simandescribe.log
  log type:  text
 closed on:  16 Jan 2023, 17:11:09
-----------------------------------------------------------------------------------------------------------
