-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\git\siman\Ella_testing\data\test_file_for_siman_data_progs.log
  log type:  text
 opened on:  11 Dec 2023, 19:26:19

. 
.           
. * Format 1: Long-long
. ***********************
. use simlongESTPM_longE_longM.dta, clear

. gen dgm_new = "1"

. replace dgm_new = "2" if dgm == 2
(4,000 real changes made)

. drop dgm

. siman_setup, rep(rep) dgm(dgm_new) target(estimand) method(method) estimate(est) se(se) true(true)
  variable dgm_new was long now byte
  (24,000 bytes saved)
Warning: variable dgm_new, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode dgm_new as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm_new (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. * warning message as required
. siman_reshape, longwide

. siman_reshape, longlong                   

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm_new, estimand    |
and performance      |        method       
measure              |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_analyse, perfonly
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. * check that note about mcse's in siman table is not present if no mcses are reported
. use simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)                   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. replace se = .
(8,000 real changes made, 8,000 to missing)

. siman_table

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. * note is not displayed as required
. 
. * check 'if' option
. * setup
. use simlongESTPM_longE_longM.dta, clear

. siman_setup if dgm==1, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
(4,000 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      1
The dgm variables (# levels):     dgm (1) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. use simlongESTPM_longE_longM.dta, clear

. siman_setup if estimand=="beta", rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true
> ) clear
(4,000 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         1
The target values are:            beta

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. * analyse
. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
-------------------------------------------

. * the 'if' carries through from setup, with siman table using that also as required.
. 
. * check specifying a different 'if' for analyse
. use simlongESTPM_longE_longM.dta, clear

. siman_setup if dgm==1, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
(4,000 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      1
The dgm variables (# levels):     dgm (1) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_analyse if estimand=="beta"
siman analyse has run successfully

-------------------------------------------
estimand and         |        method       
performance measure  |         1          2
---------------------+---------------------
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
-------------------------------------------

. * siman table uses the analyse 'if' too as required (i.e. dgm=1 AND estimand=beta)
. * trying a different 'if' for siman table
. siman_table if method==1

--------------------------------
estimand and         |  method  
performance measure  |         1
---------------------+----------
beta                 |
               bsims |      1000
                     |          
                     | 
              sesims |      1000
                     |          
                     | 
                bias | -.0043991
                     |          
                     | 
                mean | -.0043991
                     |          
                     | 
               empse |  .0790336
                     |          
                     | 
             relprec |          
                     |          
                     | 
                 mse |  .0062594
                     |          
                     | 
                rmse |  .0791165
                     |          
                     | 
             modelse |  .0787452
                     |          
                     | 
             ciwidth |  .3080681
                     |          
                     | 
            relerror | -.3649609
                     |          
                     | 
               cover |      94.7
                     |          
                     | 
               power |       5.3
                     |          
--------------------------------

. * yes, adds the additional criteria of method=1 to siman table as required (e.g. dgm=1 AND estimand=beta AND meth
> od=1).
. 
. * try to use an 'if' condition on rep (not allowed) in siman analyse
. use simlongESTPM_longE_longM.dta, clear

. siman_setup if rep==1, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
(7,992 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. /*
> use simlongESTPM_longE_longM.dta, clear
> siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
> siman_analyse if rep==1
> * obtain the error message "The 'if' option can not be applied to 'rep' in siman_analyse." as required
> */
. 
. * check 'in' option
. * setup
. use simlongESTPM_longE_longM.dta, clear

. siman_setup in 1/100, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
(7,900 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. use simlongESTPM_longE_longM.dta, clear

. siman_setup in 1/20, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true) clear
(7,980 observations deleted)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. * analyse
. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |         3          3
                     |                     
                     | 
              sesims |         3          3
                     |                     
                     | 
                bias | -.0443132  -.0112619
                     |                     
                     | 
                mean | -.0443132  -.0112619
                     |                     
                     | 
               empse |  .1780595   .2625861
                     |                     
                     | 
             relprec |            -54.01814
                     |                     
                     | 
                 mse |  .0231004   .0460945
                     |                     
                     | 
                rmse |  .1519883   .2146962
                     |                     
                     | 
             modelse |  .0787338   .1139313
                     |                     
                     | 
             ciwidth |  .3085018   .4459795
                     |                     
                     | 
            relerror | -55.78228  -56.61185
                     |                     
                     | 
               cover |  33.33333   33.33333
                     |                     
                     | 
               power |  66.66666   66.66666
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |         3          3
                     |                     
                     | 
              sesims |         3          3
                     |                     
                     | 
                bias | -.0263141   .0322262
                     |                     
                     | 
                mean | -.0263141   .0322262
                     |                     
                     | 
               empse |  .0272416    .147677
                     |                     
                     | 
             relprec |            -96.59718
                     |                     
                     | 
                 mse |  .0011872   .0155775
                     |                     
                     | 
                rmse |  .0344553     .12481
                     |                     
                     | 
             modelse |  .0767338   .1124603
                     |                     
                     | 
             ciwidth |   .300547   .4406566
                     |                     
                     | 
            relerror |  181.6787  -23.84716
                     |                     
                     | 
               cover |       100        100
                     |                     
                     | 
               power |         0          0
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |         2          2
                     |                     
                     | 
              sesims |         2          2
                     |                     
                     | 
                bias | -.1235948  -.1542079
                     |                     
                     | 
                mean | -.1235948  -.1542079
                     |                     
                     | 
               empse |   .014338    .000192
                     |                     
                     | 
             relprec |             557747.6
                     |                     
                     | 
                 mse |  .0153785   .0237801
                     |                     
                     | 
                rmse |  .1240099    .154208
                     |                     
                     | 
             modelse |   .093685   .1361976
                     |                     
                     | 
             ciwidth |   .367222   .5336785
                     |                     
                     | 
            relerror |  553.4053   70847.95
                     |                     
                     | 
               cover |       100        100
                     |                     
                     | 
               power |         0          0
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |         2          2
                     |                     
                     | 
              sesims |         2          2
                     |                     
                     | 
                bias | -.0469959  -.0037497
                     |                     
                     | 
                mean | -.0469959  -.0037497
                     |                     
                     | 
               empse |  .0179831   .2192921
                     |                     
                     | 
             relprec |            -99.32751
                     |                     
                     | 
                 mse |  .0023703   .0240586
                     |                     
                     | 
                rmse |  .0486858   .1551083
                     |                     
                     | 
             modelse |  .0894366   .1318336
                     |                     
                     | 
             ciwidth |  .3502093   .5166497
                     |                     
                     | 
            relerror |  397.3367  -39.88219
                     |                     
                     | 
               cover |       100        100
                     |                     
                     | 
               power |         0          0
                     |                     
-------------------------------------------

. * the 'in' carries through from setup, with siman table using that also as required.
. 
. * check siman_analyse works for specified performance measures
. use simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)                   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_analyse bias empse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
                bias | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
---------------------+---------------------
1                    |
gamma                |
                bias |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
---------------------+---------------------
2                    |
beta                 |
                bias | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
---------------------+---------------------
2                    |
gamma                |
                bias |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
-------------------------------------------

. 
. * missing target
. * creating a data set that has long method and missing target
. use simlongESTPM_longE_longM.dta, clear

. drop estimand

. bysort rep dgm method: gen repitionindi=_n

. drop if repitionindi==2
(4,000 observations deleted)

. drop repitionindi

. siman_setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longwide

. siman_reshape, longlong   

. 
. 
. * missing method
. * creating a data set that has long target and missing method
. use simlongESTPM_longE_longM.dta, clear

. drop method

. bysort rep dgm estimand: gen repitionindi=_n

. drop if repitionindi==2
(4,000 observations deleted)

. drop repitionindi

. siman_setup, rep(rep) dgm(dgm) target(estimand) estimate(est) se(se) true(true)
WARNING: no method specified, siman will proceed assuming there is only one method.
If this is a mistake, enter method() option in -siman setup-

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         1
The method values are:            1

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. * siman_reshape, longwide 
. *gives error message as expected, as can not reshape targets to wide format.
.               
. * more datasets
. use simlongESTPM_longE_longM1.dta, clear

. siman_setup, rep(repit) dgm(d) target(estim) method(meth) estimate(est_data) se(se_data)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates variable is:        est_data
The se variable is:               se_data
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longwide

. siman_reshape, longlong 

. siman_analyse                             
siman analyse has run successfully

-------------------------------------------
d, estim and         |         meth        
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_longE_longM1.dta, clear

. siman_setup, rep(repit) dgm(d) target(estim) method(meth) estimate(est_data) se(se_data)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates variable is:        est_data
The se variable is:               se_data
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_analyse, perfonly
siman analyse has run successfully

-------------------------------------------
d, estim and         |         meth        
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. use estimates.dta, clear

. drop conv error

. siman_setup, rep(idrep) dgm(dgm) method(method) estimate(theta) se(se)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            Exponential Weibull Cox

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        theta
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longwide

. siman_reshape, longlong 

. siman_analyse  
siman analyse has run successfully

------------------------------------------------------------
Data-generating      |
mechanism and        |                method                
performance measure  | Exponential      Weibull          Cox
---------------------+--------------------------------------
DGM: =1             |
               bsims |        1600         1600         1600
                     |                                      
                     | 
              sesims |        1600         1600         1600
                     |                                      
                     | 
                mean |   -.5028889    -.5032491    -.5020887
                     |    .0052317     .0052358     .0052278
                     | 
               empse |    .2092671     .2094332     .2091107
                     |    .0037005     .0037034     .0036977
                     | 
             relprec |                -.1586156     .1496443
                     |                 .1333862      .164665
                     | 
             modelse |    .2078957     .2079657      .208001
                     |    .0002499     .0002502     .0002502
                     | 
             ciwidth |    .8140112     .8142841     .8144225
                     |    .0009707     .0009716     .0009718
                     | 
            relerror |   -.6553342    -.7007202    -.5306495
                     |    1.760785     1.759986     1.763001
                     | 
               power |          69      68.8125      68.9375
                     |    1.156233     1.158148     1.156874
---------------------+--------------------------------------
DGM: =1.5           |
               bsims |        1600         1600         1600
                     |                                      
                     | 
              sesims |        1600         1600         1600
                     |                                      
                     | 
                mean |   -.4505783    -.4951536     -.493799
                     |    .0034518      .003789     .0037769
                     | 
               empse |    .1380708     .1515588     .1510758
                     |    .0024415       .00268     .0026715
                     | 
             relprec |                -17.00703    -16.47552
                     |                 .3077069     .3363895
                     | 
             modelse |    .1538938     .1541196     .1542292
                     |    .0001081     .0001087     .0001088
                     | 
             ciwidth |    .6030168        .6039     .6043292
                     |    .0004216      .000424     .0004244
                     | 
            relerror |    11.46005     1.689667     2.087316
                     |    1.972524     1.799628     1.806666
                     | 
               power |      86.375       89.625      89.5625
                     |    .8576346     .7623399      .764366
------------------------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. siman_reshape, longwide                     

. use estimates.dta, clear

. drop conv error

. siman_setup, rep(idrep) dgm(dgm) method(method) estimate(theta) se(se)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            Exponential Weibull Cox

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        theta
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_analyse, perfonly
siman analyse has run successfully

------------------------------------------------------------
Data-generating      |
mechanism and        |                method                
performance measure  | Exponential      Weibull          Cox
---------------------+--------------------------------------
DGM: =1             |
               bsims |        1600         1600         1600
                     |                                      
                     | 
              sesims |        1600         1600         1600
                     |                                      
                     | 
                mean |   -.5028889    -.5032491    -.5020887
                     |    .0052317     .0052358     .0052278
                     | 
               empse |    .2092671     .2094332     .2091107
                     |    .0037005     .0037034     .0036977
                     | 
             relprec |                -.1586156     .1496443
                     |                 .1333862      .164665
                     | 
             modelse |    .2078957     .2079657      .208001
                     |    .0002499     .0002502     .0002502
                     | 
             ciwidth |    .8140112     .8142841     .8144225
                     |    .0009707     .0009716     .0009718
                     | 
            relerror |   -.6553342    -.7007202    -.5306495
                     |    1.760785     1.759986     1.763001
                     | 
               power |          69      68.8125      68.9375
                     |    1.156233     1.158148     1.156874
---------------------+--------------------------------------
DGM: =1.5           |
               bsims |        1600         1600         1600
                     |                                      
                     | 
              sesims |        1600         1600         1600
                     |                                      
                     | 
                mean |   -.4505783    -.4951536     -.493799
                     |    .0034518      .003789     .0037769
                     | 
               empse |    .1380708     .1515588     .1510758
                     |    .0024415       .00268     .0026715
                     | 
             relprec |                -17.00703    -16.47552
                     |                 .3077069     .3363895
                     | 
             modelse |    .1538938     .1541196     .1542292
                     |    .0001081     .0001087     .0001088
                     | 
             ciwidth |    .6030168        .6039     .6043292
                     |    .0004216      .000424     .0004244
                     | 
            relerror |    11.46005     1.689667     2.087316
                     |    1.972524     1.799628     1.806666
                     | 
               power |      86.375       89.625      89.5625
                     |    .8576346     .7623399      .764366
------------------------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. 
. 
. * Ian's example in his testing file (missing target)
. use estimates.dta, clear

. drop conv error

. reshape wide theta se, i(idrep dgm) j(method)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     9600   ->    3200
Number of variables                   5   ->       8
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  theta   ->   theta1 theta2 theta3
                                     se   ->   se1 se2 se3
-----------------------------------------------------------------------------

. siman setup, rep(idrep) dgm(dgm) method(1 2 3) est(theta) se(se) 

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            1 2 3

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            theta
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             N/A
_____________________________________________________

. * is ok
. 
. * Different true values per target
. use simlongESTPM_longE_longM.dta, clear

. replace true=0.5 if estimand=="beta"
(4,000 real changes made)

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longwide

. siman_reshape, longlong 

. 
. * no estimate data
. use simlongESTPM_longE_longM_noest.dta, clear

. cap siman_setup, rep(rep) dgm(dgm) se(se) target(estimand) method(method) true(true)

. assert _rc!=0

. * error message as required
. 
. 
. * testing CIs
. use estimates.dta, clear

. drop conv error

. gen float lci = theta + (se*invnorm(.025))

. gen float uci = theta + (se*invnorm(.975))

. siman setup, rep(idrep) dgm(dgm) method(method) est(theta) se(se) lci(lci) uci(uci)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            Exponential Weibull Cox

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        theta
The se variable is:               se
The df variable is:               N/A
The ci variables are:             lci uci
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longwide

. siman_reshape, longlong 

. 
. 
. * Format 2: Wide-wide
. ***********************
. clear all

. prog drop _all

. use simlongESTPM_wideE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) true(true) order(method)   
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide                

. siman_reshape, longlong  

. use simlongESTPM_wideE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) true(true) order(method)    
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_analyse                                                           
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. use simlongESTPM_wideE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse, perfonly
siman analyse has run successfully

-----------------------------------------------------------------
dgm, target and      |                   method                  
performance measure  |         1     1_mcse          2     2_mcse
---------------------+-------------------------------------------
1                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
                mean | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
               empse |  .0790336   .0017681   .1127159   .0025217
                     |                                           
                     | 
             relprec |                        -50.8353    2.28676
                     |                                           
                     | 
                 mse |  .0062594   .0002881   .0126989   .0006187
                     |                                           
                     | 
                rmse |  .0791165   .0018209   .1126895   .0027454
                     |                                           
                     | 
             modelse |  .0787452   .0001572   .1136343   .0003405
                     |                                           
                     | 
             ciwidth |  .3080681   .0006123   .4434751   .0013217
                     |                                           
                     | 
            relerror | -.3649609   2.237882   .8147949   2.275551
                     |                                           
                     | 
               cover |      94.7   .7084563       95.7   .6414907
                     |                                           
                     | 
               power |       5.3   .7084561        4.3   .6414905
                     |                                           
---------------------+-------------------------------------------
1                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
                mean |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
               empse |  .0805615   .0018023   .1131762    .002532
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0064839   .0002847   .0128278   .0005329
                     |                                           
                     | 
                rmse |  .0805229   .0017676   .1132599   .0023524
                     |                                           
                     | 
             modelse |  .0788425   .0001466   .1140264   .0003426
                     |                                           
                     | 
             ciwidth |  .3085282   .0005716   .4450112   .0013243
                     |                                           
                     | 
            relerror | -2.133844   2.196998   .7512448   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
---------------------+-------------------------------------------
2                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
                mean | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
               empse |  .0914144   .0020451   .1262755    .002825
                     |                                           
                     | 
             relprec |                       -47.59274   2.430245
                     |                                           
                     | 
                 mse |  .0083703   .0003797   .0159638   .0007445
                     |                                           
                     | 
                rmse |  .0914893   .0020748   .1263479   .0029462
                     |                                           
                     | 
             modelse |  .0910296   .0001752   .1313619   .0003826
                     |                                           
                     | 
             ciwidth |   .356176    .000683   .5127883   .0014841
                     |                                           
                     | 
            relerror |  -.420924   2.236001   4.028049   2.346937
                     |                                           
                     | 
               cover |        95   .6892024       95.6   .6485677
                     |                                           
                     | 
               power |         5   .6892024        4.4   .6485677
                     |                                           
---------------------+-------------------------------------------
2                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
                mean |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
               empse |  .0930244   .0020811   .1306846   .0029237
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0086452   .0003795   .0171037   .0007105
                     |                                           
                     | 
                rmse |  .0929798    .002041   .1307813   .0027163
                     |                                           
                     | 
             modelse |  .0910394   .0001693   .1316664   .0003955
                     |                                           
                     | 
             ciwidth |  .3562577   .0006601   .5138547   .0015292
                     |                                           
                     | 
            relerror | -2.133846   2.196998    .751246   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
-----------------------------------------------------------------

. 
. * numeric true
. use simlongESTPM_wideE_wideM.dta, clear

. drop true

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) true(0.5) order(method)   
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             _true
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide                

. siman_reshape, longlong 

. siman_analyse 
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.5043991  -.5025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .2606585   .2652963
                     |                     
                     | 
                rmse |  .5105473   .5150692
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |         0        1.2
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994849  -.4943646
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .2559688   .2571924
                     |                     
                     | 
                rmse |  .5059336   .5071414
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |         0         .9
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.5046965  -.5058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .2630668   .2718147
                     |                     
                     | 
                rmse |  .5129004   .5213585
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |         0        3.7
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994052  -.4934928
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .2580504   .2605965
                     |                     
                     | 
                rmse |  .5079866   .5104866
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |         0        3.7
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. * missing target
. * creating a data set that has wide method and missing target
. use simlongESTPM_longE_wideM.dta, clear

. drop estimand

. bysort rep dgm: gen repitionindi=_n

. drop if repitionindi==2
(2,000 observations deleted)

. drop repitionindi

. * this is now like long-wide format with missing target
. siman_setup, rep(rep) dgm(dgm) method(1 2) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong 

. siman_reshape, longwide

. 
. * missing method
. * creating a data set that has wide target and missing method
. use simlongESTPM_wideE_nomethod.dta, clear

. * this is now like wide-long format with missing method
. siman_setup, rep(rep) dgm(dgm) target(beta gamma) estimate(est) se(se) true(true)  
WARNING: no method specified, siman will proceed assuming there is only one method.
If this is a mistake, enter method() option in -siman setup-
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         1
The method values are:            1

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. * auto reshapes to long-long as required                                    
. * siman_reshape, longwide
. * gives error message as expected, as can not reshape targets to wide format
. 
. use simlongESTPM_wideE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong 

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_wideE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse, perfonly
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. use simlongESTPM_wideE_wideM2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta_ gamma_) method(1 2) estimate(est) se(se) true(true) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                    

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_wideE_wideM2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta_ gamma_) method(1 2) estimate(est) se(se) true(true) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse,perfonly
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. use simlongESTPM_wideE_wideM3.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse              
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_wideE_wideM3.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse, perfonly
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. * numeric true
. use simlongESTPM_wideE_wideM3.dta, clear

. drop true

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(0.5) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             _true
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide

. siman_reshape, longlong

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.5043991  -.5025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .2606585   .2652963
                     |                     
                     | 
                rmse |  .5105473   .5150692
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |         0        1.2
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994849  -.4943646
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .2559688   .2571924
                     |                     
                     | 
                rmse |  .5059336   .5071414
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |         0         .9
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.5046965  -.5058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .2630668   .2718147
                     |                     
                     | 
                rmse |  .5129004   .5213585
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |         0        3.7
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994052  -.4934928
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .2580504   .2605965
                     |                     
                     | 
                rmse |  .5079866   .5104866
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |         0        3.7
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. use simlongESTPM_wideE_wideM4.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(A_ B_) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                

. siman_analyse               
siman analyse has run successfully

-----------------------------------------------------------------
dgm, target and      |                   method                  
performance measure  |         A     A_mcse          B     B_mcse
---------------------+-------------------------------------------
1                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
                mean | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
               empse |  .0790336   .0017681   .1127159   .0025217
                     |                                           
                     | 
             relprec |                        -50.8353    2.28676
                     |                                           
                     | 
                 mse |  .0062594   .0002881   .0126989   .0006187
                     |                                           
                     | 
                rmse |  .0791165   .0018209   .1126895   .0027454
                     |                                           
                     | 
             modelse |  .0787452   .0001572   .1136343   .0003405
                     |                                           
                     | 
             ciwidth |  .3080681   .0006123   .4434751   .0013217
                     |                                           
                     | 
            relerror | -.3649609   2.237882   .8147949   2.275551
                     |                                           
                     | 
               cover |      94.7   .7084563       95.7   .6414907
                     |                                           
                     | 
               power |       5.3   .7084561        4.3   .6414905
                     |                                           
---------------------+-------------------------------------------
1                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
                mean |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
               empse |  .0805615   .0018023   .1131762    .002532
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0064839   .0002847   .0128278   .0005329
                     |                                           
                     | 
                rmse |  .0805229   .0017676   .1132599   .0023524
                     |                                           
                     | 
             modelse |  .0788425   .0001466   .1140264   .0003426
                     |                                           
                     | 
             ciwidth |  .3085282   .0005716   .4450112   .0013243
                     |                                           
                     | 
            relerror | -2.133844   2.196998   .7512448   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
---------------------+-------------------------------------------
2                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
                mean | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
               empse |  .0914144   .0020451   .1262755    .002825
                     |                                           
                     | 
             relprec |                       -47.59274   2.430245
                     |                                           
                     | 
                 mse |  .0083703   .0003797   .0159638   .0007445
                     |                                           
                     | 
                rmse |  .0914893   .0020748   .1263479   .0029462
                     |                                           
                     | 
             modelse |  .0910296   .0001752   .1313619   .0003826
                     |                                           
                     | 
             ciwidth |   .356176    .000683   .5127883   .0014841
                     |                                           
                     | 
            relerror |  -.420924   2.236001   4.028049   2.346937
                     |                                           
                     | 
               cover |        95   .6892024       95.6   .6485677
                     |                                           
                     | 
               power |         5   .6892024        4.4   .6485677
                     |                                           
---------------------+-------------------------------------------
2                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
                mean |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
               empse |  .0930244   .0020811   .1306846   .0029237
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0086452   .0003795   .0171037   .0007105
                     |                                           
                     | 
                rmse |  .0929798    .002041   .1307813   .0027163
                     |                                           
                     | 
             modelse |  .0910394   .0001693   .1316664   .0003955
                     |                                           
                     | 
             ciwidth |  .3562577   .0006601   .5138547   .0015292
                     |                                           
                     | 
            relerror | -2.133846   2.196998    .751246   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
-----------------------------------------------------------------

. use simlongESTPM_wideE_wideM4.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(A_ B_) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse, perfonly
siman analyse has run successfully

-----------------------------------------------------------------
dgm, target and      |                   method                  
performance measure  |         A     A_mcse          B     B_mcse
---------------------+-------------------------------------------
1                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
                mean | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
               empse |  .0790336   .0017681   .1127159   .0025217
                     |                                           
                     | 
             relprec |                        -50.8353    2.28676
                     |                                           
                     | 
                 mse |  .0062594   .0002881   .0126989   .0006187
                     |                                           
                     | 
                rmse |  .0791165   .0018209   .1126895   .0027454
                     |                                           
                     | 
             modelse |  .0787452   .0001572   .1136343   .0003405
                     |                                           
                     | 
             ciwidth |  .3080681   .0006123   .4434751   .0013217
                     |                                           
                     | 
            relerror | -.3649609   2.237882   .8147949   2.275551
                     |                                           
                     | 
               cover |      94.7   .7084563       95.7   .6414907
                     |                                           
                     | 
               power |       5.3   .7084561        4.3   .6414905
                     |                                           
---------------------+-------------------------------------------
1                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
                mean |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
               empse |  .0805615   .0018023   .1131762    .002532
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0064839   .0002847   .0128278   .0005329
                     |                                           
                     | 
                rmse |  .0805229   .0017676   .1132599   .0023524
                     |                                           
                     | 
             modelse |  .0788425   .0001466   .1140264   .0003426
                     |                                           
                     | 
             ciwidth |  .3085282   .0005716   .4450112   .0013243
                     |                                           
                     | 
            relerror | -2.133844   2.196998   .7512448   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
---------------------+-------------------------------------------
2                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
                mean | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
               empse |  .0914144   .0020451   .1262755    .002825
                     |                                           
                     | 
             relprec |                       -47.59274   2.430245
                     |                                           
                     | 
                 mse |  .0083703   .0003797   .0159638   .0007445
                     |                                           
                     | 
                rmse |  .0914893   .0020748   .1263479   .0029462
                     |                                           
                     | 
             modelse |  .0910296   .0001752   .1313619   .0003826
                     |                                           
                     | 
             ciwidth |   .356176    .000683   .5127883   .0014841
                     |                                           
                     | 
            relerror |  -.420924   2.236001   4.028049   2.346937
                     |                                           
                     | 
               cover |        95   .6892024       95.6   .6485677
                     |                                           
                     | 
               power |         5   .6892024        4.4   .6485677
                     |                                           
---------------------+-------------------------------------------
2                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
                mean |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
               empse |  .0930244   .0020811   .1306846   .0029237
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0086452   .0003795   .0171037   .0007105
                     |                                           
                     | 
                rmse |  .0929798    .002041   .1307813   .0027163
                     |                                           
                     | 
             modelse |  .0910394   .0001693   .1316664   .0003955
                     |                                           
                     | 
             ciwidth |  .3562577   .0006601   .5138547   .0015292
                     |                                           
                     | 
            relerror | -2.133846   2.196998    .751246   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
-----------------------------------------------------------------

. 
. * try with different order of method variables for the following requirement:  When target or method is wide and 
> the user has specified values in the syntax statement, 
. * the order that the user has specified these values in will be preserved.  For example if the method variable ta
> kes the string values A, B, C and is in wide format, 
. * we would expect the user to enter method(A B C).  However if they enter method(C B A) then this order will be s
> hown in the output data from siman.
. use simlongESTPM_wideE_wideM4.dta, clear

. * re-order data
. order rep dgm true estB_beta seB_beta estA_beta seA_beta estB_gamma seB_gamma estA_gamma seA_gamma

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(B_ A_) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            B A

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. * method order preserved, as required.
. * However if we then do:
. siman_reshape, longlong

. * method is listed as A then B in long format, even though the reshape command is internally specifying the value
> s 'B A' to reshape on i.e.
. * reshape long est se, i(rep dgm target) j(method "B A") string
. * I can't find a way of getting Stata to list the long method values in a different order.
. 
. * try the above with a different order of target
. use simlongESTPM_wideE_wideM4.dta, clear

. * re-order data
. order rep dgm true estA_gamma seA_gamma estB_gamma seB_gamma estA_beta seA_beta estB_beta seB_beta

. siman_setup, rep(rep) dgm(dgm) target(gamma beta) method(A_ B_) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            gamma beta

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. * same issue as with method above, when target is auto-reshaped to long by siman-setup the order reverts to beta 
> gamma in the data set.
. 
. use simlongESTPM_wideE_wideM5.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) p(p) df(df) true(true) order
> (method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   df
The ci stubs are:                 N/A
The p stub is:                    p
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong     

. siman_reshape, longwide  

. siman_reshape, longlong 

. siman_analyse                
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. use simlongESTPM_wideE_wideM5.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1_ 2_) estimate(est) se(se) p(p) df(df) true(true) order
> (method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   df
The ci stubs are:                 N/A
The p stub is:                    p
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_analyse, perfonly
siman analyse has run successfully

-----------------------------------------------------------------
dgm, target and      |                   method                  
performance measure  |         1     1_mcse          2     2_mcse
---------------------+-------------------------------------------
1                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
                mean | -.0043991   .0024993  -.0025973   .0035644
                     |                                           
                     | 
               empse |  .0790336   .0017681   .1127159   .0025217
                     |                                           
                     | 
             relprec |                        -50.8353    2.28676
                     |                                           
                     | 
                 mse |  .0062594   .0002881   .0126989   .0006187
                     |                                           
                     | 
                rmse |  .0791165   .0018209   .1126895   .0027454
                     |                                           
                     | 
             modelse |  .0787452   .0001572   .1136343   .0003405
                     |                                           
                     | 
             ciwidth |  .3080681   .0006123   .4434751   .0013217
                     |                                           
                     | 
            relerror | -.3649609   2.237882   .8147949   2.275551
                     |                                           
                     | 
               cover |      94.7   .7084563       95.7   .6414907
                     |                                           
                     | 
               power |       5.3   .7084561        4.3   .6414905
                     |                                           
---------------------+-------------------------------------------
1                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
                mean |  .0005151   .0025476   .0056354   .0035789
                     |                                           
                     | 
               empse |  .0805615   .0018023   .1131762    .002532
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0064839   .0002847   .0128278   .0005329
                     |                                           
                     | 
                rmse |  .0805229   .0017676   .1132599   .0023524
                     |                                           
                     | 
             modelse |  .0788425   .0001466   .1140264   .0003426
                     |                                           
                     | 
             ciwidth |  .3085282   .0005716   .4450112   .0013243
                     |                                           
                     | 
            relerror | -2.133844   2.196998   .7512448   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
---------------------+-------------------------------------------
2                    |
beta                 |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
                mean | -.0046965   .0028908  -.0058509   .0039932
                     |                                           
                     | 
               empse |  .0914144   .0020451   .1262755    .002825
                     |                                           
                     | 
             relprec |                       -47.59274   2.430245
                     |                                           
                     | 
                 mse |  .0083703   .0003797   .0159638   .0007445
                     |                                           
                     | 
                rmse |  .0914893   .0020748   .1263479   .0029462
                     |                                           
                     | 
             modelse |  .0910296   .0001752   .1313619   .0003826
                     |                                           
                     | 
             ciwidth |   .356176    .000683   .5127883   .0014841
                     |                                           
                     | 
            relerror |  -.420924   2.236001   4.028049   2.346937
                     |                                           
                     | 
               cover |        95   .6892024       95.6   .6485677
                     |                                           
                     | 
               power |         5   .6892024        4.4   .6485677
                     |                                           
---------------------+-------------------------------------------
2                    |
gamma                |
               bsims |      1000                  1000           
                     |                                           
                     | 
              sesims |      1000                  1000           
                     |                                           
                     | 
                bias |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
                mean |  .0005948   .0029417   .0065072   .0041326
                     |                                           
                     | 
               empse |  .0930244   .0020811   .1306846   .0029237
                     |                                           
                     | 
             relprec |                       -49.33068   2.314097
                     |                                           
                     | 
                 mse |  .0086452   .0003795   .0171037   .0007105
                     |                                           
                     | 
                rmse |  .0929798    .002041   .1307813   .0027163
                     |                                           
                     | 
             modelse |  .0910394   .0001693   .1316664   .0003955
                     |                                           
                     | 
             ciwidth |  .3562577   .0006601   .5138547   .0015292
                     |                                           
                     | 
            relerror | -2.133846   2.196998    .751246   2.274225
                     |                                           
                     | 
               cover |      94.5   .7209369       96.4   .5891009
                     |                                           
                     | 
               power |       5.5   .7209369        3.6    .589101
                     |                                           
-----------------------------------------------------------------

. 
. clear all

. prog drop _all

. * Different true values for targets
. use simlongESTPM_wideE_wideM1.dta, clear

. drop true

. gen true1beta = 0

. gen true1gamma = 0.5

. gen true2beta = 0

. gen true2gamma = 0.5

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) method(1 2) estimate(est) se(se) true(true) order(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994849  -.4943646
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .2559688   .2571924
                     |   .002549   .0035508
                     | 
                rmse |  .5059336   .5071414
                     |  .0025191   .0035008
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |         0         .9
                     |         0    .298647
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994052  -.4934928
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .2580504   .2605965
                     |  .0029469   .0041033
                     | 
                rmse |  .5079866   .5104866
                     |  .0029006    .004019
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |         0        3.7
                     |         0   .5969171
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. siman_reshape, longlong

. siman_reshape, longwide

. 
. clear all

. prog drop _all

. use simlongESTPM_wideE_wideM2.dta, clear

. drop true

. gen truebeta_1 = 0

. gen truegamma_1 = 0.5

. gen truebeta_2 = 0

. gen truegamma_2 = 0.5

. siman_setup, rep(rep) dgm(dgm) target(beta_ gamma_) method(1 2) estimate(est) se(se) true(true) order(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994849  -.4943646
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .2559688   .2571924
                     |   .002549   .0035508
                     | 
                rmse |  .5059336   .5071414
                     |  .0025191   .0035008
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |         0         .9
                     |         0    .298647
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.4994052  -.4934928
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .2580504   .2605965
                     |  .0029469   .0041033
                     | 
                rmse |  .5079866   .5104866
                     |  .0029006    .004019
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |         0        3.7
                     |         0   .5969171
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. siman_reshape, longlong

. siman_reshape, longwide

. 
. clear all

. prog drop _all

. * wide targets, missing method
. use simlongESTPM_wideE_nomethod.dta, clear

. * this is now like wide-long format with missing method
. drop true

. * create different true values for targets
. gen truebeta = 0

. gen truegamma = 0.5

. siman_setup, rep(rep) dgm(dgm) target(beta gamma) estimate(est) se(se) true(true)  
WARNING: no method specified, siman will proceed assuming there is only one method.
If this is a mistake, enter method() option in -siman setup-
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         1
The method values are:            1

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, method and      |        target       
performance measure  |      beta      gamma
---------------------+---------------------
1                    |
1                    |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.4994849
                     |  .0024993   .0025476
                     | 
                mean | -.0043991   .0005151
                     |  .0024993   .0025476
                     | 
               empse |  .0790336   .0805615
                     |  .0017681   .0018023
                     | 
             relprec |                     
                     |                     
                     | 
                 mse |  .0062594   .2559688
                     |  .0002881    .002549
                     | 
                rmse |  .0791165   .5059336
                     |  .0018209   .0025191
                     | 
             modelse |  .0787452   .0788425
                     |  .0001572   .0001466
                     | 
             ciwidth |  .3080681   .3085282
                     |  .0006123   .0005716
                     | 
            relerror | -.3649609  -2.133844
                     |  2.237882   2.196998
                     | 
               cover |      94.7          0
                     |  .7084563          0
                     | 
               power |       5.3        5.5
                     |  .7084561   .7209369
---------------------+---------------------
2                    |
1                    |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.4994052
                     |  .0028908   .0029417
                     | 
                mean | -.0046965   .0005948
                     |  .0028908   .0029417
                     | 
               empse |  .0914144   .0930244
                     |  .0020451   .0020811
                     | 
             relprec |                     
                     |                     
                     | 
                 mse |  .0083703   .2580504
                     |  .0003797   .0029469
                     | 
                rmse |  .0914893   .5079866
                     |  .0020748   .0029006
                     | 
             modelse |  .0910296   .0910394
                     |  .0001752   .0001693
                     | 
             ciwidth |   .356176   .3562577
                     |   .000683   .0006601
                     | 
            relerror |  -.420924  -2.133846
                     |  2.236001   2.196998
                     | 
               cover |        95          0
                     |  .6892024          0
                     | 
               power |         5        5.5
                     |  .6892024   .7209369
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. * auto reshapes to long-long as required                                    
. * siman_reshape, longwide
. * gives error message as expected, as can not reshape targets to wide format
. 
. 
. * testing CIs
. * order = method
. use simlongESTPM_longE_longM1.dta, clear

. gen float lci = est_data + (se_data*invnorm(.025))

. gen float uci = est_data + (se_data*invnorm(.975))

. reshape wide est_data se_data lci uci, i(repit d estim) j(meth) 
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     8000   ->    4000
Number of variables                   8   ->      11
j variable (2 values)              meth   ->   (dropped)
xij variables:
                               est_data   ->   est_data1 est_data2
                                se_data   ->   se_data1 se_data2
                                    lci   ->   lci1 lci2
                                    uci   ->   uci1 uci2
-----------------------------------------------------------------------------

. reshape wide est_data1 est_data2 se_data1 se_data2 lci1 lci2 uci1 uci2, i(repit d) j(estim) string
(note: j = beta gamma)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4000   ->    2000
Number of variables                  11   ->      18
j variable (2 values)             estim   ->   (dropped)
xij variables:
                              est_data1   ->   est_data1beta est_data1gamma
                              est_data2   ->   est_data2beta est_data2gamma
                               se_data1   ->   se_data1beta se_data1gamma
                               se_data2   ->   se_data2beta se_data2gamma
                                   lci1   ->   lci1beta lci1gamma
                                   lci2   ->   lci2beta lci2gamma
                                   uci1   ->   uci1beta uci1gamma
                                   uci2   ->   uci2beta uci2gamma
-----------------------------------------------------------------------------

. siman_setup, rep(repit) dgm(d) target(beta gamma) method(1 2) estimate(est_data) se(se_data) lci(lci) uci(uci) or
> der(method)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates stub is:            est_data
The se stub is:                   se_data
The df stub is:                   N/A
The ci stubs are:                 lci uci
The p stub is:                    N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide

. siman_reshape, longlong 

. 
. * order = target
. use simlongESTPM_longE_longM1.dta, clear

. gen float lci = est_data + (se_data*invnorm(.025))

. gen float uci = est_data + (se_data*invnorm(.975))

. reshape wide est_data se_data lci uci, i(repit d meth) j(estim) string
(note: j = beta gamma)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     8000   ->    4000
Number of variables                   8   ->      11
j variable (2 values)             estim   ->   (dropped)
xij variables:
                               est_data   ->   est_databeta est_datagamma
                                se_data   ->   se_databeta se_datagamma
                                    lci   ->   lcibeta lcigamma
                                    uci   ->   ucibeta ucigamma
-----------------------------------------------------------------------------

. reshape wide est_databeta est_datagamma se_databeta se_datagamma lcibeta lcigamma ucibeta ucigamma, i(repit d) j(
> meth)
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     4000   ->    2000
Number of variables                  11   ->      18
j variable (2 values)              meth   ->   (dropped)
xij variables:
                           est_databeta   ->   est_databeta1 est_databeta2
                          est_datagamma   ->   est_datagamma1 est_datagamma2
                            se_databeta   ->   se_databeta1 se_databeta2
                           se_datagamma   ->   se_datagamma1 se_datagamma2
                                lcibeta   ->   lcibeta1 lcibeta2
                               lcigamma   ->   lcigamma1 lcigamma2
                                ucibeta   ->   ucibeta1 ucibeta2
                               ucigamma   ->   ucigamma1 ucigamma2
-----------------------------------------------------------------------------

. siman_setup, rep(repit) dgm(d) target(beta gamma) method(1 2) estimate(est_data) se(se_data) lci(lci) uci(uci) or
> der(target)
note: converting to long-wide format, creating variable target

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     d (2) 

Estimates are contained in the dataset

The estimates stub is:            est_data
The se stub is:                   se_data
The df stub is:                   N/A
The ci stubs are:                 lci uci
The p stub is:                    N/A
The true variable is:             N/A
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide

. siman_reshape, longlong

. 
. 
. * Format 3: Long-wide
. ***********************
. use simlongESTPM_longE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong

. siman_reshape, longwide

. siman_reshape, longlong

. use simlongESTPM_longE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. use simlongESTPM_longE_wideM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est) se(se) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_analyse, perfonly
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. 
. use simlongESTPM_longE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est_) se(se_) true(true)  

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est_
The se stub is:                   se_
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong 

. siman_analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |                     
                     | 
               empse |  .0790336   .1127159
                     |                     
                     | 
             relprec |             -50.8353
                     |                     
                     | 
                 mse |  .0062594   .0126989
                     |                     
                     | 
                rmse |  .0791165   .1126895
                     |                     
                     | 
             modelse |  .0787452   .1136343
                     |                     
                     | 
             ciwidth |  .3080681   .4434751
                     |                     
                     | 
            relerror | -.3649609   .8147949
                     |                     
                     | 
               cover |      94.7       95.7
                     |                     
                     | 
               power |       5.3        4.3
                     |                     
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |                     
                     | 
               empse |  .0805615   .1131762
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0064839   .0128278
                     |                     
                     | 
                rmse |  .0805229   .1132599
                     |                     
                     | 
             modelse |  .0788425   .1140264
                     |                     
                     | 
             ciwidth |  .3085282   .4450112
                     |                     
                     | 
            relerror | -2.133844   .7512448
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |                     
                     | 
               empse |  .0914144   .1262755
                     |                     
                     | 
             relprec |            -47.59274
                     |                     
                     | 
                 mse |  .0083703   .0159638
                     |                     
                     | 
                rmse |  .0914893   .1263479
                     |                     
                     | 
             modelse |  .0910296   .1313619
                     |                     
                     | 
             ciwidth |   .356176   .5127883
                     |                     
                     | 
            relerror |  -.420924   4.028049
                     |                     
                     | 
               cover |        95       95.6
                     |                     
                     | 
               power |         5        4.4
                     |                     
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |                     
                     | 
               empse |  .0930244   .1306846
                     |                     
                     | 
             relprec |            -49.33068
                     |                     
                     | 
                 mse |  .0086452   .0171037
                     |                     
                     | 
                rmse |  .0929798   .1307813
                     |                     
                     | 
             modelse |  .0910394   .1316664
                     |                     
                     | 
             ciwidth |  .3562577   .5138547
                     |                     
                     | 
            relerror | -2.133846    .751246
                     |                     
                     | 
               cover |      94.5       96.4
                     |                     
                     | 
               power |       5.5        3.6
                     |                     
-------------------------------------------

. 
. use simlongESTPM_longE_wideM1.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(1 2) estimate(est_) se(se_) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est_
The se stub is:                   se_
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_analyse, perfonly  
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is the performance measure and 
 the second entry is its Monte Carlo error.

. * siman_analyse, replace
. * Error message as required: There are no estimates data in the data set.  Please re-load data and use siman_setu
> p to import data.
. 
. use simlongESTPM_longE_wideM2.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(A B) estimate(est) se(se) true(true)   

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         2
The target values are:            1 2

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates stub is:            est
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             true
_____________________________________________________

. siman_reshape, longlong                                                            

. siman_analyse                                                                             
variable estimand type mismatch with other est variables
r(198);

end of do-file

r(198);

. exit, clear
