----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ian\git\siman\Ella_testing\siman_nestloop_test.log
  log type:  text
 opened on:  17 Aug 2023, 09:57:34

. siman which
C:\ian\git\siman\siman.ado
*! version 0.2     27mar2023
C:\ian\git\siman\siman_setup.ado
*!   version 0.8.0  04july2023
C:\ian\git\siman\siman_describe.ado
*! version 0.4     21jul2022  
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.3   16aug2023
C:\ian\git\siman\siman_table.ado
*! version 0.8   23dec2022     IW major rewrite: never pools over dgms, targets or methods
C:\ian\git\siman\siman_reshape.ado
*! version 0.3.1   08mar2023   nodescribe option
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.12    14aug2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.5 04july2023  EMZ
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.11 18july2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.7 11july2023
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.3 26june2023
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.4 26june2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023
C:\ian\git\siman\siman_trellis.ado
*! version 1.7.2  09may2023

. 
. use data/extendedtestdata_postfile.dta, clear

. 
. * siman setup requires beta, pmiss to be integer
. gen true = 1 if estimand=="mean0"
(72,000 missing values generated)

. replace true = 1+beta if estimand=="mean1"
(36,000 real changes made)

. replace true = beta if estimand=="effect"
(36,000 real changes made)

. 
. rename beta _beta

. gen beta=string(_beta)

. sencode beta, replace

. 
. rename pmiss _pmiss

. gen pmiss=string(_pmiss)

. sencode pmiss, replace

. 
. drop _pmiss _beta

. save extendedtestdata2, replace
(file extendedtestdata2.dta not found)
file extendedtestdata2.dta saved

. 
. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. siman analyse, notable
siman analyse has run

. siman nestloop bias, lcol(black red blue) 
Drawing 3 graphs (3 targets * 1 performance measures)...

. 
. siman nestloop relerror if estimand=="mean1", dgmorder(beta pmiss -mech) stagger(0.05) dgsize(.4) 
> dggap(.2) dgcol(green orange purple) dgpatt(dash solid =) dglabsize(medium) dglwidth(1) lcol(black
>  red blue) lwidth(1) title(My nested loop plot) name(sn1,replace) xla(none) norefline
Drawing graph...

. 
. * setup without true
. use extendedtestdata2, clear

. drop true

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) 
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman analyse, notable
siman analyse has run

. siman nestloop if estimand=="effect", lcol(black red blue) xtitle("") xlabel(none) stagger(0.03) 
Performance measures not specified and no true value: defaulting to mean empse relerror
Drawing 3 graphs (1 targets * 3 performance measures)...

. 
. * siman analyse with if
. use extendedtestdata2, clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse if mech!=2, notable
siman analyse has run

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3) 
Drawing graph...

. * graph should ignore mech
. 
. // more tests with true
. * check mean 
. use extendedtestdata2, clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3)
Drawing graph...

.  
. * only one method
. siman nestloop bias if method=="CCA" & estimand=="mean0", lcol(black red blue) xtitle("") xlabel(n
> one) name(sn2,replace)
Drawing graph...

. 
. * incomplete dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss beta) 
dgmvars missing from dgmorder(): mech

. assert _rc == 498

. * bogus dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech3 beta) 
variable mech3 not found

. assert _rc == 111

. * surplus var in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech true beta) 
Surplus vars found in dgmorder(): true

. assert _rc == 498

. * repeated in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech mech beta) 
Surplus vars found in dgmorder(): mech

. assert _rc == 498

. * abbreviated dgmorder
. siman nestloop bias if estimand=="mean0", dgmorder(pmiss be -mec) name(sn3,replace)
Drawing graph...

. 
. * only one dgm
. cap noi siman nestloop bias if pmiss==1 & beta==1 & mech==1
siman nestloop requires more than 1 dgm combination

. assert _rc == 498

. 
. * no target
. use extendedtestdata2, clear

. keep if estimand=="mean0"
(72,000 observations deleted)

. drop estimand

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
  variable mech was long now byte
  (108,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run

. siman nestloop bias, name(sn4,replace)
Drawing graph...

. 
. * numeric target
. use extendedtestdata2, clear

. encode estimand, gen(estinum)

. drop estimand

. siman setup, target(estinum) rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run

. siman nestloop bias, name(sn5,replace)
Drawing 3 graphs (3 targets * 1 performance measures)...

. siman nestloop bias if estinum==1, name(sn6,replace) nodg saving(sn6,replace)
Drawing graph...
(file sn6.gph not found)
file sn6.gph saved

. 
. * tidy up
. erase extendedtestdata2.dta

. erase sn6.gph

. 
. di as result  "*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***"
*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***

. 
. log close
      name:  <unnamed>
       log:  C:\ian\git\siman\Ella_testing\siman_nestloop_test.log
  log type:  text
 closed on:  17 Aug 2023, 09:57:50
----------------------------------------------------------------------------------------------------
