
. siman which
C:\ian\git\siman\siman.ado
*!version 0.3  08aug2023
C:\ian\git\siman\siman_setup.ado
*!    version 0.8.8  14feb2024    
C:\ian\git\siman\siman_describe.ado
*! version 0.5.1   13mar2024
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.15 14mar2024
C:\ian\git\siman\siman_table.ado
*! version 0.8.2   20dec2023
C:\ian\git\siman\siman_reshape.ado
*!  version 0.3.4   06nov2023
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.13.2  15dec2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.12 25oct2023
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.18 25oct2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.8 27mar2024
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.7 03oct2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023

. 
. local i 0

. 
. // ONE DGMVAR
. * multiple targets
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. foreach var in rep dgm estimand method est se true {
  2.         rename `var' my`var'
  3. }

. siman setup, rep(myrep) dgm(mydgm) target(myestimand) method(mymethod) ///
>         estimate(myest) se(myse) true(mytrue)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     mydgm (2) 

Estimates are contained in the dataset

The estimates variable is:        myest
The se variable is:               myse
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             mytrue
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10)  name(l`++i', replace)
Drawing 2 graphs (one per target)...

. siman lol bias relprec power cover if myesti=="gamma", refpower(10) name(l`++i', replace)
Drawing graph...

. 
. * no target
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. drop esti

. siman setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10)  name(l`++i', replace)
Drawing graph...

. 
. 
. // COMPARE METHOD AS UNLABELLED/LABELLED NUMERIC OR STRING
. 
. * method is numeric unlabelled
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. drop esti

. qui siman setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true) 

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10) name(munlabelled,replace)
Drawing graph...

. 
. * method is numeric labelled
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. drop esti

. label def method 1 "1good" 2 "2bad"

. label val method method

. qui siman setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true) 

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10) name(mlabelled,replace)
Drawing graph...

. 
. * method is string
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. gen methchar = cond(method==1,"1good","2bad")

. drop esti method

. qui siman setup, rep(rep) dgm(dgm) method(methchar) estimate(est) se(se) true(true) 

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10) name(mstring,replace)
Drawing graph...

. 
. ** NB name(string) gives funny error
. 
. * method is not 1...
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. replace method = method+1
(4,000 real changes made)

. gen methchar = cond(method==2,"1good","2bad")

. drop esti method

. qui siman setup, rep(rep) dgm(dgm) method(methchar) estimate(est) se(se) true(true) 

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10) name(mstringplus,replace)
Drawing graph...

. * graph should be same as mstring
. 
. * method orderings disagree: numeric ordering should be used
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop if esti=="gamma"
(4,000 observations deleted)

. label def method 1 "good" 2 "bad"

. label val method method

. drop esti 

. qui siman setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true) 

. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover, refpower(10) name(mstringrev,replace)
Drawing graph...

. * graph should be same as mstring
. 
. 
. // MULTIPLE DGMVARS
. use $testpath/data/extendedtestdata2.dta, clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. siman analyse, notable
siman analyse has run successfully

. siman lol bias relprec power cover if beta==3, ///
>         refpower(90) dgmwidth(35) pmwidth(20) legend(col(1)) name(l`++i', replace)
Drawing 3 graphs (one per target)...

. 
. * finish with a high quality graph
. siman lol bias relprec power cover if beta==3 & esti=="effect", ///
>         legend(row(1)) name(l`++i', replace) col(red green blue) ///
>         bygr(note(Good lollyplot for estimand effect) title(,size(medium))) 
Drawing graph...

. 
. 
. di as result  "*** SIMAN LOLLYPLOT HAS PASSED ALL ITS TESTS ***"
*** SIMAN LOLLYPLOT HAS PASSED ALL ITS TESTS ***

. 
. log close
