
. siman which
C:\ian\git\siman\siman.ado
*!version 0.3  08aug2023
C:\ian\git\siman\siman_setup.ado
*!   version 0.8.7  27nov2023
C:\ian\git\siman\siman_describe.ado
*! version 0.5   17oct2022  
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.11 19dec2023
C:\ian\git\siman\siman_table.ado
*! version 0.8.2   20dec2023
C:\ian\git\siman\siman_reshape.ado
*!  version 0.3.4   06nov2023
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.13.2  15dec2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.12 25oct2023
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.18 25oct2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.7 03oct2023
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.7 03oct2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023

. 
. use $testpath/data/extendedtestdata2.dta, clear

. 
. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. siman analyse, notable
siman analyse has run successfully

. siman nestloop bias, lcol(black red blue) 
Drawing 3 graphs (3 targets * 1 performance measures)...

. 
. siman nestloop relerror if estimand=="mean1", dgmorder(beta pmiss -mech) stagger(0.05) dgsize(.4) 
> dggap(.2) dgcol(green orange purple) dgpatt(dash solid =) dglabsize(medium) dglwidth(1) lcol(black
>  red blue) lwidth(1) title(My nested loop plot) name(sn1,replace) xla(none) norefline
Drawing graph...

. 
. * setup without true
. use $testpath/data/extendedtestdata2, clear

. drop true

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) 
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop if estimand=="effect", lcol(black red blue) xtitle("") xlabel(none) stagger(0.03) 
Performance measures not specified and no true value: defaulting to mean empse relerror
Drawing 3 graphs (1 targets * 3 performance measures)...

. 
. * siman analyse with if
. use $testpath/data/extendedtestdata2, clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse if mech!=2, notable
siman analyse has run successfully

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3) 
Drawing graph...

. * graph should ignore mech
. 
. 
. // COMPARE METHOD AS UNLABELLED/LABELLED NUMERIC OR STRING
. 
. * method is string (as in source data)
. use $testpath/data/extendedtestdata2, clear

. tab method if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b) // CCA, MeanIm
> p, Noadj

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mstring,replace)
Drawing graph...

. 
. * method is numeric labelled in alphabetical order
. use $testpath/data/extendedtestdata2, clear

. sencode method, gsort(method) replace // 1=CCA, 2=MeanImp, 3=Noadj

. tab method if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mlabalpha,replace)
Drawing graph...

. 
. * method is numeric labelled in data order
. use $testpath/data/extendedtestdata2, clear

. sencode method, replace // 1=Noadj, 2=CCA, 3=MeanImp

. tab method if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
      Noadj |  -.00349635   .19110948       1,000
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            Noadj CCA MeanImp

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(mlabdata,replace)
Drawing graph...

. 
. * method is numeric unlabelled in alphabetical order
. use $testpath/data/extendedtestdata2, clear

. sencode method, gsort(method) replace // order is alphabetical: CCA MeanImp Noadj 

. tab method if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. label val method // 1 [=Noadj], 2 [=CCA], 3 [=MeanImp]

. tab method if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b)

            |            Summary of b
     method |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .00253414   .15817009       1,000
          2 |   .00217613    .1525731       1,000
          3 |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            1 2 3

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(munlabelled,replace)
Drawing graph...

. 
. ** NB name(string) gives funny error
. 
. * method is not 1...
. use $testpath/data/extendedtestdata2, clear

. gen methchar = 11 if method == "CCA"
(72,000 missing values generated)

. replace methchar = 12 if method == "MeanImp"
(36,000 real changes made)

. replace methchar = 13 if method == "Noadj"
(36,000 real changes made)

. label def methchar 11 "CCA" 12 "MeanImp" 13 "Noadj"

. label val methchar methchar

. drop method

. tab methchar if beta==1 & pmiss==1 & mech=="MCAR" & estimand=="effect" & rep>0, su(b)

            |            Summary of b
   methchar |        Mean   Std. dev.       Freq.
------------+------------------------------------
        CCA |   .00253414   .15817009       1,000
    MeanImp |   .00217613    .1525731       1,000
      Noadj |  -.00349635   .19110948       1,000
------------+------------------------------------
      Total |   .00040464   .16811256       3,000

. siman setup, rep(rep) dgm(beta pmiss mech) method(methchar) target(estimand) est(b) se(se) true(tr
> ue)
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop empse if estimand=="effect", name(munlabplus10,replace)
Drawing graph...

. * graph should be same as mstring
. 
. 
. 
. // more tests with true
. * check mean 
. use $testpath/data/extendedtestdata2, clear

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop mean if estimand=="mean0", lcol(black red blue) xtitle("") xlabel(none) stagger(0.0
> 3)
Drawing graph...

.  
. * only one method
. siman nestloop bias if method=="CCA" & estimand=="mean0", lcol(black red blue) xtitle("") xlabel(n
> one) name(sn2,replace)
Drawing graph...

. 
. * incomplete dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss beta) 
dgmvars missing from dgmorder(): mech

. assert _rc == 498

. * bogus dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech3 beta) 
variable mech3 not found

. assert _rc == 111

. * surplus var in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech true beta) 
Surplus vars found in dgmorder(): true

. assert _rc == 498

. * repeated in dgmorder
. cap noi siman nestloop bias if estimand=="mean0", dgmorder(pmiss mech mech beta) 
Surplus vars found in dgmorder(): mech

. assert _rc == 498

. * abbreviated dgmorder
. siman nestloop bias if estimand=="mean0", dgmorder(pmiss be -mec) name(sn3,replace)
Drawing graph...

. 
. * wrong pm
. cap noi siman nestloop rhubarb 
Performance measures wrongly specified: rhubarb

. assert _rc == 498

. 
. * only one dgm
. cap noi siman nestloop bias if pmiss==1 & beta==1 & mech==1
siman nestloop requires more than 1 dgm combination

. assert _rc == 498

. 
. * no target
. use $testpath/data/extendedtestdata2, clear

. keep if estimand=="mean0"
(72,000 observations deleted)

. drop estimand

. siman setup, rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
  variable mech was long now byte
  (108,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop bias, name(sn4,replace)
Drawing graph...

. 
. * numeric target
. use $testpath/data/extendedtestdata2, clear

. encode estimand, gen(estinum)

. drop estimand

. siman setup, target(estinum) rep(rep) dgm(beta pmiss mech) method(method) est(b) se(se) true(true)
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman analyse, notable
siman analyse has run successfully

. siman nestloop bias, name(sn5,replace)
Drawing 3 graphs (3 targets * 1 performance measures)...

. siman nestloop bias if estinum==1, name(sn6,replace) nodg legend(row(1)) saving(sn6,replace)
Drawing graph...
(file sn6.gph not found)
file sn6.gph saved

. siman nestloop bias if estinum==1, nodg legend(row(1)) methlegend(item)
Drawing graph...

. siman nestloop bias if estinum==1, nodg legend(row(1)) methlegend(title)
Drawing graph...

. 
. * this is a good quality graph
. siman nestloop bias if estinum==1, legend(row(1)) ///
>         title(Good nestloop graph for estimand effect) note("") stagger(.05) xlab(none) lcol(red g
> reen blue)
Drawing graph...

. 
. * tidy up
. erase sn6.gph

. 
. di as result  "*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***"
*** SIMAN NESTLOOP HAS PASSED ALL ITS TESTS ***

. 
. log close
