
. siman which
C:\ian\git\siman\siman.ado
*!version 0.3  08aug2023
C:\ian\git\siman\siman_setup.ado
*!    version 0.8.8  14feb2024    
C:\ian\git\siman\siman_describe.ado
*! version 0.5.1   13mar2024
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.15 14mar2024
C:\ian\git\siman\siman_table.ado
*! version 0.8.2   20dec2023
C:\ian\git\siman\siman_reshape.ado
*!  version 0.3.4   06nov2023
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.13.2  15dec2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.12 25oct2023
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.18 25oct2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.8 27mar2024
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.7 03oct2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023

. 
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. * siman scatter
. siman_scatter, ytitle("test y-title") xtitle("test x-title") name("test") 
working.....

. siman_scatter, ytitle("test y-title") xtitle("test x-title")     
working.....

. siman_scatter 
working.....

. siman_scatter if dgm==2, name(siman_scatter_dgm2)
working.....

. 
. * siman_swarm
. siman_swarm
working.....

. siman_swarm, meanoff scheme(s1color) bygraphoptions(title("main-title")) graphoptions(ytitle("test
>  y-title"))
working.....

. siman_swarm, scheme(economist) bygraphoptions(title("main-title")) graphoptions(ytitle("test y-tit
> le") xtitle("test x-title"))
working.....

. siman_swarm, graphoptions(ytitle("test y-title") xtitle("test x-title") name("test2", replace))
working.....

. siman_swarm if dgm == 1   
working.....

. 
. 
. *siman_zipplot
. siman_zipplot

. siman_zipplot, by(dgm estimand method)

. 
. siman zipplot, scheme(scheme(s2color)) legend(order(3 "Carrot" 4 "Stalk")) xtit("x-title") ytit("y
> -title") ylab(0 40 100) noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) 

. siman zipplot, scheme(scheme(s2color)) legend(order(3 "Carrot" 4 "Stalk")) xtit("x-title") ytit("y
> -title") ylab(0 40 100) noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("carrot",
>  replace)

. 
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. drop true

. gen true = -0.5

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_zipplot

. 
. 
. * Check dgm labels when dgm numeric with string labels
. clear all

. prog drop _all

. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. label define dgmvar 1 "A" 2 "B"

. label values dgm dgmvar

. label define methodvar 1 "X" 2 "Y_"

. label values method methodvar

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            X Y

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman scatter                  
working.....

. siman zipplot                  

. siman swarm                   
working.....

. siman comparemethodsscatter 
Working.....

. siman blandaltman  
working....

. * check works ok
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         X         Y_
---------------------+---------------------
A                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
A                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
B                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
B                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. 
. * Different true values per target
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. replace true=0.5 if estimand=="beta"
(4,000 real changes made)

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_zipplot  
Drawing 2 graphs (1 per true value)

. siman_zipplot, scheme(scheme(economist)) legend(order(4 "Covering" 3 "Not covering")) xtit("x-titl
> e") ytit("y-title") ylab(0 40 100) ///
> noncoveroptions(pstyle(p3)) coveroptions(pstyle(p4)) scatteroptions(mcol(grey%50)) truegraphoption
> s(pstyle(p6))
Drawing 2 graphs (1 per true value)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)
(note:  named style grey not found in class color, default attributes used)

. 
. * siman scatter
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            1 2

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. siman_scatter
working.....

. siman_scatter, by(dgm)
working.....

. siman_scatter, by(estimand method)
working.....

. siman_scatter, ytitle("test y-title") xtitle("test x-title") scheme(economist) bygraphoptions(titl
> e("main-title"))
working.....

. siman_scatter, ytitle("test y-title") xtitle("test x-title") scheme(s2mono) by(dgm) bygraphoptions
> (title("main-title")) 
working.....

. 
. * siman comparemethodsscatter
. siman_comparemethodsscatter 
Working.....

. siman_comparemethodsscatter, scheme(economist) 
Working.....

. * to change title in main graph
. siman_comparemethodsscatter, title("test")
Working.....

. * to have subtitles in consituent graphs (looks messy, but just for testing)
. siman_comparemethodsscatter, subgr(xtit("test"))
Working.....

. siman_comparemethodsscatter, name("test")     
Working.....

. siman_comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("test", replace)    
Working.....

. 
. clear all

. prog drop _all

. * more than 3 methods for plots
. use $testpath/data/bvsim_all_out.dta, clear

. rename _dnum dnum

. drop simno hazard hazcens shape cens pmcar n truebeta truegamma corr mdm

. drop if _n>100
(17,900 observations deleted)

. reshape long beta_ sebeta_ gamma_ segamma_, i(dnum) j(method)
(j = 1 2 3 4 5 6 7 8 9 10)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              100   ->   1,000       
Number of variables                  41   ->   6           
j variable (10 values)                    ->   method
xij variables:
              beta_1 beta_2 ... beta_10   ->   beta_
        sebeta_1 sebeta_2 ... sebeta_10   ->   sebeta_
           gamma_1 gamma_2 ... gamma_10   ->   gamma_
     segamma_1 segamma_2 ... segamma_10   ->   segamma_
-----------------------------------------------------------------------------

. rename beta_ estbeta

. rename sebeta_ sebeta

. rename gamma_ estgamma

. rename segamma_ segamma

. reshape long est se, i(dnum method) j(target "beta" "gamma")

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations            1,000   ->   2,000       
Number of variables                   6   ->   5           
j variable (2 values)                     ->   target
xij variables:
                       estbeta estgamma   ->   est
                         sebeta segamma   ->   se
-----------------------------------------------------------------------------

. gen dgm = 1

. expand 2, gen(dupindicator)
(2,000 observations created)

. replace dgm=2 if dupindicator==1
(2,000 real changes made)

. drop dupindicator

. *drop if method>4
. siman_setup, rep(dnum) dgm(dgm) est(est) se(se) method(method) target(target)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         10
The method values are:            1 2 3 4 5 6 7 8 9 10

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             N/A
_____________________________________________________

. siman_comparemethodsscatter
Warning: with 10 methods compared, this plot may be too dense to read.  If you find it unreadable,
  you can choose the methods to compare using -siman comparemethodsscatter, methlist(a b)- where a
  and b are the methods you are particularly interested to compare.
Working.....
--Break--
r(1);

end of do-file
--Break--
r(1);

end of do-file

--Break--
r(1);

. do new_tests.do

. /* 
> new_tests.do
> new tests 14feb2024
> */
. 
. 
. local filename new_tests

. 
. prog drop _all

. cd $testpath
C:\ian\git\siman\Ella_testing

. cap log close
