
. siman which
C:\ian\git\siman\siman.ado
*!version 0.3  08aug2023
C:\ian\git\siman\siman_setup.ado
*!   version 0.8.7  27nov2023
C:\ian\git\siman\siman_describe.ado
*! version 0.5   17oct2022  
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.11 19dec2023
C:\ian\git\siman\siman_table.ado
*! version 0.8.2   20dec2023
C:\ian\git\siman\siman_reshape.ado
*!  version 0.3.4   06nov2023
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.13.2  15dec2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.12 25oct2023
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.18 25oct2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.7 03oct2023
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.7 03oct2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023

. 
.  
. * dgm defined by 1 variable
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. encode estimand, gen(estimand_num)

. drop estimand

. rename estimand_num estimand

. label define methodl 1 "A" 2 "B"

. label values method methodl

. gen dgm_str = ""
(8,000 missing values generated)

. replace dgm_str = "1" if dgm == 1
(4,000 real changes made)

. replace dgm_str = "2" if dgm == 2
(4,000 real changes made)

. drop dgm true

. rename dgm_str dgm

. 
. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(0)
  variable dgm was long now byte
  (24,000 bytes saved)
Warning: variable dgm, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode dgm
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             _true
_____________________________________________________

. 
. 
. siman scatter
working.....

. if ${detail} == 1 siman scatter est se, name(est_onyaxis)
working.....

. if ${detail} == 1 siman scatter se est, name(se_onyaxis)
working.....

. * 1 panel per dgm, method and target combination
. 
. if ${detail} == 1 siman scatter, by(dgm)
working.....

. * by dgm only
. if ${detail} == 1 siman scatter if dgm == 1, by(method)
working.....

. * by method only
. if ${detail} == 1 siman scatter, by(estimand)
working.....

. * by estimand only
. 
. siman swarm
working.....

. * 1 panel per dgm and target combination, method on y-axis
. if ${detail} == 1 siman swarm if estimand == 1
working.....

. if ${detail} == 1 siman swarm if estimand == 2
working.....

. 
. siman comparemethodsscatter 
Working.....

. * 1 graph per dgm and target, comparing methods
. if ${detail} == 1 siman comparemethodsscatter if estimand == 1
Working.....

. * metlist option too
. 
. siman blandaltman 
working....

. * 1 graph per dgm and target combination, comparison of methods
. if ${detail} == 1 siman blandaltman if dgm ==1
working....

. if ${detail} == 1 siman blandaltman if estimand == 2
working....

. 
. siman zipplot
Drawing 1 graphs (1 per true value)...

. * 1 panel per dgm, method and target combination
. if ${detail} == 1 siman zipplot, by(estimand) 
Drawing 1 graphs (1 per true value)...

. if ${detail} == 1 siman zipplot, by(method) 
Drawing 1 graphs (1 per true value)...

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         A          B
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot
Performance measures not specified: defaulting to bias empse cover
Drawing 2 graphs (one per target)...

. 
. serset clear

. siman nestloop
Performance measures not specified: defaulting to bias empse cover
Drawing 6 graphs (2 targets * 3 performance measures)...

. 
. 
. * dgm defined by >1 variable
. use $testpath/data/extendedtestdata.dta, clear

. 
. * create true values, corrected 25oct2023
. gen betatrue = beta if estimand == "effect"
(72,000 missing values generated)

. replace betatrue = 1 if estimand == "mean0"
(36,000 real changes made)

. replace betatrue = 1 + beta if estimand == "mean1"
(36,000 real changes made)

. 
. * remove non-integer values
. foreach var in beta pmiss {
  2.         gen `var'char = strofreal(`var')
  3.         drop `var'
  4.         sencode `var'char, gen(`var')
  5.         drop `var'char
  6. }

. order beta pmiss

. 
. * create a string dgm var as well for testing
. gen betastring = "0"

. replace betastring = "0.25" if beta == 2
variable betastring was str1 now str4
(36,000 real changes made)

. replace betastring = "0.5" if beta == 3
(36,000 real changes made)

. drop beta

. rename betastring beta

. 
. siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(beta
> true)
  variable beta was long now byte
  (324,000 bytes saved)
Warning: variable beta, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode beta
  as numeric before running -siman setup-.

  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             betatrue
_____________________________________________________

. 
. siman scatter
working.....
Warning: 108 panels will be created: consider using 'if' condition or 'by' option as detailed in
  siman scatter

. * 1 panel per dgm, target and method 
. if ${detail} == 1 siman scatter if method == "CCA"
working.....
Warning: 36 panels will be created: consider using 'if' condition or 'by' option as detailed in
  siman scatter

. 
. siman swarm
working.....
Warning: 36 panels will be created: consider using 'if' or 'by' options as detailed in siman swarm

. * 1 panel per dgm level(s) and target, method on y-axis
. * for the first panel in the all-graph display (beta level 1, pmiss level 1, mech level 1, estiman
> d == "effect"), the means per
. * method have a very small difference, visible as follows:
. if ${detail} == 1 siman swarm if beta == 1 & pmiss == 1 & mech == 1 & estimand == "effect"
working.....

. * FYI:
. * mean method CCA: 0.0025341
. * mean method meanlmp: 0.0021761
. * mean noadj: -0.0034964
. 
. serset clear

. siman comparemethodsscatter 
Working.....
Warning: 36 graphs will be created: consider using 'if' condition as detailed in siman
  comparemethodsscatter

. * one graph per dgm and target combination, comparing methods
. 
. siman blandaltman 
working....
Warning: 36 graphs will be created: consider using 'if' condition as detailed in siman blandaltman

. * 1 graph per combination of dgm levels and target, by method difference
. 
. siman zipplot
Warning: 6 graphs each of 18 panels will be created: consider using 'if' condition or 'by' option as
  detailed in siman zipplot Drawing 6 graphs (1 per true value)...

(note:  named style pcspike not found in class yxtype, default attributes used) {p_end} {p 0 8}
    (note:  yxtype not found in scheme, default attributes used){p_end} --Break-- r(1); end of
    do-file --Break-- r(1);

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD3738_000000.tmp"

. use $testpath/data/extendedtestdata2, clear

. 
. siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(beta
> true)
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.  true must be a numeric variable/value in siman.  r(498);

end of do-file

r(498);

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD3738_000000.tmp"

. use $testpath/data/extendedtestdata2, clear

. 
end of do-file

.  slotab beta true
slotab is not a valid command name
r(199);

.  tab beta true

           |                               true
      beta |         0        .25         .5          1       1.25        1.5 |     Total
-----------+------------------------------------------------------------------+----------
         0 |    12,000          0          0     24,000          0          0 |    36,000 
       .25 |         0     12,000          0     12,000     12,000          0 |    36,000 
        .5 |         0          0     12,000     12,000          0     12,000 |    36,000 
-----------+------------------------------------------------------------------+----------
     Total |    12,000     12,000     12,000     48,000     12,000     12,000 |   108,000 

.  table estim  beta true

----------------------------------------------------------------------------
            |                               true                            
            |       0      .25       .5        1     1.25      1.5     Total
------------+---------------------------------------------------------------
estimand    |                                                               
  effect    |                                                               
    beta    |                                                               
      0     |  12,000                                                 12,000
      .25   |           12,000                                        12,000
      .5    |                    12,000                               12,000
      Total |  12,000   12,000   12,000                               36,000
  mean0     |                                                               
    beta    |                                                               
      0     |                             12,000                      12,000
      .25   |                             12,000                      12,000
      .5    |                             12,000                      12,000
      Total |                             36,000                      36,000
  mean1     |                                                               
    beta    |                                                               
      0     |                             12,000                      12,000
      .25   |                                      12,000             12,000
      .5    |                                               12,000    12,000
      Total |                             12,000   12,000   12,000    36,000
  Total     |                                                               
    beta    |                                                               
      0     |  12,000                     24,000                      36,000
      .25   |           12,000            12,000   12,000             36,000
      .5    |                    12,000   12,000            12,000    36,000
      Total |  12,000   12,000   12,000   48,000   12,000   12,000   108,000
----------------------------------------------------------------------------

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD3738_000000.tmp"

. use $testpath/data/extendedtestdata2, clear

. 
. siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(true
> )
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. 
. siman zipplot
Warning: 6 graphs each of 18 panels will be created: consider using 'if' condition or 'by' option as
  detailed in siman zipplot Drawing 6 graphs (1 per true value)...

. * 1 panel per dgm, target and method combination, 1 graph per beta (as defines y-axis)
. 
end of do-file

. count if beta == 1 & pmiss == 1 & mech == 2
  9,000

. count if beta == 1 & pmiss == 1 & mech == 3
  0

. tab mech, nol

       mech |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     54,000       50.00       50.00
          2 |     54,000       50.00      100.00
------------+-----------------------------------
      Total |    108,000      100.00

. count if beta == 1 & pmiss == 2 & mech == 2
  9,000

. exit, clear
