{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\git\siman\Ella_testing\Testing_IRW_TPM_EMZ.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Nov 2023, 12:14:31
{txt}
{com}. siman which
{txt}C:\git\siman\siman.ado
{res}*!version 0.3  08aug2023
{txt}C:\git\siman\siman_setup.ado
{res}*!   version 0.8.5  13nov2023
{txt}C:\git\siman\siman_describe.ado
{res}*! version 0.5   17oct2022  
{txt}C:\git\siman\siman_analyse.ado
{res}*! version 0.6.10 13nov2023
{txt}C:\git\siman\siman_table.ado
{res}*! version 0.8.1   25oct2023
{txt}C:\git\siman\siman_reshape.ado
{res}*!  version 0.3.4   06nov2023
{txt}C:\git\siman\siman_lollyplot.ado
{res}*! version 1.13.1  25oct2023
{txt}C:\git\siman\siman_zipplot.ado
{res}*! version 1.8.12 25oct2023
{txt}C:\git\siman\siman_comparemethodsscatter.ado
{res}*! version 1.9.18 25oct2023
{txt}C:\git\siman\siman_blandaltman.ado
{res}*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
{txt}C:\git\siman\siman_swarm.ado
{res}*! version 1.9.7 03oct2023
{txt}C:\git\siman\siman_scatter.ado
{res}*! version 1.6.7 03oct2023
{txt}C:\git\siman\siman_nestloop.ado
{res}*! version 1.8.2   17aug2023
{txt}
{com}. 
.  
. * dgm defined by 1 variable
. use data/simlongESTPM_longE_longM.dta, clear
{txt}
{com}. encode estimand, gen(estimand_num)
{txt}
{com}. drop estimand
{txt}
{com}. rename estimand_num estimand
{res}{txt}
{com}. label define methodl 1 "A" 2 "B"
{txt}
{com}. label values method methodl
{txt}
{com}. gen dgm_str = ""
{txt}(8,000 missing values generated)

{com}. replace dgm_str = "1" if dgm == 1
{txt}(4,000 real changes made)

{com}. replace dgm_str = "2" if dgm == 2
{txt}(4,000 real changes made)

{com}. drop dgm true
{txt}
{com}. rename dgm_str dgm
{res}{txt}
{com}. 
. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(0)
{res}  {txt}variable {bf}dgm{sf} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
{txt}  (24,000 bytes saved)
{err}Warning: variable dgm, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode dgm as numeric before running -siman setup-.

{txt}{col 20}SUMMARY OF DATA
_____________________________________________________

The siman format is:{res}{col 35}format 1: long-long
{txt}The format for targets is:{res}{col 35}long
{txt}The format for methods is:{res}{col 35}long
{txt}The number of targets is:{res}{col 35}2
{txt}The target values are:{res}{col 35}beta gamma

{txt}The number of methods is:{res}{col 35}2
{txt}The method values are:{res}{col 35}A B

Data generating mechanism (dgm)
{txt}The total number of dgms is: {res}{col 35}2
{txt}The dgm variables (# levels): {res}{col 35}dgm (2) 

Estimates are contained in the dataset

{txt}The estimates variable is:{res}{col 35}est
{txt}The se variable is:{res}{col 35}se
{txt}The df variable is:{res}{col 35}N/A
{txt}The ci variables are:{res}{col 35}N/A
{txt}The p variable is:{res}{col 35}N/A
{txt}The true variable is:{res}{col 35}_true
{txt}_____________________________________________________

{com}. 
. 
. siman scatter
{txt}working.....
{res}{txt}
{com}. if ${c -(}detail{c )-} == 1 siman scatter est se, name(est_onyaxis)
{txt}working.....
{res}{txt}
{com}. if ${c -(}detail{c )-} == 1 siman scatter se est, name(se_onyaxis)
{txt}working.....
{res}{txt}
{com}. * 1 panel per dgm, method and target combination
. 
. if ${c -(}detail{c )-} == 1 siman scatter, by(dgm)
{txt}working.....
{res}{txt}
{com}. * by dgm only
. if ${c -(}detail{c )-} == 1 siman scatter if dgm == 1, by(method)
{txt}working.....
{res}{txt}
{com}. * by method only
. if ${c -(}detail{c )-} == 1 siman scatter, by(estimand)
{txt}working.....
{res}{txt}
{com}. * by estimand only
. 
. siman swarm
{txt}working.....

{com}. * 1 panel per dgm and target combination, method on y-axis
. if ${c -(}detail{c )-} == 1 siman swarm if estimand == 1
{txt}working.....

{com}. if ${c -(}detail{c )-} == 1 siman swarm if estimand == 2
{txt}working.....

{com}. 
. siman comparemethodsscatter 
{txt}Working.....
{res}{txt}
{com}. * 1 graph per dgm and target, comparing methods
. if ${c -(}detail{c )-} == 1 siman comparemethodsscatter if estimand == 1
{txt}Working.....
{res}{txt}
{com}. * metlist option too
. 
. siman blandaltman 
{txt}working....
{res}{txt}
{com}. * 1 graph per dgm and target combination, comparison of methods
. if ${c -(}detail{c )-} == 1 siman blandaltman if dgm ==1
{txt}working....
{res}{txt}
{com}. if ${c -(}detail{c )-} == 1 siman blandaltman if estimand == 2
{txt}working....
{res}{txt}
{com}. 
. siman zipplot
{txt}Drawing 1 graphs (1 per true value)...
{res}{txt}
{com}. * 1 panel per dgm, method and target combination
. if ${c -(}detail{c )-} == 1 siman zipplot, by(estimand) 
{txt}Drawing 1 graphs (1 per true value)...
{res}{txt}
{com}. if ${c -(}detail{c )-} == 1 siman zipplot, by(method) 
{txt}Drawing 1 graphs (1 per true value)...
{res}{txt}
{com}. 
. siman analyse
{txt}siman analyse has run successfully

{hline 21}{c TT}{hline 21}
dgm, estimand and    {c |}        method       
performance measure  {c |}         A          B
{hline 21}{c +}{hline 21}
1                    {c |}
beta                 {c |}
               bsims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
                bias {c |} {res}-.0043991  -.0025973
                     {txt}{c |}  {res}.0024993   .0035644
                     {txt}{c |} 
                mean {c |} {res}-.0043991  -.0025973
                     {txt}{c |}  {res}.0024993   .0035644
                     {txt}{c |} 
               empse {c |}  {res}.0790336   .1127159
                     {txt}{c |}  {res}.0017681   .0025217
                     {txt}{c |} 
             relprec {c |}          {res}   -50.8353
                     {txt}{c |}          {res}    2.28676
                     {txt}{c |} 
                 mse {c |}  {res}.0062594   .0126989
                     {txt}{c |}  {res}.0002881   .0006187
                     {txt}{c |} 
                rmse {c |}  {res}.0791165   .1126895
                     {txt}{c |}  {res}.0018209   .0027454
                     {txt}{c |} 
             modelse {c |}  {res}.0787452   .1136343
                     {txt}{c |}  {res}.0001572   .0003405
                     {txt}{c |} 
             ciwidth {c |}  {res}.3080681   .4434751
                     {txt}{c |}  {res}.0006123   .0013217
                     {txt}{c |} 
            relerror {c |} {res}-.3649609   .8147949
                     {txt}{c |}  {res}2.237882   2.275551
                     {txt}{c |} 
               cover {c |}      {res}94.7       95.7
                     {txt}{c |}  {res}.7084563   .6414907
                     {txt}{c |} 
               power {c |}       {res}5.3        4.3
                     {txt}{c |}  {res}.7084561   .6414905
{txt}{hline 21}{c +}{hline 21}
1                    {c |}
gamma                {c |}
               bsims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
                bias {c |}  {res}.0005151   .0056354
                     {txt}{c |}  {res}.0025476   .0035789
                     {txt}{c |} 
                mean {c |}  {res}.0005151   .0056354
                     {txt}{c |}  {res}.0025476   .0035789
                     {txt}{c |} 
               empse {c |}  {res}.0805615   .1131762
                     {txt}{c |}  {res}.0018023    .002532
                     {txt}{c |} 
             relprec {c |}          {res}  -49.33068
                     {txt}{c |}          {res}   2.314097
                     {txt}{c |} 
                 mse {c |}  {res}.0064839   .0128278
                     {txt}{c |}  {res}.0002847   .0005329
                     {txt}{c |} 
                rmse {c |}  {res}.0805229   .1132599
                     {txt}{c |}  {res}.0017676   .0023524
                     {txt}{c |} 
             modelse {c |}  {res}.0788425   .1140264
                     {txt}{c |}  {res}.0001466   .0003426
                     {txt}{c |} 
             ciwidth {c |}  {res}.3085282   .4450112
                     {txt}{c |}  {res}.0005716   .0013243
                     {txt}{c |} 
            relerror {c |} {res}-2.133844   .7512448
                     {txt}{c |}  {res}2.196998   2.274225
                     {txt}{c |} 
               cover {c |}      {res}94.5       96.4
                     {txt}{c |}  {res}.7209369   .5891009
                     {txt}{c |} 
               power {c |}       {res}5.5        3.6
                     {txt}{c |}  {res}.7209369    .589101
{txt}{hline 21}{c +}{hline 21}
2                    {c |}
beta                 {c |}
               bsims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
                bias {c |} {res}-.0046965  -.0058509
                     {txt}{c |}  {res}.0028908   .0039932
                     {txt}{c |} 
                mean {c |} {res}-.0046965  -.0058509
                     {txt}{c |}  {res}.0028908   .0039932
                     {txt}{c |} 
               empse {c |}  {res}.0914144   .1262755
                     {txt}{c |}  {res}.0020451    .002825
                     {txt}{c |} 
             relprec {c |}          {res}  -47.59274
                     {txt}{c |}          {res}   2.430245
                     {txt}{c |} 
                 mse {c |}  {res}.0083703   .0159638
                     {txt}{c |}  {res}.0003797   .0007445
                     {txt}{c |} 
                rmse {c |}  {res}.0914893   .1263479
                     {txt}{c |}  {res}.0020748   .0029462
                     {txt}{c |} 
             modelse {c |}  {res}.0910296   .1313619
                     {txt}{c |}  {res}.0001752   .0003826
                     {txt}{c |} 
             ciwidth {c |}   {res}.356176   .5127883
                     {txt}{c |}   {res}.000683   .0014841
                     {txt}{c |} 
            relerror {c |}  {res}-.420924   4.028049
                     {txt}{c |}  {res}2.236001   2.346937
                     {txt}{c |} 
               cover {c |}        {res}95       95.6
                     {txt}{c |}  {res}.6892024   .6485677
                     {txt}{c |} 
               power {c |}         {res}5        4.4
                     {txt}{c |}  {res}.6892024   .6485677
{txt}{hline 21}{c +}{hline 21}
2                    {c |}
gamma                {c |}
               bsims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000
                     {txt}{c |}          {res}           
                     {txt}{c |} 
                bias {c |}  {res}.0005948   .0065072
                     {txt}{c |}  {res}.0029417   .0041326
                     {txt}{c |} 
                mean {c |}  {res}.0005948   .0065072
                     {txt}{c |}  {res}.0029417   .0041326
                     {txt}{c |} 
               empse {c |}  {res}.0930244   .1306846
                     {txt}{c |}  {res}.0020811   .0029237
                     {txt}{c |} 
             relprec {c |}          {res}  -49.33068
                     {txt}{c |}          {res}   2.314097
                     {txt}{c |} 
                 mse {c |}  {res}.0086452   .0171037
                     {txt}{c |}  {res}.0003795   .0007105
                     {txt}{c |} 
                rmse {c |}  {res}.0929798   .1307813
                     {txt}{c |}   {res}.002041   .0027163
                     {txt}{c |} 
             modelse {c |}  {res}.0910394   .1316664
                     {txt}{c |}  {res}.0001693   .0003955
                     {txt}{c |} 
             ciwidth {c |}  {res}.3562577   .5138547
                     {txt}{c |}  {res}.0006601   .0015292
                     {txt}{c |} 
            relerror {c |} {res}-2.133846    .751246
                     {txt}{c |}  {res}2.196998   2.274225
                     {txt}{c |} 
               cover {c |}      {res}94.5       96.4
                     {txt}{c |}  {res}.7209369   .5891009
                     {txt}{c |} 
               power {c |}       {res}5.5        3.6
                     {txt}{c |}  {res}.7209369    .589101
{txt}{hline 21}{c BT}{hline 21}
{it: NOTE: Where there are 2 entries in the table, }
{it: the first entry is the performance measure and }
{it: the second entry is its Monte Carlo error.}

{com}. 
. siman lollyplot
{txt}Performance measures not specified: defaulting to bias empse cover
Drawing 2 graphs (one per target)...
{res}{txt}
{com}. 
. siman nestloop
{txt}Performance measures not specified: defaulting to bias empse cover
{res}{txt}Drawing 6 graphs (2 targets * 3 performance measures)...
{res}{txt}
{com}. 
. 
. * dgm defined by >1 variable
. use data/extendedtestdata_postfile.dta, clear
{txt}
{com}. 
. * create true values, corrected 25oct2023
. gen betatrue = beta if estimand == "effect"
{txt}(72,000 missing values generated)

{com}. replace betatrue = 1 if estimand == "mean0"
{txt}(36,000 real changes made)

{com}. replace betatrue = 1 + beta if estimand == "mean1"
{txt}(36,000 real changes made)

{com}. 
. * remove non-integer values
. foreach var in beta pmiss {c -(}
{txt}  2{com}.         gen `var'char = strofreal(`var')
{txt}  3{com}.         drop `var'
{txt}  4{com}.         sencode `var'char, gen(`var')
{txt}  5{com}.         drop `var'char
{txt}  6{com}. {c )-}
{res}{txt}
{com}. order beta pmiss
{txt}
{com}. 
. * create a string dgm var as well for testing
. gen betastring = "0"
{txt}
{com}. replace betastring = "0.25" if beta == 2
{txt}variable {bf}betastring{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str4{sf}
{txt}(36,000 real changes made)

{com}. replace betastring = "0.5" if beta == 3
{txt}(36,000 real changes made)

{com}. drop beta
{txt}
{com}. rename betastring beta
{res}{txt}
{com}. 
. siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(betatrue)
{res}  {txt}variable {bf}beta{sf} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
{txt}  (324,000 bytes saved)
{err}Warning: variable beta, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode beta as numeric before running -siman setup-.
{res}  {txt}variable {bf}mech{sf} was {bf}{res}long{sf}{txt} now {bf}{res}byte{sf}
{txt}  (324,000 bytes saved)
{err}Warning: variable mech, which appears in dgm(), was stored as a string. It has been
encoded as numeric so that subsequent siman commands will work. If you require a
different order, encode mech as numeric before running -siman setup-.

{txt}{col 20}SUMMARY OF DATA
_____________________________________________________

The siman format is:{res}{col 35}format 1: long-long
{txt}The format for targets is:{res}{col 35}long
{txt}The format for methods is:{res}{col 35}long
{txt}The number of targets is:{res}{col 35}3
{txt}The target values are:{res}{col 35}effect mean0 mean1

{txt}The number of methods is:{res}{col 35}3
{txt}The method values are:{res}{col 35}CCA MeanImp Noadj

Data generating mechanism (dgm)
{txt}The total number of dgms is: {res}{col 35}12
{txt}The dgm variables (# levels): {res}{col 35}beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

{txt}The estimates variable is:{res}{col 35}b
{txt}The se variable is:{res}{col 35}se
{txt}The df variable is:{res}{col 35}N/A
{txt}The ci variables are:{res}{col 35}N/A
{txt}The p variable is:{res}{col 35}N/A
{txt}The true variable is:{res}{col 35}betatrue
{txt}_____________________________________________________

{com}. 
. siman scatter
{txt}working.....
{err}{it: WARNING: 108 panels will be created, consider using 'if' or 'by' options as detailed in {help siman_scatter:siman scatter}}
{res}{txt}
{com}. * 1 panel per dgm, target and method 
. if ${c -(}detail{c )-} == 1 siman scatter if method == "CCA"
{txt}working.....
{err}{it: WARNING: 36 panels will be created, consider using 'if' or 'by' options as detailed in {help siman_scatter:siman scatter}}
{res}{txt}
{com}. 
. siman swarm
{res}{txt}working.....
{err}{it: WARNING: 36 panels will be created, consider using 'if' or 'by' options as detailed in {help siman_swarm:siman swarm}}
{txt}
{com}. * 1 panel per dgm level(s) and target, method on y-axis
. * for the first panel in the all-graph display (beta level 1, pmiss level 1, mech level 1, estimand == "effect"), the means per
. * method have a very small difference, visible as follows:
. if ${c -(}detail{c )-} == 1 siman swarm if beta == 1 & pmiss == 1 & mech == 1 & estimand == "effect"
{res}{txt}working.....

{com}. * FYI:
. * mean method CCA: 0.0025341
. * mean method meanlmp: 0.0021761
. * mean noadj: -0.0034964
. 
. siman comparemethodsscatter 
{txt}Working.....
{err}{it: WARNING: 36 graphs will be created, consider using 'if' option as detailed in {help              siman_comparemethodsscatter:siman comparemethodsscatter}}
{res}{txt}
{com}. * one graph per dgm and target combination, comparing methods
. 
. siman blandaltman 
{txt}working....
{err}{it: WARNING: 36 graphs will be created, consider using 'if' option as detailed in {help siman_blandaltman:siman blandaltman}}
{res}{txt}
{com}. * 1 graph per combination of dgm levels and target, by method difference
. 
. siman zipplot
{err}{it: WARNING: 6 graphs each of 18 panels will be created, consider using 'if' or 'by' options as detailed in {help siman_zipplot:siman zipplot}}
{txt}Drawing 6 graphs (1 per true value)...
{res}{txt}
{com}. * 1 panel per dgm, target and method combination, 1 graph per beta (as defines y-axis)
. 
. * different spelling
. siman analyze
{txt}siman analyse has run successfully

{hline 21}{c TT}{hline 32}
beta, pmiss, mech,   {c |}
estimand and         {c |}             method             
performance measure  {c |}       CCA    MeanImp      Noadj
{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0025341   .0021761  -.0034964
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.0025341   .0021761  -.0034964
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1581701   .1525731   .1911095
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   7.471377    -31.501
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0249992     .02326   .0364985
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1581113   .1525123   .1910459
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1590372   .1556693   .2002325
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6222619   .6093404   .7839791
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.5482441   2.029298   4.773726
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.6       96.4         96
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}4.4        3.6          4
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0043802  -.0038922  -.0010559
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9956198   .9961078   .9989441
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1086476    .126472   .1401377
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -26.20087  -39.89225
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0118117   .0159943     .01962
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1086816   .1264687   .1400715
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1124467   .1099436   .1415858
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4399201   .4303562   .5543569
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}3.496694  -13.06887   1.033348
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}96       91.9       95.2
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0018461   -.001716  -.0045523
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9981539    .998284   .9954478
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1151113    .128521   .1396295
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -19.77907   -32.0356
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0132408   .0165041   .0194976
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1150685   .1284681   .1396338
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1124886   .1099436   .1415858
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4400418   .4303562   .5543569
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-2.278399  -14.45476   1.401075
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.1       90.4       94.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0051652   .0069042   .0063999
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.0051652   .0069042   .0063999
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1592432   .1570932   .1965152
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   2.755958  -34.33562
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0253597   .0247013   .0386206
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1592474   .1571664   .1965211
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1586639   .1575551   .1997631
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6208577   .6166729   .7820668
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.3638003   .2940331   1.652786
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.3       95.8       95.5
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}4.7        4.2        4.5
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0002823  -.0030683  -.0028161
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.000282   .9969317   .9971839
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}   {res}.111489   .1264684   .1382961
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -22.28588  -35.01042
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0124174   .0159877   .0191146
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1114336   .1264424   .1382557
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1133514   .1112796   .1412539
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4434629   .4355492   .5530047
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}1.670485  -12.00996   2.138705
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.4       91.2       95.4
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.2                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0054474   .0038359   .0035837
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.005447   1.003836   1.003584
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1138948    .131519    .145381
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -25.00526  -38.62488
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0129887   .0172947   .0211274
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1139681   .1315092   .1453525
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}   {res}.113427   .1112796   .1412539
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4437514   .4355492   .5530047
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.4107688  -15.38898  -2.838857
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.6       90.8       94.4
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0040346  -.0106284  -.0075639
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |} {res}-.0040346  -.0106284  -.0075639
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1850048   .1726695   .2028226
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   14.79805  -16.79807
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0342088   .0298979   .0411531
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1849563   .1729101   .2028622
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1843259   .1682872   .2005376
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7207052   .6587221   .7851013
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.3669457  -2.537951   -1.12658
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.4       94.1       94.4
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}5.6        5.9        5.6
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}   {res}.000462   .0008812   -.000651
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.000462   1.000881    .999349
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1305456   .1339693   .1447049
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -5.045934  -18.61251
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0170253   .0179306    .020919
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1304811   .1339052    .144634
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1305939   .1188526   .1418015
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}   {res}.510349   .4652237   .5551504
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.0370401  -11.28368   -2.00644
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.7       91.9       94.3
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0035725  -.0097472  -.0082149
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9964275   .9902528    .991785
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1287902   .1326448   .1423518
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -5.727448  -18.14595
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0165831   .0176721   .0203112
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1287754   .1329363   .1425175
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1300832   .1188526   .1418015
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5084248   .4652237   .5551504
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}1.003914  -10.39784   -.386567
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.9         92       94.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}   {res}-.00534   .0017957   .0038512
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}   {res}-.00534   .0017957   .0038512
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1863973   .1830487   .2009145
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   3.692184  -13.92896
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0347377   .0334766   .0403411
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1863806    .182966   .2008509
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1830743   .1775443   .1997327
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7158127     .69494    .781976
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.782753  -3.007068  -.5881864
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.2       93.9       95.1
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}5.8        6.1        4.9
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0009617  -.0026523  -.0036801
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9990383   .9973477   .9963199
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1430802   .1323479   .1383723
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   16.87576   6.920382
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0204524   .0175055   .0191413
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1430118   .1323083   .1383521
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1421672   .1253868   .1412324
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5552768   .4907883   .5529405
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.6380477  -5.259725   2.066927
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.6       93.3       95.5
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0                    {c |}
.4                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0063016  -.0008566   .0001711
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9936984   .9991434   1.000171
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1438119   .1372165   .1436222
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   9.844188   .2643282
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0207009   .0188103   .0206067
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1438781   .1371505   .1435505
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1422711   .1253868   .1412324
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5555292   .4907883   .5529405
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.071406  -8.621186  -1.663993
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}93.7       93.2         95
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0027473   .0005009  -.0015566
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.2527473   .2505009   .2484434
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1601859    .155873   .2003881
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   5.610406   -36.0994
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0256414   .0242724   .0401176
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1601294   .1557959   .2002939
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}   {res}.158477   .1553216   .1998129
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6202054     .60798   .7822268
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}-1.06681  -.3537511   -.287028
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.6       95.1       94.3
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}35.6       34.9       23.5
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0046613  -.0053978   -.004369
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9953387   .9946022    .995631
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1153123   .1310613   .1432165
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -22.58915  -35.17168
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0133054    .017189   .0205096
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1153488    .131107   .1432116
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1120492   .1096937   .1412891
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4384659   .4293774   .5531179
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-2.829776  -16.30358   -1.34585
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}93.7       90.7       94.5
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}-.001914  -.0048969  -.0059256
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.248086   1.245103   1.244074
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1099988   .1262728   .1433192
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -24.11494  -41.09301
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0120913   .0159528    .020555
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1099604   .1263046   .1433701
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1120856   .1096937   .1412891
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4385509   .4293774   .5531179
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}1.897122   -13.1296  -1.416533
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.7       91.2       93.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0021697  -.0030478  -.0032598
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.2521697   .2469522   .2467402
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1598057    .156393   .2101283
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   4.411891  -42.16171
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}   {res}.025517   .0244436   .0441204
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1597405   .1563445   .2100485
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1595675   .1578927   .2002832
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6243665   .6180017   .7840847
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}-.149025   .9589576  -4.685263
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.2       95.5       94.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}33.8       33.9       24.6
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0049183  -.0060418  -.0059357
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9950817   .9939582   .9940643
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1161831   .1277313   .1466545
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -17.26461  -37.23823
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0135092   .0163355   .0215213
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1162291   .1278103   .1467013
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1140788   .1115027   .1416216
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4462741   .4364309   .5544316
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.811223  -12.70522  -3.431776
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.2       91.2       94.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.2                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0027486  -.0090895  -.0091956
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.247251    1.24091   1.240804
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1099882   .1218443   .1396472
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -18.51431  -37.96635
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0120929   .0149138   .0195664
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1099675   .1221221     .13988
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1139007   .1115027   .1416216
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4456148   .4364309   .5544316
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}3.557214  -8.487556    1.41383
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}95       91.8       94.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0034342   .0005849   .0049402
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.2465658   .2505849   .2549402
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1904123   .1655862   .1995432
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   32.23362  -8.942381
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0362324   .0273917   .0398021
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1903481   .1655044   .1995046
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1835962    .167694    .199773
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7178638   .6563814   .7821474
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}-3.57967   1.272905    .115136
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}93.7       94.8         95
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}28.1       31.9       26.2
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}   {res}.004279   .0017235  -.0004541
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.004279   1.001724   .9995459
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}   {res}.130518   .1287758    .138501
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   2.724042  -11.19553
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0170362   .0165696   .0191636
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1305229    .128723   .1384325
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1298397   .1184202   .1412608
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}   {res}.507485   .4635191   .5530617
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.5197104  -8.041621   1.992588
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.7         92       95.8
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0008448   .0023084    .004486
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.250845   1.252308   1.254486
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1295717   .1325389   .1454874
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -4.427241  -20.68234
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0167728   .0175543   .0211655
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1295097   .1324927   .1454838
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1297947   .1184202   .1412608
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5072898   .4635191   .5530617
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.1721137  -10.65248  -2.905118
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.4       91.5         94
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}   {res}.003941  -.0028574   -.005644
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}   {res}.253941   .2471426    .244356
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}   {res}.186894   .1845794   .2068275
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   2.523628  -18.34663
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}    {res}.03491   .0340437   .0427667
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1868421   .1845092   .2068011
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1842587   .1780058   .2000978
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7205022   .6967896    .783397
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.410059  -3.561427  -3.253749
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.5         94       93.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}        {res}30       30.3       23.9
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0064733  -.0015826  -.0001893
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9935267   .9984174   .9998108
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1426215   .1344713   .1423413
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   12.48923   .3940071
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0203624   .0180669   .0202408
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1426971   .1344133   .1422703
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1430059   .1257121   .1414905
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5585811   .4920928   .5539454
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.2695387  -6.513753  -.5977263
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.2       92.8       94.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.25                 {c |}
.4                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0025324    -.00444  -.0058333
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.247468    1.24556   1.244167
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1473898   .1332222   .1411511
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   22.40011   9.035122
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0217084   .0177501   .0199377
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1473378   .1332295    .141201
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1433395   .1257121   .1414905
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}   {res}.559858   .4920928   .5539454
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-2.748019  -5.637216   .2404965
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}93       93.6       95.3
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}-.003586  -.0019055  -.0040095
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}   {res}.496414   .4980945   .4959905
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1567689   .1521224   .2069165
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   6.202289  -42.59763
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0245648   .0231217   .0427877
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1567316   .1520582   .2068519
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1589754   .1557034   .1997051
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6220698   .6094374   .7818854
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}1.407441   2.354018  -3.485154
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.6       95.4       93.8
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}88.2       90.2       69.6
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0012828  -.0023641  -.0013121
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9987172   .9976359   .9986879
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1124019    .120584   .1387869
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -13.11044  -34.40808
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0126232   .0145316   .0192443
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}   {res}.112353   .1205469   .1387237
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1124665   .1099383   .1412129
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4399979   .4303114   .5528764
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.0575289  -8.828434   1.747992
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.2         93       95.8
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0048688  -.0042696  -.0053216
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.495131    1.49573   1.494678
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1114508   .1239011   .1430622
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -19.08746  -39.31012
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0124326   .0153544   .0204747
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1115014   .1239127   .1430897
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1123107   .1099383   .1412129
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4394151   .4303114   .5528764
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.7715725  -11.26929  -1.292712
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.9       91.4       94.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0062239   -.000872  -.0051354
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.4937761    .499128   .4948646
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1573131   .1612593   .2094489
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -4.834381  -43.58776
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0247614   .0259793   .0438514
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1573576    .161181   .2094072
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1586881   .1570945   .1993961
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.6209638   .6148421   .7806245
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.8740371  -2.582691  -4.799671
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}95       94.1       93.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}87.2       88.1       69.7
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |}  {res}.0022508  -.0014848   .0006469
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.002251   .9985152   1.000647
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1152543   .1300736   .1465936
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -21.48809  -38.18638
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0132753   .0169044   .0214686
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1152186   .1300171   .1465217
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1134385    .110935   .1409943
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4437968   .4341825   .5519848
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.575469  -14.71369  -3.819581
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.5       90.3       93.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.2                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0039731  -.0023567  -.0044885
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.496027   1.497643   1.495512
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1123133    .130201   .1459929
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   -25.5896  -40.81672
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0126174   .0169409   .0213128
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1123274   .1301572   .1459889
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1133144    .110935   .1409943
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.4433189   .4341825   .5519848
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}.8913633  -14.79714  -3.423841
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.8       90.7         94
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MCAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0038328  -.0003171   .0025005
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.4961672   .4996829   .5025005
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1844066   .1683093   .1959102
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   20.04303  -11.39891
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0339865   .0282998   .0383487
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1843542   .1682254   .1958281
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}   {res}.183931   .1683373   .2002281
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7190954   .6588723   .7838923
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-.2579166   .0166356   2.204033
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.9       94.3       94.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}76.7         84       71.5
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MCAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0013829  -.0023255  -.0037343
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9986171   .9976745   .9962657
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1274343   .1270059    .137482
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   .6758362  -14.08257
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0162252   .0161198   .0188963
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1273781   .1269636    .137464
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1301364   .1188966   .1415826
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5085692   .4653625   .5542955
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}2.120365  -6.384953   2.982693
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}95.2       92.9       95.6
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MCAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0052156  -.0026426  -.0012338
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}1.494784   1.497357   1.498766
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1340377   .1354472   .1435323
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}  -2.070426   -12.7924
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0179753   .0183346   .0205825
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1340721   .1354052   .1434659
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1300619   .1188966   .1415826
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5083001   .4653625   .5542955
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-2.966143  -12.21922  -1.358368
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}95       90.5         94
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MNAR                 {c |}
effect               {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0029705  -.0054573  -.0062674
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.4970295   .4945427   .4937326
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}   {res}.186884   .1825129   .2050845
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   4.847274  -16.96164
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0348995   .0333074   .0420569
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1868142   .1825032   .2050777
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1846398   .1781741   .2005397
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.7218812   .6974498   .7851714
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-1.200878  -2.377249  -2.216031
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}95       93.8       93.9
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}      {res}76.1       77.8       69.5
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MNAR                 {c |}
mean0                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0049292  -.0045021  -.0040971
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}  {res}.9950708   .9954979   .9959029
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}   {res}.146616   .1368515   .1449098
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   14.77918   2.368726
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}   {res}.021499   .0187299   .0209946
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1466255   .1368572   .1448952
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1432406   .1258355    .141803
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5593777   .4925785      .5552
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |} {res}-2.302162  -8.049639  -2.143926
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}        {res}94       92.5       94.8
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c +}{hline 32}
0.5                  {c |}
.4                   {c |}
MNAR                 {c |}
mean1                {c |}
               bsims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
              sesims {c |}      {res}1000       1000       1000
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                bias {c |} {res}-.0078997  -.0099595  -.0103645
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                mean {c |}    {res}1.4921   1.490041   1.489635
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               empse {c |}  {res}.1415593   .1305953    .138416
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             relprec {c |}          {res}   17.49554   4.593358
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                 mse {c |}  {res}.0200814   .0171373   .0192473
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
                rmse {c |}  {res}.1417088   .1309094   .1387345
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             modelse {c |}  {res}.1432662   .1258355    .141803
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
             ciwidth {c |}  {res}.5595873   .4925785      .5552
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
            relerror {c |}  {res}1.205773   -3.64473   2.446964
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               cover {c |}      {res}94.8       94.5       94.7
                     {txt}{c |}          {res}                      
                     {txt}{c |} 
               power {c |}       {res}100        100        100
                     {txt}{c |}          {res}                      
{txt}{hline 21}{c BT}{hline 32}

{com}. 
. siman lollyplot
{txt}Performance measures not specified: defaulting to bias empse cover
{res}{txt}Drawing 3 graphs (one per target)...
{err}WARNING: each graph will have 12 columns of panels: consider using if option as detailed in {help siman lollyplot}
{res}{txt}
{com}. 
. siman nestloop
{txt}Performance measures not specified: defaulting to bias empse cover
{res}{txt}Drawing 9 graphs (3 targets * 3 performance measures)...
{res}{txt}
{com}. 
. 
. * examples in paper
. use "https://raw.githubusercontent.com/UCL/siman/master/simpaper1.dta", clear
{txt}(simcheck99 data from Analysis\Simulations\simcheck\missing confounder code)

{com}. siman setup, rep(repno) dgm(dgm) method(method) est(b) se(se) true(0)

{txt}{col 20}SUMMARY OF DATA
_____________________________________________________

The siman format is:{res}{col 35}format 1: long-long
{txt}The format for targets is:{res}{col 35}long
{txt}The format for methods is:{res}{col 35}long
{txt}The number of targets is:{res}{col 35}N/A
{txt}The target values are:{res}{col 35}N/A

{txt}The number of methods is:{res}{col 35}3
{txt}The method values are:{res}{col 35}Full CCA MI

Data generating mechanism (dgm)
{txt}The total number of dgms is: {res}{col 35}3
{txt}The dgm variables (# levels): {res}{col 35}dgm (3) 

Estimates are contained in the dataset

{txt}The estimates variable is:{res}{col 35}b
{txt}The se variable is:{res}{col 35}se
{txt}The df variable is:{res}{col 35}N/A
{txt}The ci variables are:{res}{col 35}N/A
{txt}The p variable is:{res}{col 35}N/A
{txt}The true variable is:{res}{col 35}_true
{txt}_____________________________________________________

{com}. set scheme mrc
{txt}
{com}. 
. siman scatter 
{txt}working.....
{res}{txt}
{com}. 
. siman swarm
{txt}working.....

{com}. 
. siman comparemethodsscatter 
{txt}Working.....
{res}{txt}
{com}. 
. siman blandaltman 
{txt}working....
{res}{txt}
{com}. 
. siman zipplot
{txt}Drawing 1 graphs (1 per true value)...
{res}{txt}
{com}. 
. 
. * trellis
. 
. * nestloop
. 
. use nestloop/res.dta, clear
{txt}
{com}. * theta as dgmvar must be encoded, but theta as true value mustn't be
. gen theta_new = 1
{txt}
{com}. replace theta_new = 0 if theta == 0.5
{txt}(192 real changes made)

{com}. replace theta_new = 2 if theta == 0.75
{txt}(192 real changes made)

{com}. replace theta_new = 3 if theta == 1
{txt}(192 real changes made)

{com}. label define theta_newl 0 "0.5" 1 "0.6666667" 2 "0.75" 3 "1"
{txt}
{com}. label values theta_new theta_newl
{txt}
{com}. 
. * also encode tau2
. gen tau2_new = 0
{txt}
{com}. replace tau2_new = 1 if round(tau2,0.01) == 0.05
{txt}(192 real changes made)

{com}. replace tau2_new = 2 if round(tau2,0.01) == 0.1
{txt}(192 real changes made)

{com}. replace tau2_new = 3 if round(tau2,0.01) == 0.2
{txt}(192 real changes made)

{com}. label define tau2_newl 0 "0" 1 "0.05" 2 "0.1" 3 "0.2"
{txt}
{com}. label values tau2_new tau2_newl
{txt}
{com}. drop tau2
{txt}
{com}. rename tau2_new tau2
{res}{txt}
{com}. 
. drop expfem exprem expmh msefem mserem msemh msepeto mseg2 mselimf covfem covrem covmh covpeto covg2 covlimf msepeters covpeters expexpect mseexpect covexpect msetrimfill covtrimfill biasfem biasrem biasmh biaspeto biaspeters biassfem biassrem biasg2 biaslimf biaslimr biasexpect biastrimfill var2fem var2rem var2mh var2expect
{txt}
{com}. 
. siman setup, rep(v1) dgm(theta_new rho pc tau2 k) method(peto g2 limf peters trimfill) estimate(exp) se(var2) true(theta)

{txt}{col 20}SUMMARY OF DATA
_____________________________________________________

The siman format is:{res}{col 35}format 3: long-wide
{txt}The format for targets is:{res}{col 35}long
{txt}The format for methods is:{res}{col 35}wide
{txt}The number of targets is:{res}{col 35}N/A
{txt}The target values are:{res}{col 35}N/A

{txt}The number of methods is:{res}{col 35}5
{txt}The method values are:{res}{col 35}peto g2 limf peters trimfill

Data generating mechanism (dgm)
{txt}The total number of dgms is: {res}{col 35}768
{txt}The dgm variables (# levels): {res}{col 35}theta_new (4) rho (4) pc (4) tau2 (4) k (3) 

Estimates are contained in the dataset

{txt}The estimates stub is:{res}{col 35}exp
{txt}The se stub is:{res}{col 35}var2
{txt}The df stub is:{res}{col 35}N/A
{txt}The ci stubs are:{res}{col 35}N/A
{txt}The p stub is:{res}{col 35}N/A
{txt}The true variable is:{res}{col 35}theta
{txt}_____________________________________________________

{com}. 
. * siman analyse needs force option to cope with only 1 repetition per dgm [NB gets many lines of red output, suppressed by cap], and notable option because siman table fails
. cap siman analyse, force 
{txt}
{com}. assert _rc == 198
{txt}
{com}. 
. * Recreating Gerta's graph, Figure 2
. siman nestloop mean, dgmorder(-theta_new rho -pc tau2 -k) ylabel(0.2 0.5 1) ytitle("Odds ratio") xlabel(none) xtitle("")
{res}{txt}Drawing graph...
{res}{txt}
{com}. 
. 
. di as result "*** SIMAN GRAPHS HAVE PASSED ALL THESE TESTS ***"
{res}*** SIMAN GRAPHS HAVE PASSED ALL THESE TESTS ***
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\git\siman\Ella_testing\Testing_IRW_TPM_EMZ.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Nov 2023, 12:26:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}