
. 
. ********************************
. ********************************
. * DGM defined by 1 variable:
. * numeric
. * numeric with string labels
. * string
. * missing
. 
. * DGM defined by multiple variables with multiple levels:
. * numeric
. * numeric with string labels
. * string
. 
. * TARGET and METHOD:
. * wide or long
. * numeric
. * numeric with string labels
. * string
. * missing
. 
. * method: methlist option for subset of multiple methods
. 
. * TRUE
. * numeric value
. * numeric variable 1 level
. * numeric variable >1 level
. * missing
. ********************************
. ********************************
. 
. 
. * DGM numeric, 1 var
. *********************
. * target long and string, method long and numeric, true variable 1 level
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true
_____________________________________________________

. siman comparemethodsscatter if estimand=="beta" & dgm==2
siman comparemethodsscatter will draw 1 graph showing 2 methods

. * graphs
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test1", replace) 
siman scatter will draw 1 graph with 8 panels

. 
. siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test1", repla
> ce)
siman swarm will draw 1 graph with 4 panels

. 
. siman zipplot, bygr(cols(4))
siman zipplot will draw 1 graph with 8 panels

. siman zipplot, legend(order(1 "Stalk" 2 "Carrot")) xtit("x-title") ylab(95) noncoveroptions(pstyle
> (p3)) ///
>     coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) ///
>     bygr(cols(4)) name("zipplot_test1", replace) ymin(60)
siman zipplot will draw 1 graph with 8 panels

. 
. siman comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("cms_test1", replace)
>  
siman comparemethodsscatter will draw 4 graphs each showing 2 methods
Consider reducing the number of graphs using 'if' condition

. 
. siman blandaltman, ytitle("test y-title") xtitle("test x-title") name("ba_test1", replace) 
siman blandaltman will draw 4 graphs each with 1 panel
Consider reducing the number of graphs/panels using 'if' condition or 'by' option

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         1          2
---------------------+---------------------
1                    |
beta                 |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot, xtitle("test x-title") ytitle("test y-title") name("lollyplot_test1", replace)
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 2 graphs with 6 panels (3 PMs by 2 DGMs)

. 
. 
. * DGM numeric with string labels, 1 var
. *****************************************
. 
. * target wide and numeric with string labels, method wide and string, true value
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. encode estimand, gen(estimand_num)

. drop estimand

. rename estimand_num estimand

. label define dgml 1 "D1" 2 "D2"

. label values dgm dgml

. gen method_str = ""
(8,000 missing values generated)

. replace method_str = "A" if method == 1
(4,000 real changes made)

. replace method_str = "B" if method == 2
(4,000 real changes made)

. drop method

. rename method_str method

. drop true

. reshape wide est se, i(rep dgm estimand) j(method, string)
(j = A B)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            8,000   ->   4,000       
Number of variables                   6   ->   7           
j variable (2 values)            method   ->   (dropped)
xij variables:
                                    est   ->   estA estB
                                     se   ->   seA seB
-----------------------------------------------------------------------------

. reshape wide estA estB seA seB, i(rep dgm) j(estimand)
(j = 1 2)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            4,000   ->   2,000       
Number of variables                   7   ->   10          
j variable (2 values)          estimand   ->   (dropped)
xij variables:
                                   estA   ->   estA1 estA2
                                   estB   ->   estB1 estB2
                                    seA   ->   seA1 seA2
                                    seB   ->   seB1 seB2
-----------------------------------------------------------------------------

. siman setup, rep(rep) dgm(dgm) target(1 2) method(A B) estimate(est) se(se) true(0) order(method)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    target
  Number of targets:              2
  Target values:                  1 2

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  A; B

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            _true
_____________________________________________________

. * has made target string
.  
. * graphs
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test2", replace) 
siman scatter will draw 1 graph with 8 panels

. 
. siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test2", repla
> ce)
siman swarm will draw 1 graph with 4 panels

. 
. siman zipplot, legend(order(1 "Stalk" 2 "Carrot")) xtit("x-title") ytit("y-title") ylab(0 40 100) 
> noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("zipplot_
> test2", replace)
siman zipplot will draw 1 graph with 8 panels

. 
. siman comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("cms_test2", replace)
>  
siman comparemethodsscatter will draw 4 graphs each showing 2 methods
Consider reducing the number of graphs using 'if' condition

. 
. siman blandaltman, ytitle("test y-title") xtitle("test x-title") name("ba_test2", replace)        
siman blandaltman will draw 4 graphs each with 1 panel
Consider reducing the number of graphs/panels using 'if' condition or 'by' option

. 
. siman analyse                                 
siman analyse has run successfully

-------------------------------------------
dgm, target and      |        method       
performance measure  |         A          B
---------------------+---------------------
D1                   |
1                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
D1                   |
2                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
D2                   |
1                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
D2                   |
2                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot, xtitle("test x-title") ytitle("test y-title") name("lollyplot_test2", replace)
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 2 graphs with 6 panels (3 PMs by 2 DGMs)

. 
.  
. * DGM string, 1 var
. ********************
. * target and method long numeric string labels, true missing
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. encode estimand, gen(estimand_num)

. drop estimand

. rename estimand_num estimand

. label define methodl 1 "A" 2 "B"

. label values method methodl

. gen dgm_str = ""
(8,000 missing values generated)

. replace dgm_str = "1" if dgm == 1
(4,000 real changes made)

. replace dgm_str = "2" if dgm == 2
(4,000 real changes made)

. drop dgm true

. rename dgm_str dgm

. 
. siman setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) 
Warning: dgm variable dgm has been converted from string to numeric. If you require its levels to be
  ordered differently, encode dgm as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  A; B

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            N/A
_____________________________________________________

. * graphs
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test3", replace) 
siman scatter will draw 1 graph with 8 panels

. 
. siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test3", repla
> ce)
siman swarm will draw 1 graph with 4 panels

. 
. cap siman zipplot, legend(order(1 "Stalk" 2 "Carrot")) xtit("x-title") ytit("y-title") ylab(0 40 1
> 00) noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("zipplot_
> test3", replace)

. assert _rc == 498

. * siman zipplot can not be run w/o true value as required
. 
. siman comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("cms_test3", replace)
>  
siman comparemethodsscatter will draw 4 graphs each showing 2 methods
Consider reducing the number of graphs using 'if' condition

. 
. siman blandaltman, ytitle("test y-title") xtitle("test x-title") name("ba_test3", replace) 
siman blandaltman will draw 4 graphs each with 1 panel
Consider reducing the number of graphs/panels using 'if' condition or 'by' option

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         A          B
---------------------+---------------------
1                    |
beta                 |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot, xtitle("test x-title") ytitle("test y-title") name("lollyplot_test3", replace)
Performance measures not specified, no true values: defaulting to mean empse relerror
siman lollyplot will draw 2 graphs with 6 panels (3 PMs by 2 DGMs)

.  
.  
. * DGM missing
. ************** 
. * Target numeric, method missing, true > 1 level (different true values per target)
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. replace true=0.5 if estimand=="beta"
(4,000 real changes made)

. keep if dgm==1 & method==1 // new 20dec2023 - reproducibly selects records
(6,000 observations deleted)

. drop dgm method

. gen estimand_num = .
(2,000 missing values generated)

. replace estimand_num = 1 if estimand == "beta"
(1,000 real changes made)

. replace estimand_num = 2 if estimand == "gamma"
(1,000 real changes made)

. drop estimand

. rename estimand_num estimand

. *bysort rep estimand: gen repitionindi=_n
. *drop if repitionindi>1 // pre 20dec2023 non-reproducibly selects records
. *drop repitionindi
. siman setup, rep(rep) target(estimand) estimate(est) se(se) true(true)
Warning: no method specified. siman will assume there is only one method and create a variable
  _method. If this is a mistake, enter method() option in -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       N/A
  Total number of DGMs:           1

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  1; 2

Methods
  Variable containing methods:    _method
  Number of methods:              1
  Method values:                  1

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true
_____________________________________________________

. 
. * graphs
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test4", replace) 
siman scatter will draw 1 graph with 2 panels

. 
. cap siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test4", r
> eplace)

. assert _rc == 498

. * siman swarm can not be run without method as required
. 
. siman zipplot, legend(order(3 "Carrot" 4 "Stalk")) xtit("x-title") ytit("y-title") noncoveroptions
> (pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("zipplot_
> test4", replace)    
siman zipplot will draw 1 graph with 2 panels

. 
. cap siman comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("cms_test4", repl
> ace) 

. assert _rc == 498

. * siman cms can not be run without method as required
. 
. cap siman blandaltman, ytitle("test y-title") xtitle("test x-title") name("ba_test4", replace) 

. assert _rc == 498

. * siman bland altman can not be run without method as required
. 
. 
. * now try with missing target
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. keep if estimand=="beta" // new 20dec2023 - reproducibly selects records
(4,000 observations deleted)

. drop estimand

. *bysort rep dgm method: gen repitionindi=_n
. *drop if repitionindi == 2 // pre 20dec2023 non-reproducibly selects records
. *drop repitionindi
. siman setup, rep(rep) dgm(dgm) method(method) estimate(est) se(se) true(true)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    N/A
  Number of targets:              1
  Target values:                  

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  1; 2

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true
_____________________________________________________

.  
. * graphs
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test5", replace) 
siman scatter will draw 1 graph with 4 panels

. 
. siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test5", repla
> ce)
siman swarm will draw 1 graph with 2 panels

. 
. siman zipplot, legend(order(1 "Stalk" 2 "Carrot")) xtit("x-title") ytit("y-title") ylab(0 40 100) 
> noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("zipplot_
> test5", replace)
siman zipplot will draw 1 graph with 4 panels

. 
. siman comparemethodsscatter, title("testtitle") subgr(xtit("testaxis")) name("cms_test5", replace)
>  
siman comparemethodsscatter will draw 2 graphs each showing 2 methods

. 
. siman blandaltman, ytitle("test y-title") xtitle("test x-title") name("ba_test5", replace) 
siman blandaltman will draw 2 graphs each with 1 panel

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm and performance  |        method       
measure              |         1          2
---------------------+---------------------
1                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
2                    |
             estreps |      1000       1000
                     |                     
                     | 
              sereps |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot, xtitle("test x-title") ytitle("test y-title") name("lollyplot_test5")
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 1 graph with 6 panels (3 PMs by 2 DGMs)

.  
.  
. * dgm has missing values AND method labels have spaces
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. replace dgm=. if dgm==2
(4,000 real changes made, 4,000 to missing)

. label def mymethod 1 "First method" 2 "Method, second"

. label val method mymethod

. siman setup, rep(rep) target(esti) dgm(dgm) method(method) estimate(est) se(se) true(true) dgmmiss
> ingok
Warning: dgm variable dgm contains missing values. You have used the dgmmissingok option, so siman
  will procede, but please beware of problems.

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    estimand
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  First method; Method, second

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            true
_____________________________________________________

.  
. siman scatter, ytitle("test y-title") xtitle("test x-title") name("scatter_test5a", replace) 
siman scatter will draw 1 graph with 8 panels

. 
. siman swarm, graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_test5a", repl
> ace)
siman swarm will draw 1 graph with 4 panels

. 
. siman zipplot, legend(order(1 "Stalk" 2 "Carrot")) xtit("x-title") ytit("y-title") ylab(0 40 100) 
> noncoveroptions(pstyle(p3)) ///
> coveroptions(pstyle(p4)) scatteroptions(mcol(gray%50)) truegraphoptions(pstyle(p6)) name("zipplot_
> test5a", replace)
siman zipplot will draw 1 graph with 8 panels

. 
. siman comparemethodsscatter if estimand=="beta", title("testtitle") subgr(xtit("testaxis")) name("
> cms_test5a", replace) 
siman comparemethodsscatter will draw 2 graphs each showing 2 methods

. 
. siman blandaltman if estimand=="beta", ytitle("test y-title") xtitle("test x-title") name("ba_test
> 5a", replace) 
siman blandaltman will draw 2 graphs each with 1 panel

. 
. siman analyse
siman analyse has run successfully

-----------------------------------------------------
dgm, estimand and    |             method            
performance measure  |   First method  Method, second
---------------------+-------------------------------
1                    |
beta                 |
             estreps |           1000            1000
                     |                               
                     | 
              sereps |           1000            1000
                     |                               
                     | 
                bias |      -.0043991       -.0025973
                     |       .0024993        .0035644
                     | 
             pctbias |                               
                     |                               
                     | 
                mean |      -.0043991       -.0025973
                     |       .0024993        .0035644
                     | 
               empse |       .0790336        .1127159
                     |       .0017681        .0025217
                     | 
             relprec |                       -50.8353
                     |                        2.28676
                     | 
                 mse |       .0062594        .0126989
                     |       .0002881        .0006187
                     | 
                rmse |       .0791165        .1126895
                     |       .0018209        .0027454
                     | 
             modelse |       .0787452        .1136343
                     |       .0001572        .0003405
                     | 
             ciwidth |       .3080681        .4434751
                     |       .0006123        .0013217
                     | 
            relerror |      -.3649609        .8147949
                     |       2.237882        2.275551
                     | 
               cover |           94.7            95.7
                     |       .7084563        .6414907
                     | 
               power |            5.3             4.3
                     |       .7084561        .6414905
---------------------+-------------------------------
1                    |
gamma                |
             estreps |           1000            1000
                     |                               
                     | 
              sereps |           1000            1000
                     |                               
                     | 
                bias |       .0005151        .0056354
                     |       .0025476        .0035789
                     | 
             pctbias |                               
                     |                               
                     | 
                mean |       .0005151        .0056354
                     |       .0025476        .0035789
                     | 
               empse |       .0805615        .1131762
                     |       .0018023         .002532
                     | 
             relprec |                      -49.33068
                     |                       2.314097
                     | 
                 mse |       .0064839        .0128278
                     |       .0002847        .0005329
                     | 
                rmse |       .0805229        .1132599
                     |       .0017676        .0023524
                     | 
             modelse |       .0788425        .1140264
                     |       .0001466        .0003426
                     | 
             ciwidth |       .3085282        .4450112
                     |       .0005716        .0013243
                     | 
            relerror |      -2.133844        .7512448
                     |       2.196998        2.274225
                     | 
               cover |           94.5            96.4
                     |       .7209369        .5891009
                     | 
               power |            5.5             3.6
                     |       .7209369         .589101
---------------------+-------------------------------
.                    |
beta                 |
             estreps |           1000            1000
                     |                               
                     | 
              sereps |           1000            1000
                     |                               
                     | 
                bias |      -.0046965       -.0058509
                     |       .0028908        .0039932
                     | 
             pctbias |                               
                     |                               
                     | 
                mean |      -.0046965       -.0058509
                     |       .0028908        .0039932
                     | 
               empse |       .0914144        .1262755
                     |       .0020451         .002825
                     | 
             relprec |                      -47.59274
                     |                       2.430245
                     | 
                 mse |       .0083703        .0159638
                     |       .0003797        .0007445
                     | 
                rmse |       .0914893        .1263479
                     |       .0020748        .0029462
                     | 
             modelse |       .0910296        .1313619
                     |       .0001752        .0003826
                     | 
             ciwidth |        .356176        .5127883
                     |        .000683        .0014841
                     | 
            relerror |       -.420924        4.028049
                     |       2.236001        2.346937
                     | 
               cover |             95            95.6
                     |       .6892024        .6485677
                     | 
               power |              5             4.4
                     |       .6892024        .6485677
---------------------+-------------------------------
.                    |
gamma                |
             estreps |           1000            1000
                     |                               
                     | 
              sereps |           1000            1000
                     |                               
                     | 
                bias |       .0005948        .0065072
                     |       .0029417        .0041326
                     | 
             pctbias |                               
                     |                               
                     | 
                mean |       .0005948        .0065072
                     |       .0029417        .0041326
                     | 
               empse |       .0930244        .1306846
                     |       .0020811        .0029237
                     | 
             relprec |                      -49.33068
                     |                       2.314097
                     | 
                 mse |       .0086452        .0171037
                     |       .0003795        .0007105
                     | 
                rmse |       .0929798        .1307813
                     |        .002041        .0027163
                     | 
             modelse |       .0910394        .1316664
                     |       .0001693        .0003955
                     | 
             ciwidth |       .3562577        .5138547
                     |       .0006601        .0015292
                     | 
            relerror |      -2.133846         .751246
                     |       2.196998        2.274225
                     | 
               cover |           94.5            96.4
                     |       .7209369        .5891009
                     | 
               power |            5.5             3.6
                     |       .7209369         .589101
-----------------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot, xtitle("test x-title") ytitle("test y-title") name("lollyplot_test5a", replace)
Performance measures not specified: defaulting to bias empse cover
siman lollyplot will draw 2 graphs with 6 panels (3 PMs by 2 DGMs)

. 
. 
. 
. * more than 3 methods for plots, methlist option
. ****************************************************
. clear all

. prog drop _all

. use $testpath/data/bvsim_all_out.dta, clear

. rename _dnum dnum

. drop simno hazard hazcens shape cens pmcar n truebeta truegamma corr mdm

. drop if _n>100
(17,900 observations deleted)

. reshape long beta_ sebeta_ gamma_ segamma_, i(dnum) j(method)
(j = 1 2 3 4 5 6 7 8 9 10)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              100   ->   1,000       
Number of variables                  41   ->   6           
j variable (10 values)                    ->   method
xij variables:
              beta_1 beta_2 ... beta_10   ->   beta_
        sebeta_1 sebeta_2 ... sebeta_10   ->   sebeta_
           gamma_1 gamma_2 ... gamma_10   ->   gamma_
     segamma_1 segamma_2 ... segamma_10   ->   segamma_
-----------------------------------------------------------------------------

. rename beta_ estbeta

. rename sebeta_ sebeta

. rename gamma_ estgamma

. rename segamma_ segamma

. reshape long est se, i(dnum method) j(target "beta" "gamma")

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations            1,000   ->   2,000       
Number of variables                   6   ->   5           
j variable (2 values)                     ->   target
xij variables:
                       estbeta estgamma   ->   est
                         sebeta segamma   ->   se
-----------------------------------------------------------------------------

. gen dgm = 1

. expand 2, gen(dupindicator)
(2,000 observations created)

. replace dgm=2 if dupindicator==1
(2,000 real changes made)

. drop dupindicator

. 
. siman setup, rep(dnum) dgm(dgm) est(est) se(se) method(method) target(target)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       dgm (2) 
  Total number of DGMs:           2

Targets
  Variable containing targets:    target
  Number of targets:              2
  Target values:                  beta; gamma

Methods
  Variable containing methods:    method
  Number of methods:              10
  Method values:                  1; 2; 3; 4; 5; 6; 7; 8; 9; 10

Repetition-level output
  Point estimate variable:        est
  SE variable:                    se
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            N/A
_____________________________________________________

. siman comparemethodsscatter if target=="beta" & dgm==1, methlist(3 7) name("cms_test6", replace) 
siman comparemethodsscatter will draw 1 graph showing 2 methods

. siman comparemethodsscatter if target=="beta" & dgm==1, methlist(3/7) combine name("cms_test6a", r
> eplace) 
siman comparemethodsscatter will draw 1 graph showing 5 methods

. siman comparemethodsscatter if target=="beta" & dgm==1
Warning: with 10 methods compared, this plot may be too dense to read.  If you find it unreadable,
  you can choose the methods to compare using -siman comparemethodsscatter, methlist(a b)- where a
  and b are the methods you are particularly interested to compare.
siman comparemethodsscatter will draw 1 graph showing 10 methods

. siman_blandaltman, methlist(3/7) name("ba_test6", replace)
siman blandaltman will draw 4 graphs each with 4 panels
Consider reducing the number of graphs/panels using 'if' condition or 'by' option

. 
.  
.   
. **********************************************************
. * DGM defined by multiple variables with multiple levels
. **********************************************************
. clear all

. prog drop _all

. use nestloop/res.dta, clear

. keep v1 theta rho pc k exppeto expg2 var2peto var2g2

. siman setup, rep(v1) dgm(theta rho pc k) method(peto g2) estimate(exp) se(var2) true(theta)
Warning: dgm variable theta has non-integer values: converting from float to double (192 real
  changes made)

                   SUMMARY OF DATA
_____________________________________________________

Data-generating mechanism (DGM)
  DGM variables (# levels):       theta (4) rho (4) pc (4) k (3) 
  Total number of DGMs:           192

Targets
  Variable containing targets:    N/A
  Number of targets:              1
  Target values:                  

Methods
  Variable containing methods:    method
  Number of methods:              2
  Method values:                  peto; g2

Repetition-level output
  Point estimate variable:        exp
  SE variable:                    var2
  df variable:                    N/A
  Conf. limit variables:          N/A
  p-value variable:               N/A
  True value variable:            theta
_____________________________________________________

. 
. * graphs
. local useit4 theta==1 & rho==1 & k==5 // flags just 4 dgms

. local useit1 theta==1 & rho==1 & pc==1 & k==5 // flags just 1 dgm

. siman scatter if `useit4', ytitle("test y-title") xtitle("test x-title") name("scatter_test7", rep
> lace) 
siman scatter will draw 1 graph with 8 panels

. 
. siman swarm if `useit4', graphoptions(ytitle("test y-title") xtitle("test x-title")) name("swarm_t
> est7", replace)
Ignoring non-varying theta
Ignoring non-varying rho
Ignoring non-varying k
siman swarm will draw 1 graph with 4 panels

. 
. * siman zipplot is not appropriate for these data
. 
. serset clear

. if ${detail} == 1 siman comparemethodsscatter if `useit1', title("testtitle") subgr(xtit("testaxis
> ")) name("cms_test7", replace) 
siman comparemethodsscatter will draw 1 graph showing 2 methods

. * this sometimes fails with error 111 "series 0 not found" from -graph combine-
. 
. if ${detail} == 1 siman blandaltman if `useit1', ytitle("test y-title") xtitle("test x-title") nam
> e("ba_test7", replace) 
siman blandaltman will draw 1 graph with 1 panel

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
Odds Ratio,          |
Selection, Control   |
Event Proportion,    |
Number of studies    |
and performance      |        method       
measure              |      peto         g2
---------------------+---------------------
.5                   |
no                   |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0245345    .075337
                     |   .002777   .0139085
                     | 
             pctbias |  4.906902    15.0674
                     |  .5553938   2.781695
                     | 
                mean |  .5245345   .5753371
                     |   .002777   .0139085
                     | 
               empse |  .0055539   .0278169
                     |  .0022674   .0113562
                     | 
             relprec |            -96.01358
                     |             1.147575
                     | 
                 mse |  .0006251    .006256
                     |  .0001383   .0022712
                     | 
                rmse |  .0250015   .0790949
                     |  .0027655   .0143574
                     | 
             modelse |  .0523039   .4230818
                     |  .0094402   .0588171
                     | 
             ciwidth |   .194777   1.611653
                     |  .0369604   .2258558
                     | 
            relerror |  841.7444    1420.95
                     |  420.3627   655.9393
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100          0
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0207905   .0620751
                     |  .0014731   .0018035
                     | 
             pctbias |  4.158101   12.41502
                     |  .2946277   .3606911
                     | 
                mean |  .5207905   .5620751
                     |  .0014731   .0018035
                     | 
               empse |  .0029463   .0036069
                     |  .0012028   .0014725
                     | 
             relprec |            -33.27687
                     |             62.39728
                     | 
                 mse |  .0004388   .0038631
                     |  .0000625   .0002229
                     | 
                rmse |  .0209465   .0621537
                     |  .0014923   .0017929
                     | 
             modelse |  .0271276   .1462832
                     |  .0053222   .0214373
                     | 
             ciwidth |  .0997849   .5555515
                     |  .0212198   .0820015
                     | 
            relerror |  820.7433   3955.638
                     |  417.0448    1759.15
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0218542   .0655052
                     |  .0010144   .0026277
                     | 
             pctbias |  4.370832   13.10104
                     |  .2028789   .5255468
                     | 
                mean |  .5218542   .5655052
                     |  .0010144   .0026277
                     | 
               empse |  .0020288   .0052555
                     |  .0008282   .0021455
                     | 
             relprec |            -85.09778
                     |             10.37664
                     | 
                 mse |  .0004807   .0043116
                     |  .0000441   .0003496
                     | 
                rmse |  .0219247   .0656632
                     |  .0010058   .0026619
                     | 
             modelse |   .013638   .0651409
                     |   .003057   .0102975
                     | 
             ciwidth |   .049505   .2467077
                     |  .0116511   .0380247
                     | 
            relerror |   572.226   1139.487
                     |  313.0813   542.6298
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0186421   .0356501
                     |  .0017132   .0029602
                     | 
             pctbias |  3.728423   7.130012
                     |  .3426495   .5920411
                     | 
                mean |  .5186421   .5356501
                     |  .0017132   .0029602
                     | 
               empse |  .0034265   .0059204
                     |  .0013989    .002417
                     | 
             relprec |            -66.50372
                     |             27.92903
                     | 
                 mse |  .0003563   .0012972
                     |  .0000632   .0001961
                     | 
                rmse |  .0188768   .0360169
                     |  .0016745   .0027218
                     | 
             modelse |  .0402115   .2881733
                     |  .0102882    .067829
                     | 
             ciwidth |  .1406393   1.045268
                     |  .0410959   .2472866
                     | 
            relerror |  1073.546   4767.454
                     |  565.4091   2293.746
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
no                   |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0219563   .0427819
                     |  .0029959   .0082138
                     | 
             pctbias |  4.391259   8.556381
                     |  .5991797   1.642758
                     | 
                mean |  .5219563   .5427819
                     |  .0029959   .0082138
                     | 
               empse |  .0059918   .0164276
                     |  .0024461   .0067065
                     | 
             relprec |            -86.69646
                     |             2.749275
                     | 
                 mse |   .000509   .0020327
                     |  .0001436   .0008272
                     | 
                rmse |  .0225611   .0450854
                     |  .0031819   .0091736
                     | 
             modelse |  .0224768   .1150609
                     |  .0066036   .0274079
                     | 
             ciwidth |  .0761369   .4108556
                     |  .0256002   .1074338
                     | 
            relerror |  275.1263   600.4128
                     |  188.6784   331.0572
                     | 
               cover |        75        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0173771   .0352189
                     |  .0015395    .004866
                     | 
             pctbias |  3.475428   7.043785
                     |  .3078949   .9731909
                     | 
                mean |  .5173771    .535219
                     |  .0015395    .004866
                     | 
               empse |  .0030789   .0097319
                     |   .001257    .003973
                     | 
             relprec |            -89.99058
                     |             4.138905
                     | 
                 mse |  .0003091   .0013114
                     |  .0000578   .0003715
                     | 
                rmse |  .0175805   .0362133
                     |  .0016443    .005129
                     | 
             modelse |  .0105171   .0563642
                     |  .0028175     .01489
                     | 
             ciwidth |  .0361623   .1958169
                     |  .0114295   .0590812
                     | 
            relerror |  241.5811   479.1686
                     |  166.7936   281.6304
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0158964   .0265095
                     |  .0022717   .0056954
                     | 
             pctbias |  3.179279   5.301905
                     |   .454343   1.139075
                     | 
                mean |  .5158964   .5265095
                     |  .0022717   .0056954
                     | 
               empse |  .0045434   .0113907
                     |  .0018548   .0046503
                     | 
             relprec |            -84.09026
                     |             5.890756
                     | 
                 mse |  .0002682   .0008001
                     |  .0000801   .0003142
                     | 
                rmse |  .0163761   .0282854
                     |  .0024451   .0055541
                     | 
             modelse |  .0362474   .2251846
                     |  .0106679   .0601691
                     | 
             ciwidth |  .1205843   .7906933
                     |  .0433906   .2265512
                     | 
            relerror |  697.7986   1876.908
                     |  401.5102   964.5649
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
no                   |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0139198    .021059
                     |  .0022495   .0050433
                     | 
             pctbias |  2.783951   4.211802
                     |  .4499006   1.008653
                     | 
                mean |  .5139198    .521059
                     |  .0022495   .0050433
                     | 
               empse |   .004499   .0100865
                     |  .0018367   .0041178
                     | 
             relprec |            -80.10474
                     |             6.108405
                     | 
                 mse |  .0002089   .0005198
                     |  .0000642   .0002076
                     | 
                rmse |  .0144548   .0227988
                     |  .0022191   .0045534
                     | 
             modelse |  .0191011   .1020018
                     |  .0060572   .0333046
                     | 
             ciwidth |   .062111    .332958
                     |  .0241417   .1278159
                     | 
            relerror |  324.5622   911.2675
                     |  219.4738   528.6479
                     | 
               cover |        75        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0141688   .0219172
                     |  .0022549   .0065649
                     | 
             pctbias |  2.833751   4.383436
                     |  .4509821   1.312974
                     | 
                mean |  .5141687   .5219172
                     |  .0022549   .0065649
                     | 
               empse |  .0045098   .0131297
                     |  .0018411   .0053602
                     | 
             relprec |            -88.20206
                     |             .8673306
                     | 
                 mse |   .000216   .0006097
                     |  .0000707   .0003519
                     | 
                rmse |  .0146972   .0246912
                     |  .0024054   .0071258
                     | 
             modelse |  .0099199    .053505
                     |   .003185   .0166102
                     | 
             ciwidth |  .0322689   .1753814
                     |   .012527   .0664092
                     | 
            relerror |  119.9618   307.5102
                     |  114.2437   209.0016
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |   .012382   .0149108
                     |  .0032873   .0049631
                     | 
             pctbias |  2.476391   2.982161
                     |  .6574535    .992626
                     | 
                mean |   .512382   .5149108
                     |  .0032873   .0049631
                     | 
               empse |  .0065745   .0099263
                     |   .002684   .0040524
                     | 
             relprec |            -56.13089
                     |             25.45527
                     | 
                 mse |  .0001857   .0002962
                     |  .0000803   .0001553
                     | 
                rmse |  .0136283   .0172113
                     |  .0029458   .0045125
                     | 
             modelse |  .0357361   .2167648
                     |   .012368   .0675997
                     | 
             ciwidth |  .1129449   .7260923
                     |  .0478423   .2548099
                     | 
            relerror |   443.553   2083.751
                     |   290.914   1121.865
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
no                   |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |   .012017   .0200021
                     |   .002586   .0082179
                     | 
             pctbias |  2.403402    4.00042
                     |  .5171984    1.64358
                     | 
                mean |   .512017   .5200021
                     |   .002586   .0082179
                     | 
               empse |   .005172   .0164358
                     |  .0021115   .0067099
                     | 
             relprec |            -90.09777
                     |             3.060024
                     | 
                 mse |  .0001645   .0006027
                     |  .0000592   .0003189
                     | 
                rmse |  .0128246   .0245497
                     |  .0023079   .0064946
                     | 
             modelse |  .0194786   .1035415
                     |  .0062774   .0324109
                     | 
             ciwidth |  .0619289   .3376598
                     |  .0257868   .1300262
                     | 
            relerror |  276.6184   529.9752
                     |  195.8868   324.0854
                     | 
               cover |        75        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
no                   |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0114495   .0170685
                     |  .0018006   .0045096
                     | 
             pctbias |  2.289894   3.413695
                     |  .3601262   .9019214
                     | 
                mean |  .5114495   .5170685
                     |  .0018006   .0045096
                     | 
               empse |  .0036013   .0090192
                     |  .0014702   .0036821
                     | 
             relprec |            -84.05692
                     |             2.129883
                     | 
                 mse |  .0001408   .0003523
                     |  .0000461   .0001809
                     | 
                rmse |  .0118666   .0187708
                     |  .0019417   .0048175
                     | 
             modelse |  .0101801   .0580184
                     |   .003197   .0182373
                     | 
             ciwidth |  .0326109   .1863911
                     |  .0132783   .0752369
                     | 
            relerror |  182.6801   543.2752
                     |  145.5984   331.4424
                     | 
               cover |        75        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.145303   .0397657
                     |  .0030538   .0034419
                     | 
             pctbias | -29.06059   7.953131
                     |  .6107613   .6883739
                     | 
                mean |   .354697   .5397657
                     |  .0030538   .0034419
                     | 
               empse |  .0061076   .0068837
                     |  .0024934   .0028103
                     | 
             relprec |            -21.27834
                     |             88.50758
                     | 
                 mse |  .0211409   .0016168
                     |  .0008804   .0002844
                     | 
                rmse |  .1453992     .04021
                     |  .0030274   .0035364
                     | 
             modelse |  .0469239   .2585549
                     |  .0072545   .0291902
                     | 
             ciwidth |  .1773579   .9964558
                     |  .0281509   .1069139
                     | 
            relerror |  668.2849   3656.024
                     |  335.3882   1590.944
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
weak                 |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1380909   .0443307
                     |  .0026766   .0068427
                     | 
             pctbias | -27.61818   8.866143
                     |  .5353121   1.368546
                     | 
                mean |  .3619091   .5443307
                     |  .0026766   .0068427
                     | 
               empse |  .0053531   .0136855
                     |  .0021854   .0055871
                     | 
             relprec |            -84.69987
                     |             11.08132
                     | 
                 mse |  .0190906   .0021057
                     |  .0007313   .0006863
                     | 
                rmse |  .1381687   .0458877
                     |  .0026463   .0074779
                     | 
             modelse |  .0257412   .0925105
                     |  .0040901   .0174914
                     | 
             ciwidth |  .0969385   .3435351
                     |  .0161704   .0670509
                     | 
            relerror |  380.8628   575.9766
                     |  210.6562   304.1264
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1349556   .0418437
                     |  .0025771    .005762
                     | 
             pctbias | -26.99112   8.368746
                     |  .5154144   1.152393
                     | 
                mean |  .3650444   .5418437
                     |  .0025771    .005762
                     | 
               empse |  .0051541   .0115239
                     |  .0021042   .0047046
                     | 
             relprec |            -79.99625
                     |             .9075928
                     | 
                 mse |  .0182329   .0018505
                     |  .0006986   .0004938
                     | 
                rmse |  .1350294   .0430174
                     |  .0025867   .0057399
                     | 
             modelse |  .0142908   .0491616
                     |  .0030536    .012751
                     | 
             ciwidth |  .0523353   .1741708
                     |  .0115342   .0476155
                     | 
            relerror |  177.2673   326.6046
                     |  127.7608   206.3367
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0957176   .0239646
                     |  .0024809   .0022257
                     | 
             pctbias | -19.14351    4.79292
                     |  .4961856   .4451405
                     | 
                mean |  .4042824   .5239646
                     |  .0024809   .0022257
                     | 
               empse |  .0049619   .0044514
                     |  .0020257   .0018173
                     | 
             relprec |             24.24931
                     |             98.83461
                     | 
                 mse |  .0091803   .0005892
                     |  .0004714   .0001154
                     | 
                rmse |   .095814   .0242727
                     |  .0024598   .0023767
                     | 
             modelse |  .0388266   .2037728
                     |  .0090676   .0469526
                     | 
             ciwidth |  .1388847   .7402756
                     |    .03594   .1732367
                     | 
            relerror |  682.5007   4477.718
                     |  368.0313   2145.961
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
weak                 |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0898465   .0223988
                     |  .0026699   .0047255
                     | 
             pctbias | -17.96929   4.479769
                     |  .5339744   .9450977
                     | 
                mean |  .4101535   .5223988
                     |  .0026699   .0047255
                     | 
               empse |  .0053397    .009451
                     |  .0021799   .0038583
                     | 
             relprec |             -68.0782
                     |             32.30524
                     | 
                 mse |  .0080938   .0005687
                     |   .000474   .0002469
                     | 
                rmse |  .0899654   .0238474
                     |  .0026344   .0051761
                     | 
             modelse |  .0206246   .0885834
                     |  .0053245    .026152
                     | 
             ciwidth |  .0723617   .2985837
                     |   .020817   .1023454
                     | 
            relerror |  286.2479   837.2932
                     |  186.5678   472.2177
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.086062   .0217043
                     |  .0022046   .0078181
                     | 
             pctbias | -17.21241   4.340851
                     |  .4409154   1.563616
                     | 
                mean |   .413938   .5217043
                     |  .0022046   .0078181
                     | 
               empse |  .0044092   .0156362
                     |     .0018   .0063834
                     | 
             relprec |            -92.04847
                     |             9.168727
                     | 
                 mse |  .0074213   .0006544
                     |  .0003742   .0003619
                     | 
                rmse |  .0861467   .0255821
                     |  .0021718   .0070728
                     | 
             modelse |  .0112648   .0517927
                     |   .003062    .017829
                     | 
             ciwidth |  .0392306   .1652108
                     |  .0117022   .0681275
                     | 
            relerror |   155.487   231.2371
                     |  125.3072   176.8835
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0601118   .0116842
                     |  .0016745    .001881
                     | 
             pctbias | -12.02236   2.336848
                     |  .3348904   .3762055
                     | 
                mean |  .4398882   .5116842
                     |  .0016745    .001881
                     | 
               empse |  .0033489   .0037621
                     |  .0013672   .0015359
                     | 
             relprec |            -20.75805
                     |             71.58934
                     | 
                 mse |  .0036218   .0001471
                     |  .0001992   .0000467
                     | 
                rmse |  .0601817     .01213
                     |  .0016546   .0019269
                     | 
             modelse |  .0347377   .1866656
                     |  .0099342    .051531
                     | 
             ciwidth |  .1170299   .6369234
                     |  .0401916   .2079555
                     | 
            relerror |  937.2855   4861.799
                     |  517.0329   2445.297
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
weak                 |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0559196   .0162193
                     |  .0014169   .0044277
                     | 
             pctbias | -11.18391   3.243864
                     |  .2833701    .885549
                     | 
                mean |  .4440804   .5162193
                     |  .0014169   .0044277
                     | 
               empse |  .0028337   .0088555
                     |  .0011569   .0036152
                     | 
             relprec |             -89.7604
                     |             9.275205
                     | 
                 mse |   .003133   .0003219
                     |  .0001597   .0001677
                     | 
                rmse |  .0559734    .017941
                     |  .0014268   .0046748
                     | 
             modelse |  .0198988   .0984313
                     |  .0062441   .0340505
                     | 
             ciwidth |  .0650999   .3106786
                     |  .0248079   .1321035
                     | 
            relerror |  602.2193   1011.528
                     |  361.5808    594.782
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0522388   .0203135
                     |   .002268   .0059188
                     | 
             pctbias | -10.44776     4.0627
                     |  .4536019   1.183757
                     | 
                mean |  .4477612   .5203135
                     |   .002268   .0059188
                     | 
               empse |   .004536   .0118376
                     |  .0018518   .0048327
                     | 
             relprec |            -85.31667
                     |             16.56104
                     | 
                 mse |  .0027443   .0005177
                     |  .0002354   .0002384
                     | 
                rmse |  .0523863   .0227538
                     |  .0022464   .0052385
                     | 
             modelse |  .0105118   .0543897
                     |  .0031116   .0187806
                     | 
             ciwidth |  .0347868   .1692117
                     |  .0127512   .0748848
                     | 
            relerror |  131.7415   359.4668
                     |  116.8606   245.6735
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0452205   .0145356
                     |  .0024779   .0055431
                     | 
             pctbias | -9.044107   2.907112
                     |  .4955887   1.108619
                     | 
                mean |  .4547794   .5145355
                     |  .0024779   .0055431
                     | 
               empse |  .0049559   .0110862
                     |  .0020232   .0045259
                     | 
             relprec |            -80.01618
                     |             21.18231
                     | 
                 mse |  .0020633   .0003035
                     |  .0002181   .0001625
                     | 
                rmse |  .0454238   .0174201
                     |  .0024012   .0046652
                     | 
             modelse |  .0341552   .2020677
                     |  .0107238   .0678787
                     | 
             ciwidth |  .1116553   .6495634
                     |  .0426559   .2617092
                     | 
            relerror |  589.1853   1722.698
                     |  354.9439   963.6353
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
weak                 |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0421998   .0155598
                     |  .0016028   .0029889
                     | 
             pctbias | -8.439962   3.111956
                     |  .3205616   .5977736
                     | 
                mean |  .4578002   .5155598
                     |  .0016028   .0029889
                     | 
               empse |  .0032056   .0059777
                     |  .0013087   .0024404
                     | 
             relprec |            -71.24261
                     |             32.95933
                     | 
                 mse |  .0017885   .0002689
                     |  .0001358   .0000794
                     | 
                rmse |   .042291   .0163984
                     |   .001605   .0024216
                     | 
             modelse |  .0182899   .0911266
                     |  .0055193   .0281893
                     | 
             ciwidth |  .0596394   .2947716
                     |  .0229733   .1164881
                     | 
            relerror |  470.5573   1424.433
                     |  289.6563   780.8304
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
weak                 |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0406324   .0209958
                     |  .0022588   .0057535
                     | 
             pctbias | -8.126475   4.199156
                     |  .4517615   1.150706
                     | 
                mean |  .4593676   .5209958
                     |  .0022588   .0057535
                     | 
               empse |  .0045176   .0115071
                     |  .0018443   .0046977
                     | 
             relprec |            -84.58691
                     |             14.66304
                     | 
                 mse |  .0016663   .0005401
                     |  .0001773   .0002406
                     | 
                rmse |  .0408203   .0232407
                     |  .0021722   .0051757
                     | 
             modelse |  .0099526    .055779
                     |  .0030013   .0178438
                     | 
             ciwidth |  .0324562   .1757505
                     |  .0124985   .0750987
                     | 
            relerror |  120.3057    384.737
                     |  111.8156   251.4118
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1843244   .0074593
                     |  .0035919   .0012277
                     | 
             pctbias | -36.86487   1.491868
                     |  .7183862   .2455307
                     | 
                mean |  .3156756   .5074593
                     |  .0035919   .0012277
                     | 
               empse |  .0071839   .0024553
                     |  .0029328   .0010024
                     | 
             relprec |             756.0602
                     |             953.0593
                     | 
                 mse |  .0340142   .0000602
                     |  .0013155   .0000176
                     | 
                rmse |  .1844293   .0077565
                     |  .0035665   .0011365
                     | 
             modelse |  .0502198   .5094141
                     |  .0080854   .2252059
                     | 
             ciwidth |   .189243   1.457806
                     |  .0313059    .787883
                     | 
            relerror |  599.0645   20647.47
                     |   306.783   12484.88
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
moderate             |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1778726   .0062166
                     |  .0025176    .003892
                     | 
             pctbias | -35.57452   1.243323
                     |  .5035287   .7783928
                     | 
                mean |  .3221274   .5062166
                     |  .0025176    .003892
                     | 
               empse |  .0050353   .0077839
                     |  .0020556   .0031778
                     | 
             relprec |            -58.15431
                     |             2.639348
                     | 
                 mse |  .0316577   .0000841
                     |  .0008935   .0000464
                     | 
                rmse |   .177926     .00917
                     |   .002511   .0025295
                     | 
             modelse |  .0256495   .0848377
                     |  .0047689   .0208705
                     | 
             ciwidth |  .0956176   .3022701
                     |  .0179486   .0800571
                     | 
            relerror |   409.396   989.9084
                     |  228.5108    519.493
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1732162   .0107029
                     |  .0023345   .0051559
                     | 
             pctbias | -34.64324   2.140576
                     |  .4669058   1.031187
                     | 
                mean |  .3267838   .5107028
                     |  .0023345   .0051559
                     | 
               empse |  .0046691   .0103119
                     |  .0019061   .0042098
                     | 
             relprec |            -79.49858
                     |             2.746812
                     | 
                 mse |  .0300202   .0001943
                     |  .0008063   .0000942
                     | 
                rmse |  .1732634   .0139392
                     |  .0023269   .0033774
                     | 
             modelse |  .0139722   .0408154
                     |  .0020063   .0111884
                     | 
             ciwidth |    .05292   .1419521
                     |  .0081493   .0426126
                     | 
            relerror |  199.2515     295.81
                     |  129.5056    194.636
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1274161   .0070367
                     |  .0027373    .005833
                     | 
             pctbias | -25.48322   1.407337
                     |  .5474594   1.166592
                     | 
                mean |  .3725839   .5070367
                     |  .0027373    .005833
                     | 
               empse |  .0054746   .0116659
                     |   .002235   .0047626
                     | 
             relprec |            -77.97754
                     |             21.46514
                     | 
                 mse |  .0162573   .0001516
                     |  .0006957   .0001305
                     | 
                rmse |  .1275043    .012312
                     |  .0027281   .0052995
                     | 
             modelse |  .0400239   .1766589
                     |  .0090211   .0444314
                     | 
             ciwidth |  .1451032    .620731
                     |  .0344472    .177234
                     | 
            relerror |  631.0848   1414.316
                     |  340.9305   726.1201
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
moderate             |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1203096   .0078735
                     |  .0020008   .0063073
                     | 
             pctbias | -24.06191   1.574695
                     |  .4001549   1.261461
                     | 
                mean |  .3796904   .5078735
                     |  .0020008   .0063073
                     | 
               empse |  .0040015   .0126146
                     |  .0016336   .0051499
                     | 
             relprec |            -89.93745
                     |             6.971973
                     | 
                 mse |  .0144864   .0001813
                     |  .0004823   .0001776
                     | 
                rmse |  .1203595   .0134662
                     |  .0020034   .0065946
                     | 
             modelse |   .021488   .0768717
                     |  .0052584   .0245032
                     | 
             ciwidth |  .0766431   .2516439
                     |  .0201723   .0957012
                     | 
            relerror |  436.9923   509.3863
                     |   255.595   315.6312
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1168349   .0073385
                     |  .0016399   .0085658
                     | 
             pctbias | -23.36699   1.467709
                     |  .3279717   1.713168
                     | 
                mean |  .3831651   .5073385
                     |  .0016399   .0085658
                     | 
               empse |  .0032797   .0171317
                     |  .0013389    .006994
                     | 
             relprec |            -96.33501
                     |             2.271046
                     | 
                 mse |  .0136585    .000274
                     |  .0003845   .0002628
                     | 
                rmse |  .1168694   .0165522
                     |  .0016451   .0079387
                     | 
             modelse |  .0114622    .042207
                     |  .0028999   .0143076
                     | 
             ciwidth |  .0403542   .1341859
                     |  .0114068    .055879
                     | 
            relerror |  249.4882   146.3684
                     |  167.8537   130.7327
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0809034   .0135969
                     |  .0026367   .0049251
                     | 
             pctbias | -16.18069   2.719381
                     |  .5273403   .9850277
                     | 
                mean |  .4190966   .5135969
                     |  .0026367   .0049251
                     | 
               empse |  .0052734   .0098503
                     |  .0021529   .0040214
                     | 
             relprec |            -71.33942
                     |             30.54529
                     | 
                 mse |  .0065662   .0002576
                     |  .0004322   .0001417
                     | 
                rmse |  .0810322   .0160514
                     |  .0026671   .0044151
                     | 
             modelse |  .0348389   .1723101
                     |  .0098623   .0478192
                     | 
             ciwidth |  .1183807   .5848827
                     |  .0393121   .1950521
                     | 
            relerror |  560.6537   1649.292
                     |  328.2078    863.525
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
moderate             |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0761355   .0152509
                     |  .0018101   .0049559
                     | 
             pctbias |  -15.2271   3.050187
                     |  .3620157   .9911817
                     | 
                mean |  .4238645   .5152509
                     |  .0018101   .0049559
                     | 
               empse |  .0036202   .0099118
                     |  .0014779   .0040465
                     | 
             relprec |            -86.66023
                     |             6.232362
                     | 
                 mse |  .0058064   .0003063
                     |  .0002807   .0001773
                     | 
                rmse |     .0762   .0175007
                     |  .0018421   .0050652
                     | 
             modelse |  .0189118    .092609
                     |  .0055635   .0312179
                     | 
             ciwidth |  .0633653   .2904748
                     |  .0222149   .1257093
                     | 
            relerror |  422.4018   834.3297
                     |  262.8727   494.6641
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0730577   .0174697
                     |  .0016799     .00708
                     | 
             pctbias | -14.61155   3.493935
                     |  .3359841   1.415994
                     | 
                mean |  .4269423   .5174696
                     |  .0016799     .00708
                     | 
               empse |  .0033598   .0141599
                     |  .0013716   .0057808
                     | 
             relprec |            -94.36992
                     |             6.141575
                     | 
                 mse |  .0053459   .0004556
                     |  .0002461   .0002805
                     | 
                rmse |  .0731157    .021344
                     |  .0016827   .0065702
                     | 
             modelse |  .0097767    .048394
                     |  .0027885   .0146405
                     | 
             ciwidth |  .0328292   .1538552
                     |  .0114161   .0640706
                     | 
            relerror |  190.9881   241.7672
                     |  144.9147   173.6598
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0619661   .0193969
                     |  .0025259   .0052151
                     | 
             pctbias | -12.39323   3.879374
                     |    .50518   1.043019
                     | 
                mean |  .4380339   .5193969
                     |  .0025259   .0052151
                     | 
               empse |  .0050518   .0104302
                     |  .0020624   .0042581
                     | 
             relprec |            -76.54108
                     |             25.88902
                     | 
                 mse |  .0038589   .0004578
                     |  .0003087    .000169
                     | 
                rmse |  .0621204    .021397
                     |  .0024847   .0039502
                     | 
             modelse |  .0351223   .1926346
                     |  .0112644   .0605231
                     | 
             ciwidth |  .1140522   .6201231
                     |  .0445233   .2487598
                     | 
            relerror |  595.2428   1746.895
                     |  360.9427   951.4279
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
moderate             |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0595371   .0213626
                     |  .0021053   .0069993
                     | 
             pctbias | -11.90742   4.272527
                     |  .4210528   1.399862
                     | 
                mean |  .4404629   .5213627
                     |  .0021053   .0069993
                     | 
               empse |  .0042105   .0139986
                     |  .0017189   .0057149
                     | 
             relprec |            -90.95304
                     |             9.540112
                     | 
                 mse |   .003558   .0006033
                     |   .000247   .0002964
                     | 
                rmse |  .0596487   .0245628
                     |  .0020706   .0060343
                     | 
             modelse |   .018744   .0910548
                     |  .0055046   .0297647
                     | 
             ciwidth |  .0617611   .2863628
                     |  .0229793   .1230098
                     | 
            relerror |  345.1689   550.4557
                     |   223.877    340.184
                     | 
               cover |        25         75
                     |  21.65063   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
moderate             |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0562699   .0212245
                     |  .0018965   .0062807
                     | 
             pctbias | -11.25397   4.244905
                     |  .3792988   1.256142
                     | 
                mean |  .4437301   .5212245
                     |  .0018965   .0062807
                     | 
               empse |   .003793   .0125614
                     |  .0015485   .0051282
                     | 
             relprec |            -90.88229
                     |             10.19127
                     | 
                 mse |  .0031771   .0005688
                     |  .0002146   .0002763
                     | 
                rmse |  .0563657     .02385
                     |  .0019034   .0057927
                     | 
             modelse |  .0097344   .0520811
                     |  .0029926   .0181035
                     | 
             ciwidth |  .0315382   .1596085
                     |  .0124016   .0734938
                     | 
            relerror |  156.6427   314.6113
                     |  131.1582   222.3084
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2166596  -.0493135
                     |   .001975   .0006823
                     | 
             pctbias | -43.33193  -9.862701
                     |    .39501    .136463
                     | 
                mean |  .2833404   .4506865
                     |   .001975   .0006823
                     | 
               empse |  .0039501   .0013646
                     |  .0016126   .0005571
                     | 
             relprec |             737.8892
                     |             925.4865
                     | 
                 mse |  .0469531   .0024332
                     |  .0008498   .0000664
                     | 
                rmse |  .2166866   .0493277
                     |  .0019608   .0006729
                     | 
             modelse |    .04819   .1791779
                     |  .0082655   .0453483
                     | 
             ciwidth |  .1804697   .6280221
                     |  .0322201   .1815709
                     | 
            relerror |  1119.969   13030.15
                     |  540.2216   6306.868
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
strong               |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2097985  -.0327445
                     |  .0014303   .0024078
                     | 
             pctbias |  -41.9597  -6.548901
                     |  .2860599   .4815692
                     | 
                mean |  .2902015   .4672555
                     |  .0014303   .0024078
                     | 
               empse |  .0028606   .0048157
                     |  .0011678    .001966
                     | 
             relprec |            -64.71449
                     |             13.98717
                     | 
                 mse |  .0440215   .0010896
                     |  .0005984   .0001624
                     | 
                rmse |  .2098131    .033009
                     |  .0014261   .0024593
                     | 
             modelse |  .0257777   .0681493
                     |  .0039681   .0176175
                     | 
             ciwidth |  .0972189   .2370643
                     |  .0159053   .0710971
                     | 
            relerror |  801.1296    1315.15
                     |  393.1678   683.8209
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2035869  -.0266696
                     |  .0011961   .0013512
                     | 
             pctbias | -40.71738  -5.333926
                     |  .2392115   .2702369
                     | 
                mean |  .2964131   .4733304
                     |  .0011961   .0013512
                     | 
               empse |  .0023921   .0027024
                     |  .0009766   .0011032
                     | 
             relprec |            -21.64354
                     |             88.99332
                     | 
                 mse |  .0414519   .0007167
                     |  .0004869   .0000685
                     | 
                rmse |  .2035974   .0267721
                     |  .0011957    .001279
                     | 
             modelse |  .0136236   .0332405
                     |  .0018771   .0098563
                     | 
             ciwidth |  .0518442   .1124259
                     |   .007396   .0380287
                     | 
            relerror |  469.5199   1130.048
                     |  245.3907   620.6414
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1540691  -.0110092
                     |  .0017148   .0047823
                     | 
             pctbias | -30.81381  -2.201831
                     |  .3429636   .9564585
                     | 
                mean |  .3459309   .4889908
                     |  .0017148   .0047823
                     | 
               empse |  .0034296   .0095646
                     |  .0014001   .0039047
                     | 
             relprec |            -87.14228
                     |             13.25403
                     | 
                 mse |  .0237461   .0001898
                     |  .0005272    .000091
                     | 
                rmse |  .1540977   .0137772
                     |  .0017106   .0033027
                     | 
             modelse |  .0401654   .2163471
                     |  .0094106    .088137
                     | 
             ciwidth |  .1443901   .6335455
                     |  .0362428   .3254917
                     | 
            relerror |  1071.128    2161.96
                     |  551.2537   1304.566
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
strong               |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.145451  -.0068633
                     |  .0017377   .0051832
                     | 
             pctbias |  -29.0902  -1.372653
                     |  .3475417   1.036648
                     | 
                mean |   .354549   .4931367
                     |  .0017377   .0051832
                     | 
               empse |  .0034754   .0103665
                     |  .0014188   .0042321
                     | 
             relprec |            -88.76039
                     |             10.69627
                     | 
                 mse |  .0211651   .0001277
                     |  .0005064     .00009
                     | 
                rmse |  .1454821   .0113005
                     |  .0017403   .0039818
                     | 
             modelse |  .0208152   .0662814
                     |  .0045742   .0225841
                     | 
             ciwidth |  .0751632   .2086855
                     |  .0183311   .0893605
                     | 
            relerror |  498.9266    539.382
                     |  277.6842   339.9951
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1413911  -.0100375
                     |  .0012253   .0076818
                     | 
             pctbias | -28.27821  -2.007493
                     |  .2450635   1.536364
                     | 
                mean |  .3586089   .4899625
                     |  .0012253   .0076818
                     | 
               empse |  .0024506   .0153636
                     |  .0010005   .0062722
                     | 
             relprec |             -97.4557
                     |             1.726894
                     | 
                 mse |  .0199959   .0002778
                     |  .0003461   .0000569
                     | 
                rmse |   .141407   .0166668
                     |  .0012239   .0017068
                     | 
             modelse |  .0116525   .0404089
                     |  .0030075   .0150797
                     | 
             ciwidth |  .0412974   .1224195
                     |  .0112678   .0580344
                     | 
            relerror |  375.4873   163.0162
                     |  229.6567   145.4763
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1027568   .0056593
                     |  .0025153   .0083902
                     | 
             pctbias | -20.55135   1.131864
                     |  .5030527   1.678033
                     | 
                mean |  .3972432   .5056593
                     |  .0025153   .0083902
                     | 
               empse |  .0050305   .0167803
                     |  .0020537   .0068505
                     | 
             relprec |            -91.01277
                     |             10.28503
                     | 
                 mse |  .0105779   .0002432
                     |  .0005075    .000149
                     | 
                rmse |  .1028491   .0155953
                     |  .0024673   .0047778
                     | 
             modelse |  .0348284   .1719741
                     |  .0093835   .0559756
                     | 
             ciwidth |  .1197184   .5490242
                     |  .0378879   .2258455
                     | 
            relerror |  592.3402   924.8554
                     |  338.6487   535.0978
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
strong               |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0946036   .0132685
                     |  .0017068   .0073706
                     | 
             pctbias | -18.92072   2.653708
                     |  .3413596   1.474115
                     | 
                mean |  .4053964   .5132685
                     |  .0017068   .0073706
                     | 
               empse |  .0034136   .0147412
                     |  .0013936    .006018
                     | 
             relprec |            -94.63757
                     |             5.465208
                     | 
                 mse |  .0089586    .000339
                     |  .0003215   .0002663
                     | 
                rmse |  .0946498   .0184128
                     |  .0016982   .0072311
                     | 
             modelse |  .0189379   .0850099
                     |  .0057619   .0290809
                     | 
             ciwidth |  .0627849    .261276
                     |  .0228687   .1194135
                     | 
            relerror |  454.7793    476.684
                     |  282.4678   307.1575
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0925548   .0121874
                     |  .0015251   .0101622
                     | 
             pctbias | -18.51096   2.437487
                     |  .3050107   2.032433
                     | 
                mean |  .4074452   .5121874
                     |  .0015251   .0101622
                     | 
               empse |  .0030501   .0203243
                     |  .0012452   .0082974
                     | 
             relprec |            -97.74785
                     |             2.591141
                     | 
                 mse |  .0085734   .0004583
                     |  .0002792   .0003292
                     | 
                rmse |  .0925925   .0214089
                     |  .0015076   .0076887
                     | 
             modelse |  .0101697    .046503
                     |  .0029281   .0159041
                     | 
             ciwidth |  .0342331   .1435795
                     |  .0117937   .0648435
                     | 
            relerror |  233.4216   128.8047
                     |  166.5658   121.8548
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0815987   .0127343
                     |  .0014659   .0094856
                     | 
             pctbias | -16.31973   2.546862
                     |  .2931795   1.897128
                     | 
                mean |  .4184013   .5127343
                     |  .0014659   .0094856
                     | 
               empse |  .0029318   .0189713
                     |  .0011969    .007745
                     | 
             relprec |            -97.61179
                     |             2.196291
                     | 
                 mse |  .0066648   .0004321
                     |  .0002383   .0004128
                     | 
                rmse |  .0816382   .0207869
                     |  .0014593   .0099291
                     | 
             modelse |  .0332653   .1817789
                     |  .0103297    .057721
                     | 
             ciwidth |  .1093639   .5816606
                     |  .0410004   .2376362
                     | 
            relerror |   1034.64   858.1791
                     |  581.9857    495.569
                     | 
               cover |        25         75
                     |  21.65063   21.65063
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.5                   |
strong               |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0761374   .0174087
                     |  .0016066   .0091077
                     | 
             pctbias | -15.22748   3.481749
                     |  .3213201   1.821545
                     | 
                mean |  .4238626   .5174087
                     |  .0016066   .0091077
                     | 
               empse |  .0032132   .0182154
                     |  .0013118   .0074364
                     | 
             relprec |            -96.88831
                     |             3.022238
                     | 
                 mse |  .0058046   .0005519
                     |  .0002452   .0004213
                     | 
                rmse |  .0761882   .0234929
                     |  .0016093   .0089667
                     | 
             modelse |  .0197885   .0904489
                     |  .0067065   .0327222
                     | 
             ciwidth |  .0629509   .2733912
                     |  .0261676   .1303397
                     | 
            relerror |  515.8514   396.5508
                     |  326.7646   270.8582
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.5                   |
strong               |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0726527   .0199772
                     |  .0015871    .008474
                     | 
             pctbias | -14.53054    3.99544
                     |  .3174148     1.6948
                     | 
                mean |  .4273473   .5199772
                     |  .0015871    .008474
                     | 
               empse |  .0031741    .016948
                     |  .0012958    .006919
                     | 
             relprec |            -96.49234
                     |              3.50753
                     | 
                 mse |   .005286   .0006145
                     |  .0002315   .0004298
                     | 
                rmse |  .0727047   .0247894
                     |   .001592   .0086697
                     | 
             modelse |  .0104381   .0518558
                     |  .0032165   .0185565
                     | 
             ciwidth |  .0340683   .1572248
                     |  .0130834   .0743853
                     | 
            relerror |  228.8481   205.9702
                     |   168.202   166.1059
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0142099   .0540799
                     |  .0041479   .0061127
                     | 
             pctbias |  2.131489   8.111992
                     |  .6221794   .9169121
                     | 
                mean |  .6808766   .7207466
                     |  .0041479   .0061127
                     | 
               empse |  .0082957   .0122255
                     |  .0033867    .004991
                     | 
             relprec |             -53.9557
                     |             21.27531
                     | 
                 mse |  .0002535   .0030367
                     |  .0001063   .0006631
                     | 
                rmse |  .0159228   .0551066
                     |  .0033394   .0060168
                     | 
             modelse |  .0522249   .3731805
                     |  .0095296   .0368577
                     | 
             ciwidth |  .1930556   1.439011
                     |  .0393233   .1518228
                     | 
            relerror |  529.5402   2952.477
                     |  281.5128   1282.119
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         50
                     |         0         25
---------------------+---------------------
.6666667             |
no                   |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0091583   .0429525
                     |  .0014897   .0059598
                     | 
             pctbias |  1.373751   6.442878
                     |  .2234545   .8939638
                     | 
                mean |   .675825   .7096192
                     |  .0014897   .0059598
                     | 
               empse |  .0029794   .0119195
                     |  .0012163   .0048661
                     | 
             relprec |            -93.75204
                     |              3.11511
                     | 
                 mse |  .0000905   .0019515
                     |   .000028   .0004859
                     | 
                rmse |  .0095149   .0441755
                     |  .0014688      .0055
                     | 
             modelse |  .0265711    .133325
                     |  .0059097     .01898
                     | 
             ciwidth |   .096347   .5060368
                     |  .0228463   .0754172
                     | 
            relerror |  791.8282   1018.544
                     |  414.6121   483.6106
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0087825    .037762
                     |   .001978   .0022705
                     | 
             pctbias |   1.31738   5.664302
                     |  .2966961   .3405798
                     | 
                mean |  .6754493   .7044287
                     |   .001978   .0022705
                     | 
               empse |  .0039559   .0045411
                     |   .001615   .0018539
                     | 
             relprec |            -24.10975
                     |             44.99243
                     | 
                 mse |  .0000889   .0014414
                     |  .0000358   .0001719
                     | 
                rmse |  .0094271   .0379662
                     |   .001901   .0022633
                     | 
             modelse |   .014763    .065235
                     |  .0038266   .0120662
                     | 
             ciwidth |  .0522729   .2419886
                     |   .014335   .0477229
                     | 
            relerror |  273.1853   1336.557
                     |  180.4663   643.8573
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0068625    .025536
                     |  .0023824   .0061806
                     | 
             pctbias |   1.02938   3.830407
                     |  .3573672   .9270964
                     | 
                mean |  .6735292   .6922027
                     |  .0023824   .0061806
                     | 
               empse |  .0047649   .0123613
                     |  .0019453   .0050465
                     | 
             relprec |            -85.14133
                     |             5.271999
                     | 
                 mse |  .0000641   .0007667
                     |  .0000434   .0003538
                     | 
                rmse |  .0080077   .0276892
                     |  .0027124   .0063894
                     | 
             modelse |  .0437844   .2479154
                     |  .0120664    .046929
                     | 
             ciwidth |  .1514742   .9215121
                     |  .0465942   .1781677
                     | 
            relerror |  818.8957   1905.579
                     |  452.6111   902.5084
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0109297    .030762
                     |  .0022077   .0055271
                     | 
             pctbias |  1.639451   4.614298
                     |  .3311538   .8290724
                     | 
                mean |  .6775963   .6974287
                     |  .0022077   .0055271
                     | 
               empse |  .0044154   .0110543
                     |  .0018026   .0045129
                     | 
             relprec |            -84.04581
                     |             8.772404
                     | 
                 mse |  .0001341   .0010379
                     |  .0000472   .0002939
                     | 
                rmse |  .0115793   .0322172
                     |  .0020384   .0045618
                     | 
             modelse |  .0221106   .1068292
                     |  .0060535   .0261798
                     | 
             ciwidth |  .0755357    .377535
                     |  .0245383   .1046095
                     | 
            relerror |  400.7629   866.4037
                     |  246.1514   460.1567
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |   .009586   .0268644
                     |  .0032677    .008333
                     | 
             pctbias |  1.437894   4.029655
                     |  .4901558   1.249949
                     | 
                mean |  .6762527    .693531
                     |  .0032677    .008333
                     | 
               empse |  .0065354    .016666
                     |  .0026681   .0068039
                     | 
             relprec |            -84.62257
                     |             4.676066
                     | 
                 mse |  .0001239     .00093
                     |  .0000666   .0005207
                     | 
                rmse |  .0111321   .0304961
                     |   .002992   .0085379
                     | 
             modelse |  .0123849   .0590987
                     |   .003545   .0170337
                     | 
             ciwidth |  .0422321   .2021544
                     |  .0138247   .0653227
                     | 
            relerror |  89.50529   254.6067
                     |  94.48643   177.2112
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0066972   .0164771
                     |  .0011335   .0067318
                     | 
             pctbias |  1.004579   2.471564
                     |  .1700281   1.009763
                     | 
                mean |  .6733639   .6831438
                     |  .0011335   .0067318
                     | 
               empse |   .002267   .0134635
                     |  .0009255   .0054965
                     | 
             relprec |            -97.16468
                     |             1.874522
                     | 
                 mse |  .0000487   .0004074
                     |  .0000173   .0002199
                     | 
                rmse |   .006979   .0201852
                     |  .0012411   .0054478
                     | 
             modelse |  .0367222   .2029015
                     |  .0106939    .049292
                     | 
             ciwidth |   .121389   .7250236
                     |  .0446684   .1888007
                     | 
            relerror |  1519.828   1407.047
                     |   812.293   715.9418
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0079845   .0142787
                     |  .0029695   .0061702
                     | 
             pctbias |  1.197673   2.141811
                     |  .4454277   .9255351
                     | 
                mean |  .6746511   .6809454
                     |  .0029695   .0061702
                     | 
               empse |   .005939   .0123405
                     |  .0024246    .005038
                     | 
             relprec |             -76.8384
                     |             4.028794
                     | 
                 mse |  .0000902   .0003181
                     |  .0000638   .0002352
                     | 
                rmse |  .0094977   .0178353
                     |  .0033575   .0065924
                     | 
             modelse |  .0214565   .1065517
                     |  .0071007   .0345528
                     | 
             ciwidth |  .0685812   .3490144
                     |  .0281116   .1324654
                     | 
            relerror |  261.2799   763.4329
                     |  189.8642   450.1671
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0063971   .0165579
                     |   .000919   .0051833
                     | 
             pctbias |   .959558   2.483692
                     |  .1378556   .7774878
                     | 
                mean |  .6730638   .6832246
                     |   .000919   .0051833
                     | 
               empse |  .0018381   .0103665
                     |  .0007504   .0042321
                     | 
             relprec |            -96.85615
                     |             2.059907
                     | 
                 mse |  .0000435   .0003548
                     |  .0000108   .0002053
                     | 
                rmse |  .0065921   .0188352
                     |  .0008209   .0054488
                     | 
             modelse |  .0114723   .0578394
                     |  .0039036   .0191014
                     | 
             ciwidth |  .0362487   .1840238
                     |  .0153666   .0764635
                     | 
            relerror |  524.1498   457.9447
                     |  331.7083   292.9773
                     | 
               cover |        75        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0082904     .01527
                     |  .0025058   .0050073
                     | 
             pctbias |  1.243562   2.290506
                     |  .3758698   .7510902
                     | 
                mean |  .6749571   .6819367
                     |  .0025058   .0050073
                     | 
               empse |  .0050116   .0100145
                     |   .002046   .0040884
                     | 
             relprec |            -74.95676
                     |             28.91136
                     | 
                 mse |  .0000876   .0003084
                     |  .0000498   .0001836
                     | 
                rmse |  .0093578   .0175611
                     |  .0026604    .005227
                     | 
             modelse |  .0358453   .2062464
                     |  .0118599   .0571641
                     | 
             ciwidth |  .1151908   .7016128
                     |  .0464559   .2319229
                     | 
            relerror |  615.2475    1959.47
                     |   375.854   1016.232
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0053652   .0102631
                     |  .0029845   .0070301
                     | 
             pctbias |  .8047745   1.539461
                     |  .4476811   1.054516
                     | 
                mean |  .6720319   .6769298
                     |  .0029845   .0070301
                     | 
               empse |  .0059691   .0140602
                     |  .0024369   .0057401
                     | 
             relprec |            -81.97682
                     |             4.860895
                     | 
                 mse |  .0000555   .0002536
                     |  .0000467   .0001955
                     | 
                rmse |  .0074503   .0159248
                     |  .0031344   .0061388
                     | 
             modelse |  .0187521   .0989404
                     |  .0056693   .0317989
                     | 
             ciwidth |  .0610473   .3208171
                     |  .0236394   .1258247
                     | 
            relerror |  214.1532   603.6905
                     |  159.5918   365.6218
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
no                   |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0065123   .0167943
                     |  .0021497   .0069543
                     | 
             pctbias |  .9768382   2.519146
                     |  .3224486   1.043139
                     | 
                mean |  .6731789    .683461
                     |  .0021497   .0069543
                     | 
               empse |  .0042993   .0139085
                     |  .0017552   .0056781
                     | 
             relprec |            -90.44487
                     |             2.071074
                     | 
                 mse |  .0000563   .0004271
                     |  .0000294   .0002867
                     | 
                rmse |  .0075015   .0206672
                     |  .0019585   .0069356
                     | 
             modelse |  .0098025    .054184
                     |  .0028971   .0173822
                     | 
             ciwidth |   .031822   .1741174
                     |  .0124346   .0702275
                     | 
            relerror |  128.0024   289.5738
                     |  114.9132   202.2708
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.202416   .0295414
                     |  .0027332   .0089459
                     | 
             pctbias |  -30.3624   4.431204
                     |   .409987   1.341892
                     | 
                mean |  .4642507   .6962081
                     |  .0027332   .0089459
                     | 
               empse |  .0054665   .0178919
                     |  .0022317   .0073043
                     | 
             relprec |             -90.6652
                     |             8.262432
                     | 
                 mse |  .0409947   .0011128
                     |  .0011197   .0005112
                     | 
                rmse |  .2024714   .0333584
                     |   .002765   .0076619
                     | 
             modelse |  .0566576    .264235
                     |  .0097482   .0507181
                     | 
             ciwidth |  .2124183   .9770745
                     |  .0374349   .1984695
                     | 
            relerror |  936.4527   1376.842
                     |  459.1726   666.2324
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.6666667             |
weak                 |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1901655   .0231635
                     |  .0015594   .0113827
                     | 
             pctbias | -28.52483   3.474531
                     |  .2339059   1.707398
                     | 
                mean |  .4765011   .6898302
                     |  .0015594   .0113827
                     | 
               empse |  .0031187   .0227653
                     |  .0012732   .0092939
                     | 
             relprec |            -98.12322
                     |             .9531453
                     | 
                 mse |  .0361702   .0009252
                     |  .0005945   .0006685
                     | 
                rmse |  .1901847   .0304178
                     |   .001563    .010989
                     | 
             modelse |  .0289736   .0922674
                     |  .0053527   .0203551
                     | 
             ciwidth |   .107508   .3367786
                     |  .0211437    .076144
                     | 
            relerror |  829.0139   305.2984
                     |  416.2946   188.0757
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1843305   .0284127
                     |  .0029386   .0120814
                     | 
             pctbias | -27.64957   4.261907
                     |  .4407882    1.81221
                     | 
                mean |  .4823362   .6950794
                     |  .0029386   .0120814
                     | 
               empse |  .0058772   .0241628
                     |  .0023993   .0098644
                     | 
             relprec |             -94.0838
                     |             4.376205
                     | 
                 mse |  .0340036   .0012452
                     |  .0010753   .0009135
                     | 
                rmse |  .1844008   .0352869
                     |  .0029156   .0129441
                     | 
             modelse |  .0153613   .0485861
                     |  .0032243   .0132449
                     | 
             ciwidth |  .0563872   .1682704
                     |  .0121976   .0515032
                     | 
            relerror |  161.3717   101.0779
                     |  119.9817   98.70888
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1310104   .0107213
                     |  .0005186   .0083422
                     | 
             pctbias | -19.65156   1.608192
                     |  .0777953   1.251334
                     | 
                mean |  .5356563    .677388
                     |  .0005186   .0083422
                     | 
               empse |  .0010373   .0166844
                     |  .0004235   .0068114
                     | 
             relprec |            -99.61349
                     |             .3820528
                     | 
                 mse |  .0171645   .0003237
                     |  .0001355   .0003096
                     | 
                rmse |  .1310135   .0179923
                     |  .0005171   .0086028
                     | 
             modelse |  .0419986   .2052136
                     |   .010948   .0467231
                     | 
             ciwidth |  .1471875   .7384339
                     |  .0425806   .1842202
                     | 
            relerror |  3948.948    1129.97
                     |  1961.204   574.9432
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.125483   .0157029
                     |  .0021574   .0084582
                     | 
             pctbias | -18.82244    2.35544
                     |  .3236096   1.268735
                     | 
                mean |  .5411837   .6823696
                     |  .0021574   .0084582
                     | 
               empse |  .0043148   .0169165
                     |  .0017615   .0069061
                     | 
             relprec |             -93.4942
                     |              6.58717
                     | 
                 mse |  .0157599   .0004612
                     |  .0005422   .0003391
                     | 
                rmse |  .1255386   .0214757
                     |  .0021595    .007896
                     | 
             modelse |  .0221883   .0880991
                     |  .0056539   .0256517
                     | 
             ciwidth |  .0778027   .2976506
                     |  .0224475   .1011028
                     | 
            relerror |  414.2383   420.7889
                     |  247.4742   261.1463
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1202322    .014823
                     |  .0020515   .0096718
                     | 
             pctbias | -18.03483   2.223451
                     |  .3077262   1.450776
                     | 
                mean |  .5464345   .6814897
                     |  .0020515   .0096718
                     | 
               empse |   .004103   .0193437
                     |   .001675    .007897
                     | 
             relprec |            -95.50088
                     |             3.804135
                     | 
                 mse |  .0144684   .0005004
                     |  .0004953   .0004251
                     | 
                rmse |  .1202847   .0223686
                     |  .0020588   .0095023
                     | 
             modelse |  .0120648   .0490649
                     |  .0031783   .0157494
                     | 
             ciwidth |  .0418979   .1588838
                     |  .0126653   .0625755
                     | 
            relerror |  194.0483    153.648
                     |  142.8676   131.7267
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0789802   .0228564
                     |  .0056928   .0122318
                     | 
             pctbias | -11.84702    3.42846
                     |  .8539268   1.834775
                     | 
                mean |  .5876865   .6895231
                     |  .0056928   .0122318
                     | 
               empse |  .0113857   .0244637
                     |  .0046482   .0099872
                     | 
             relprec |            -78.33913
                     |             14.54391
                     | 
                 mse |  .0063351   .0009713
                     |  .0008578   .0007892
                     | 
                rmse |  .0795933   .0311652
                     |  .0053885   .0126623
                     | 
             modelse |  .0347647   .1969158
                     |   .009508    .058857
                     | 
             ciwidth |  .1179521   .6633276
                     |  .0394048   .2279029
                     | 
            relerror |  205.3367   704.9316
                     |    150.04   407.2703
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0804001    .011729
                     |  .0018621   .0079814
                     | 
             pctbias | -12.06002   1.759346
                     |    .27932   1.197216
                     | 
                mean |  .5862665   .6783956
                     |  .0018621   .0079814
                     | 
               empse |  .0037243   .0159629
                     |  .0015204   .0065168
                     | 
             relprec |            -94.55674
                     |             6.167929
                     | 
                 mse |  .0064746   .0003287
                     |  .0002951   .0002206
                     | 
                rmse |  .0804648   .0181295
                     |  .0018336   .0060845
                     | 
             modelse |  .0197906   .0936435
                     |   .005863   .0301273
                     | 
             ciwidth |  .0658218   .3014613
                     |  .0237049   .1209211
                     | 
            relerror |  431.3952   486.6329
                     |  268.0417   304.9206
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0780422   .0150987
                     |  .0014086    .007356
                     | 
             pctbias | -11.70633   2.264799
                     |  .2112838   1.103404
                     | 
                mean |  .5886245   .6817653
                     |  .0014086    .007356
                     | 
               empse |  .0028171   .0147121
                     |  .0011501   .0060062
                     | 
             relprec |             -96.3334
                     |               4.1837
                     | 
                 mse |  .0060965   .0003903
                     |  .0002179   .0002969
                     | 
                rmse |  .0780803   .0197561
                     |  .0013952   .0075135
                     | 
             modelse |  .0103889   .0502628
                     |  .0030028   .0156012
                     | 
             ciwidth |  .0343871   .1609793
                     |  .0125955   .0655876
                     | 
            relerror |  268.7767   241.6439
                     |  184.4658   175.2105
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0668014   .0139181
                     |  .0017713    .003471
                     | 
             pctbias | -10.02022   2.087718
                     |   .265702    .520647
                     | 
                mean |  .5998653   .6805848
                     |  .0017713    .003471
                     | 
               empse |  .0035427    .006942
                     |  .0014463    .002834
                     | 
             relprec |            -73.95628
                     |             29.04837
                     | 
                 mse |  .0044718   .0002299
                     |  .0002403   .0000867
                     | 
                rmse |  .0668719    .015161
                     |  .0017964   .0028604
                     | 
             modelse |  .0381192   .1902515
                     |  .0124794   .0529474
                     | 
             ciwidth |  .1222514   .6449639
                     |  .0496062   .2161774
                     | 
            relerror |  975.9955   2640.603
                     |  563.0686   1354.087
                     | 
               cover |        50        100
                     |        25          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0602397   .0199618
                     |  .0028635   .0071191
                     | 
             pctbias | -9.035957   2.994271
                     |  .4295293   1.067862
                     | 
                mean |   .606427   .6866285
                     |  .0028635   .0071191
                     | 
               empse |  .0057271   .0142382
                     |  .0023381   .0058127
                     | 
             relprec |            -83.82087
                     |             15.97923
                     | 
                 mse |  .0036534   .0005505
                     |  .0003321   .0002918
                     | 
                rmse |  .0604436   .0234631
                     |  .0027474   .0062189
                     | 
             modelse |  .0194843   .0996363
                     |  .0059973   .0335268
                     | 
             ciwidth |  .0629693   .3121196
                     |  .0249555   .1355534
                     | 
            relerror |  240.2149   599.7835
                     |  173.9453   370.2202
                     | 
               cover |        25         75
                     |  21.65063   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
weak                 |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0595598   .0184753
                     |  .0025808   .0083999
                     | 
             pctbias | -8.933967   2.771301
                     |  .3871162    1.25998
                     | 
                mean |  .6071069    .685142
                     |  .0025808   .0083999
                     | 
               empse |  .0051615   .0167997
                     |  .0021072   .0068585
                     | 
             relprec |            -90.56036
                     |             10.57175
                     | 
                 mse |  .0035673    .000553
                     |  .0002994   .0003103
                     | 
                rmse |  .0597273   .0235162
                     |  .0025064   .0065982
                     | 
             modelse |  .0106986   .0568864
                     |  .0033009   .0196416
                     | 
             ciwidth |  .0343321   .1751235
                     |  .0139056   .0797008
                     | 
            relerror |  107.2758    238.615
                     |  106.0678   181.0509
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2506711  -.0045121
                     |  .0027025   .0064772
                     | 
             pctbias | -37.60067  -.6768085
                     |  .4053824   .9715763
                     | 
                mean |  .4159955   .6621546
                     |  .0027025   .0064772
                     | 
               empse |  .0054051   .0129544
                     |  .0022066   .0052886
                     | 
             relprec |            -82.59091
                     |             8.982574
                     | 
                 mse |  .0628579   .0001462
                     |  .0013551   .0000772
                     | 
                rmse |  .2507149   .0120921
                     |  .0027024    .003193
                     | 
             modelse |  .0543078   .2028341
                     |  .0087037   .0411289
                     | 
             ciwidth |  .2045152   .7420592
                     |  .0341202   .1648479
                     | 
            relerror |  904.7514   1465.761
                     |   440.663   713.7239
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2409506  -.0009814
                     |  .0029027   .0092651
                     | 
             pctbias |  -36.1426  -.1472041
                     |  .4354022   1.389762
                     | 
                mean |   .425716   .6656853
                     |  .0029027   .0092651
                     | 
               empse |  .0058054   .0185302
                     |    .00237   .0075649
                     | 
             relprec |            -90.18477
                     |             7.050734
                     | 
                 mse |  .0580825   .0002585
                     |  .0013994   .0001013
                     | 
                rmse |  .2410031   .0160776
                     |  .0029032    .003149
                     | 
             modelse |   .030026   .0789515
                     |  .0054573    .020798
                     | 
             ciwidth |  .1119543   .2745824
                     |   .020972   .0824316
                     | 
            relerror |  417.2115   326.0701
                     |  231.1311   207.0108
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2344211    .001201
                     |   .003054   .0112369
                     | 
             pctbias | -35.16317   .1801483
                     |  .4580972    1.68554
                     | 
                mean |  .4322456   .6678677
                     |   .003054   .0112369
                     | 
               empse |   .006108   .0224739
                     |  .0024936   .0091749
                     | 
             relprec |            -92.61353
                     |             5.861673
                     | 
                 mse |  .0549813   .0003802
                     |    .00142   .0002313
                     | 
                rmse |  .2344808      .0195
                     |   .003028     .00593
                     | 
             modelse |  .0161334     .03942
                     |  .0033872   .0114021
                     | 
             ciwidth |  .0591517   .1342517
                     |  .0129176   .0441738
                     | 
            relerror |  164.1372   75.40361
                     |  121.2576   87.75974
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.172078  -.0024346
                     |  .0027565   .0076055
                     | 
             pctbias | -25.81171  -.3651917
                     |  .4134798   1.140826
                     | 
                mean |  .4945886   .6642321
                     |  .0027565   .0076055
                     | 
               empse |  .0055131    .015211
                     |  .0022507   .0062099
                     | 
             relprec |            -86.86378
                     |             10.14754
                     | 
                 mse |  .0296336   .0001795
                     |    .00095     .00008
                     | 
                rmse |  .1721443   .0133962
                     |  .0027593   .0029862
                     | 
             modelse |  .0442928   .1885087
                     |  .0104258   .0504411
                     | 
             ciwidth |  .1581195    .647211
                     |  .0414077   .2058729
                     | 
            relerror |  703.4161   1139.291
                     |  378.6058   604.9285
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1641054   .0027901
                     |  .0019617   .0107511
                     | 
             pctbias | -24.61581   .4185095
                     |  .2942533   1.612668
                     | 
                mean |  .5025613   .6694567
                     |  .0019617   .0107511
                     | 
               empse |  .0039234   .0215022
                     |  .0016017   .0087783
                     | 
             relprec |             -96.6707
                     |             2.976892
                     | 
                 mse |  .0269421   .0003545
                     |  .0006473   .0002169
                     | 
                rmse |  .1641406   .0188293
                     |  .0019719   .0057607
                     | 
             modelse |  .0230318   .0829451
                     |  .0057904   .0277289
                     | 
             ciwidth |  .0809301   .2657962
                     |  .0231036   .1081166
                     | 
            relerror |    487.04   285.7509
                     |  281.4571   203.5457
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1580166   .0031659
                     |  .0014059   .0128763
                     | 
             pctbias | -23.70249   .4748829
                     |  .2108798    1.93145
                     | 
                mean |  .5086501   .6698326
                     |  .0014059   .0128763
                     | 
               empse |  .0028117   .0257527
                     |  .0011479   .0105135
                     | 
             relprec |            -98.80792
                     |             1.183004
                     | 
                 mse |  .0249752   .0005074
                     |  .0004422   .0004105
                     | 
                rmse |  .1580353    .022526
                     |  .0013992   .0091118
                     | 
             modelse |  .0124866   .0481117
                     |  .0035273   .0173689
                     | 
             ciwidth |   .043034   .1486677
                     |  .0134642    .066997
                     | 
            relerror |  344.0904   86.82227
                     |  220.4699   101.8131
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1123813   .0097572
                     |  .0018728   .0085734
                     | 
             pctbias | -16.85719   1.463576
                     |  .2809125   1.286014
                     | 
                mean |  .5542854   .6764238
                     |  .0018728   .0085734
                     | 
               empse |  .0037455   .0171469
                     |  .0015291   .0070002
                     | 
             relprec |            -95.22855
                     |             2.380916
                     | 
                 mse |  .0126401   .0003157
                     |  .0004181   .0002765
                     | 
                rmse |  .1124281   .0177683
                     |  .0018594   .0077805
                     | 
             modelse |  .0375717   .1859418
                     |  .0113586     .05602
                     | 
             ciwidth |  .1249312   .6112735
                     |  .0450298   .2292078
                     | 
            relerror |  903.1146   984.4075
                     |  509.5806   550.2068
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1048145    .015001
                     |  .0016633   .0078557
                     | 
             pctbias | -15.72218   2.250152
                     |  .2494883   1.178354
                     | 
                mean |  .5618522   .6816677
                     |  .0016633   .0078557
                     | 
               empse |  .0033265   .0157114
                     |   .001358   .0064141
                     | 
             relprec |             -95.5172
                     |             4.457277
                     | 
                 mse |  .0109944   .0004102
                     |  .0003474   .0003453
                     | 
                rmse |  .1048541   .0202526
                     |  .0016566   .0085237
                     | 
             modelse |  .0203915   .0893045
                     |  .0058147   .0291582
                     | 
             ciwidth |  .0682768   .2834974
                     |  .0239972   .1185696
                     | 
            relerror |  512.9991   468.4061
                     |  305.2585    297.136
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1014501   .0174165
                     |  .0022675   .0099491
                     | 
             pctbias | -15.21751   2.612478
                     |  .3401225   1.492359
                     | 
                mean |  .5652167   .6840832
                     |  .0022675   .0099491
                     | 
               empse |   .004535   .0198981
                     |  .0018514   .0081234
                     | 
             relprec |            -94.80573
                     |             5.906548
                     | 
                 mse |  .0103075   .0006003
                     |  .0004599   .0005001
                     | 
                rmse |   .101526   .0245007
                     |  .0022648   .0102054
                     | 
             modelse |  .0112849   .0541092
                     |   .003536   .0189874
                     | 
             ciwidth |  .0368925   .1656535
                     |  .0140922   .0764791
                     | 
            relerror |  148.8423   171.9314
                     |  128.0632   146.3899
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0893927   .0137189
                     |   .001668   .0073946
                     | 
             pctbias |  -13.4089    2.05784
                     |  .2502044   1.109185
                     | 
                mean |   .577274   .6803856
                     |   .001668   .0073946
                     | 
               empse |  .0033361   .0147891
                     |  .0013619   .0060376
                     | 
             relprec |             -94.9116
                     |             4.441133
                     | 
                 mse |  .0079994   .0003522
                     |  .0003026   .0002338
                     | 
                rmse |  .0894393   .0187683
                     |  .0016916   .0062286
                     | 
             modelse |  .0360864   .1956813
                     |  .0107791   .0611328
                     | 
             ciwidth |  .1181885   .6325325
                     |   .044875   .2505187
                     | 
            relerror |  981.7075   1223.142
                     |  547.1885   680.1862
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0822415   .0222184
                     |  .0021711    .008456
                     | 
             pctbias | -12.33623   3.332761
                     |  .3256663   1.268397
                     | 
                mean |  .5844252   .6888851
                     |  .0021711    .008456
                     | 
               empse |  .0043422    .016912
                     |  .0017727   .0069043
                     | 
             relprec |            -93.40773
                     |             6.654604
                     | 
                 mse |  .0067778   .0007082
                     |  .0003583   .0004297
                     | 
                rmse |  .0823274   .0266114
                     |  .0021759    .008073
                     | 
             modelse |  .0199547   .0941064
                     |  .0060608   .0308587
                     | 
             ciwidth |  .0648619   .2951816
                     |  .0252418   .1277339
                     | 
            relerror |  359.5502   456.4487
                     |  233.8366   291.3761
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
moderate             |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0802022   .0193781
                     |  .0014303   .0097463
                     | 
             pctbias | -12.03032   2.906721
                     |  .2145496   1.461939
                     | 
                mean |  .5864645   .6860448
                     |  .0014303   .0097463
                     | 
               empse |  .0028607   .0194925
                     |  .0011679   .0079578
                     | 
             relprec |            -97.84624
                     |             2.017239
                     | 
                 mse |  .0064385   .0006605
                     |    .00023   .0005136
                     | 
                rmse |  .0802404   .0256998
                     |  .0014332    .009993
                     | 
             modelse |  .0108453   .0529183
                     |  .0033571   .0182776
                     | 
             ciwidth |   .035092   .1627363
                     |   .013855   .0742664
                     | 
            relerror |  279.1183   171.4798
                     |  194.2343   145.1751
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2960292  -.0542594
                     |  .0024111   .0037779
                     | 
             pctbias | -44.40438  -8.138917
                     |  .3616695   .5666788
                     | 
                mean |  .3706375   .6124072
                     |  .0024111   .0037779
                     | 
               empse |  .0048223   .0075557
                     |  .0019687   .0030846
                     | 
             relprec |            -59.26667
                     |             46.95397
                     | 
                 mse |  .0876507   .0029869
                     |   .001427   .0004198
                     | 
                rmse |  .2960587   .0546526
                     |  .0024099   .0038405
                     | 
             modelse |  .0573192   .1468192
                     |   .010234   .0367409
                     | 
             ciwidth |  .2135077   .5195262
                     |  .0404094   .1429643
                     | 
            relerror |  1088.637   1843.153
                     |  529.6375   930.4634
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2836063  -.0378994
                     |   .001737   .0046515
                     | 
             pctbias | -42.54094  -5.684915
                     |  .2605517   .6977309
                     | 
                mean |  .3830604   .6287673
                     |   .001737   .0046515
                     | 
               empse |   .003474   .0093031
                     |  .0014183    .003798
                     | 
             relprec |            -86.05521
                     |             6.199282
                     | 
                 mse |  .0804416   .0015013
                     |  .0009869   .0003685
                     | 
                rmse |  .2836222   .0387463
                     |  .0017399   .0047551
                     | 
             modelse |  .0305793   .0657162
                     |  .0060669   .0222947
                     | 
             ciwidth |  .1132536   .2124721
                     |  .0226723   .0840928
                     | 
            relerror |  780.2272    606.392
                     |  399.5388   374.9622
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2761679   -.033919
                     |  .0014294   .0096494
                     | 
             pctbias | -41.42518  -5.087853
                     |  .2144026   1.447416
                     | 
                mean |  .3904988   .6327477
                     |  .0014294   .0096494
                     | 
               empse |  .0028587   .0192989
                     |  .0011671   .0078787
                     | 
             relprec |            -97.80582
                     |             1.754967
                     | 
                 mse |  .0762748   .0014298
                     |  .0007931   .0007438
                     | 
                rmse |   .276179   .0378132
                     |  .0014359    .009835
                     | 
             modelse |  .0164918   .0351889
                     |  .0030054   .0123342
                     | 
             ciwidth |  .0614735   .1124393
                     |  .0115501   .0461312
                     | 
            relerror |  476.8992   82.33624
                     |  257.9176   98.11111
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2072157  -.0136585
                     |  .0025089   .0096389
                     | 
             pctbias | -31.08236  -2.048781
                     |   .376332   1.445834
                     | 
                mean |   .459451   .6530082
                     |  .0025089   .0096389
                     | 
               empse |  .0050178   .0192778
                     |  .0020485   .0078701
                     | 
             relprec |            -93.22506
                     |             6.928863
                     | 
                 mse |  .0429572   .0004653
                     |  .0010315   .0002424
                     | 
                rmse |  .2072613   .0215704
                     |  .0024884   .0056193
                     | 
             modelse |  .0433741   .1750659
                     |  .0105609   .0601997
                     | 
             ciwidth |  .1546803   .5573696
                     |  .0407513   .2311367
                     | 
            relerror |  764.4124   808.1226
                     |  410.8925   484.7303
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1976059  -.0116966
                     |  .0017897   .0124883
                     | 
             pctbias | -29.64089  -1.754493
                     |  .2684477    1.87325
                     | 
                mean |  .4690607     .65497
                     |  .0017897   .0124883
                     | 
               empse |  .0035793   .0249767
                     |  .0014612   .0101967
                     | 
             relprec |            -97.94634
                     |             1.010798
                     | 
                 mse |  .0390577   .0006047
                     |  .0007074   .0001714
                     | 
                rmse |  .1976303   .0245904
                     |  .0017897   .0034854
                     | 
             modelse |  .0241389   .0772049
                     |  .0065876   .0279108
                     | 
             ciwidth |  .0838675   .2378946
                     |  .0252963   .1080058
                     | 
            relerror |  574.4029   209.1082
                     |   331.175   168.5592
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1913945  -.0091033
                     |  .0013061   .0137875
                     | 
             pctbias | -28.70918  -1.365492
                     |  .1959091    2.06813
                     | 
                mean |  .4752722   .6575634
                     |  .0013061   .0137875
                     | 
               empse |  .0026121   .0275751
                     |  .0010664   .0112575
                     | 
             relprec |            -99.10267
                     |             .4297986
                     | 
                 mse |   .036637   .0006532
                     |  .0005011   .0001658
                     | 
                rmse |  .1914079    .025557
                     |  .0013091   .0032442
                     | 
             modelse |  .0130068   .0428798
                     |  .0033311   .0149205
                     | 
             ciwidth |   .045428   .1324771
                     |  .0133646    .059729
                     | 
            relerror |  397.9401   55.50212
                     |  239.9713   83.41412
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1397815   .0069241
                     |  .0038339   .0121115
                     | 
             pctbias | -20.96723   1.038614
                     |  .5750799   1.816721
                     | 
                mean |  .5268852   .6735908
                     |  .0038339   .0121115
                     | 
               empse |  .0076677   .0242229
                     |  .0031303    .009889
                     | 
             relprec |            -89.97971
                     |             11.46337
                     | 
                 mse |   .019583    .000488
                     |  .0010495   .0004068
                     | 
                rmse |  .1399392   .0220909
                     |  .0037498   .0092067
                     | 
             modelse |  .0375184   .1810259
                     |   .011893   .0533854
                     | 
             ciwidth |  .1238078   .5877746
                     |  .0458298   .2295394
                     | 
            relerror |   389.303   647.3322
                     |  252.9036   376.3733
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1311521   .0126562
                     |  .0021427   .0129522
                     | 
             pctbias | -19.67281    1.89843
                     |  .3213976   1.942835
                     | 
                mean |  .5355146   .6793229
                     |  .0021427   .0129522
                     | 
               empse |  .0042853   .0259045
                     |  .0017495   .0105755
                     | 
             relprec |            -97.26339
                     |             3.038562
                     | 
                 mse |  .0172146   .0006635
                     |  .0005557   .0006091
                     | 
                rmse |  .1312046   .0257577
                     |  .0021176   .0118235
                     | 
             modelse |  .0215078   .0869733
                     |  .0068415   .0293229
                     | 
             ciwidth |  .0708565   .2697357
                     |  .0263777   .1203816
                     | 
            relerror |  401.8961   235.7462
                     |  259.7524   177.7665
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1281734   .0120848
                     |  .0007733   .0146235
                     | 
             pctbias | -19.22601   1.812719
                     |  .1159954   2.193521
                     | 
                mean |  .5384933   .6787515
                     |  .0007733   .0146235
                     | 
               empse |  .0015466    .029247
                     |  .0006314     .01194
                     | 
             relprec |            -99.72036
                     |              .220433
                     | 
                 mse |  .0164302   .0007876
                     |  .0001986   .0007507
                     | 
                rmse |  .1281804   .0280639
                     |  .0007745   .0133747
                     | 
             modelse |  .0105073   .0509225
                     |  .0032334   .0186498
                     | 
             ciwidth |  .0346648   .1535463
                     |  .0128425   .0736405
                     | 
            relerror |  579.3782   74.11227
                     |  347.3232   95.49196
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1098572   .0162943
                     |  .0033553   .0110861
                     | 
             pctbias | -16.47857   2.444147
                     |  .5032893   1.662922
                     | 
                mean |  .5568095    .682961
                     |  .0033553   .0110861
                     | 
               empse |  .0067105   .0221723
                     |  .0027396   .0090518
                     | 
             relprec |            -90.84008
                     |              9.98138
                     | 
                 mse |  .0121024   .0006342
                     |  .0007232   .0005499
                     | 
                rmse |  .1100108   .0251836
                     |  .0032868   .0109176
                     | 
             modelse |  .0365641   .1788421
                     |  .0116468   .0591189
                     | 
             ciwidth |  .1186898   .5603464
                     |   .046389   .2432284
                     | 
            relerror |  444.8767   706.6017
                     |  282.1435   423.7076
                     | 
               cover |        25         75
                     |  21.65063   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1032501   .0245726
                     |  .0029443    .013178
                     | 
             pctbias | -15.48752   3.685883
                     |  .4416409   1.976701
                     | 
                mean |  .5634166   .6912392
                     |  .0029443    .013178
                     | 
               empse |  .0058885    .026356
                     |   .002404   .0107598
                     | 
             relprec |            -95.00821
                     |             5.718401
                     | 
                 mse |  .0106866   .0011248
                     |  .0005947   .0007321
                     | 
                rmse |   .103376   .0335379
                     |  .0028765    .010914
                     | 
             modelse |  .0192351   .0972982
                     |  .0056557   .0337942
                     | 
             ciwidth |  .0632561   .2979257
                     |  .0236913   .1374866
                     | 
            relerror |  226.6522   269.1688
                     |  164.3427   197.8765
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.6666667             |
strong               |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1005285   .0211052
                     |  .0015023   .0145424
                     | 
             pctbias | -15.07928    3.16578
                     |  .2253512   2.181366
                     | 
                mean |  .5661381   .6877719
                     |  .0015023   .0145424
                     | 
               empse |  .0030047   .0290849
                     |  .0012267   .0118739
                     | 
             relprec |            -98.93276
                     |             1.225645
                     | 
                 mse |  .0101128   .0010799
                     |  .0002976   .0009138
                     | 
                rmse |  .1005622   .0328615
                     |  .0014798   .0139045
                     | 
             modelse |  .0109436   .0568311
                     |  .0034231   .0210723
                     | 
             ciwidth |  .0353147   .1698593
                     |  .0140609   .0832185
                     | 
            relerror |  264.2189   95.39731
                     |  187.3184   107.7614
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0079681   .0350732
                     |  .0020908   .0068735
                     | 
             pctbias |  1.062409   4.676422
                     |  .2787772   .9164708
                     | 
                mean |  .7579681   .7850732
                     |  .0020908   .0068735
                     | 
               empse |  .0041817   .0137471
                     |  .0017072   .0056122
                     | 
             relprec |            -90.74712
                     |             7.072717
                     | 
                 mse |  .0000766   .0013719
                     |  .0000314   .0005526
                     | 
                rmse |  .0087524   .0370387
                     |  .0017956   .0074603
                     | 
             modelse |  .0557929   .3704284
                     |   .011881   .0583126
                     | 
             ciwidth |   .203663   1.404071
                     |  .0460177   .2137287
                     | 
            relerror |  1234.229     2594.6
                     |  614.3454   1179.015
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.75                  |
no                   |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0065112   .0308183
                     |  .0022797   .0064163
                     | 
             pctbias |  .8681595     4.1091
                     |  .3039555   .8555071
                     | 
                mean |  .7565112   .7808182
                     |  .0022797   .0064163
                     | 
               empse |  .0045593   .0128326
                     |  .0018613   .0052389
                     | 
             relprec |             -87.3767
                     |             2.406091
                     | 
                 mse |   .000058   .0010733
                     |  .0000329   .0004356
                     | 
                rmse |  .0076149   .0327608
                     |  .0021604   .0066478
                     | 
             modelse |  .0291581   .1296627
                     |  .0068076   .0218461
                     | 
             ciwidth |  .1038655   .4873208
                     |  .0275435   .0833773
                     | 
            relerror |  539.5263    910.416
                     |  300.7654   446.2488
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0072058   .0310687
                     |  .0008913    .003415
                     | 
             pctbias |  .9607772   4.142493
                     |  .1188348   .4553277
                     | 
                mean |  .7572058   .7810687
                     |  .0008913    .003415
                     | 
               empse |  .0017825   .0068299
                     |  .0007277   .0027883
                     | 
             relprec |            -93.18855
                     |             7.330318
                     | 
                 mse |  .0000543   .0010002
                     |  .0000119   .0002179
                     | 
                rmse |  .0073693   .0316267
                     |  .0008042   .0034456
                     | 
             modelse |  .0148142   .0613097
                     |  .0035124   .0120983
                     | 
             ciwidth |   .053142   .2264171
                     |   .013517   .0465244
                     | 
            relerror |   731.082   797.6638
                     |  392.3577   407.0353
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0046154   .0170715
                     |  .0024822   .0051654
                     | 
             pctbias |  .6153822   2.276204
                     |  .3309539   .6887172
                     | 
                mean |  .7546154   .7670715
                     |  .0024822   .0051654
                     | 
               empse |  .0049643   .0103308
                     |  .0020267   .0042175
                     | 
             relprec |            -76.90845
                     |             22.37316
                     | 
                 mse |  .0000398   .0003715
                     |  .0000145   .0002261
                     | 
                rmse |  .0063075   .0192738
                     |  .0011504   .0058655
                     | 
             modelse |  .0437996   .2535026
                     |  .0116367   .0586608
                     | 
             ciwidth |  .1507977   .9181318
                     |  .0473919   .2194671
                     | 
            relerror |  782.2903   2353.863
                     |  429.7516   1151.521
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0033455   .0188783
                     |  .0007711    .003995
                     | 
             pctbias |  .4460692   2.517106
                     |  .1028164   .5326683
                     | 
                mean |  .7533455   .7688783
                     |  .0007711    .003995
                     | 
               empse |  .0015422     .00799
                     |  .0006296   .0032619
                     | 
             relprec |            -96.27428
                     |             4.195987
                     | 
                 mse |   .000013   .0004043
                     |  4.71e-06   .0001688
                     | 
                rmse |  .0036023   .0201065
                     |  .0006531   .0041966
                     | 
             modelse |  .0226614   .1063039
                     |  .0062992   .0278328
                     | 
             ciwidth |  .0773049   .3734632
                     |  .0252648   .1067196
                     | 
            relerror |  1369.379   1230.458
                     |  725.7207   645.2625
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |   .006599   .0190444
                     |  .0014709   .0025895
                     | 
             pctbias |  .8798659   2.539247
                     |   .196124   .3452665
                     | 
                mean |   .756599   .7690443
                     |  .0014709   .0025895
                     | 
               empse |  .0029419    .005179
                     |   .001201   .0021143
                     | 
             relprec |            -67.73344
                     |             7.441112
                     | 
                 mse |    .00005   .0003828
                     |  .0000198   .0000929
                     | 
                rmse |  .0070737   .0195654
                     |  .0014019   .0023749
                     | 
             modelse |  .0115897   .0567928
                     |  .0033985   .0172679
                     | 
             ciwidth |  .0392245   .1907738
                     |  .0132339   .0662485
                     | 
            relerror |  293.9595   996.5975
                     |  198.0221   558.2039
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0040081   .0152475
                     |   .002718   .0033831
                     | 
             pctbias |  .5344133   2.032995
                     |  .3623989   .4510833
                     | 
                mean |  .7540081   .7652475
                     |   .002718   .0033831
                     | 
               empse |   .005436   .0067662
                     |  .0022192   .0027623
                     | 
             relprec |            -35.45534
                     |              52.0661
                     | 
                 mse |  .0000382   .0002668
                     |  .0000354   .0000945
                     | 
                rmse |  .0061828   .0163347
                     |  .0028613   .0028926
                     | 
             modelse |  .0379675   .2193014
                     |  .0115331   .0647024
                     | 
             ciwidth |  .1254342   .7508261
                     |  .0462479    .241696
                     | 
            relerror |   598.448   3141.107
                     |  355.4116   1632.548
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0042891   .0126403
                     |  .0015276   .0021564
                     | 
             pctbias |  .5718808   1.685375
                     |  .2036774   .2875261
                     | 
                mean |  .7542891   .7626403
                     |  .0015276   .0021564
                     | 
               empse |  .0030552   .0043129
                     |  .0012473   .0017607
                     | 
             relprec |            -49.81994
                     |             6.349419
                     | 
                 mse |  .0000254   .0001737
                     |    .00001   .0000473
                     | 
                rmse |  .0050395   .0131806
                     |  .0009964   .0017928
                     | 
             modelse |  .0197967   .1013801
                     |  .0060674   .0332946
                     | 
             ciwidth |   .064613   .3286685
                     |  .0248136   .1289781
                     | 
            relerror |  547.9741    2250.63
                     |  330.7852    1231.61
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0022954   .0099871
                     |  .0009067   .0025424
                     | 
             pctbias |  .3060579   1.331612
                     |  .1208901    .338992
                     | 
                mean |  .7522954   .7599871
                     |  .0009067   .0025424
                     | 
               empse |  .0018134   .0050849
                     |  .0007403   .0020759
                     | 
             relprec |            -87.28247
                     |             5.054417
                     | 
                 mse |  7.74e-06   .0001191
                     |  4.60e-06   .0000525
                     | 
                rmse |  .0027812   .0109148
                     |  .0008267   .0024064
                     | 
             modelse |  .0108301   .0553165
                     |  .0034171   .0176913
                     | 
             ciwidth |  .0350146   .1774258
                     |  .0138592   .0719682
                     | 
            relerror |  497.2395   987.8627
                     |   308.154   564.1707
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0071423   .0117615
                     |  .0025371   .0035051
                     | 
             pctbias |  .9523034   1.568198
                     |   .338286   .4673509
                     | 
                mean |  .7571423   .7617615
                     |  .0025371   .0035051
                     | 
               empse |  .0050743   .0070103
                     |  .0020716   .0028619
                     | 
             relprec |            -47.60596
                     |             53.16092
                     | 
                 mse |  .0000703   .0001752
                     |  .0000418   .0000872
                     | 
                rmse |  .0083859    .013236
                     |  .0024929   .0032958
                     | 
             modelse |  .0358592   .1973581
                     |  .0114372   .0551595
                     | 
             ciwidth |  .1155153   .6699032
                     |  .0462415   .2234071
                     | 
            relerror |  606.6835   2715.273
                     |  366.1102   1392.867
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0031995   .0085216
                     |  .0006771   .0024975
                     | 
             pctbias |  .4265944    1.13622
                     |  .0902865   .3330028
                     | 
                mean |  .7531995   .7585217
                     |  .0006771   .0024975
                     | 
               empse |  .0013543    .004995
                     |  .0005529   .0020392
                     | 
             relprec |            -92.64895
                     |             3.368405
                     | 
                 mse |  .0000116   .0000913
                     |  4.65e-06   .0000536
                     | 
                rmse |  .0034077   .0095567
                     |  .0006829   .0028045
                     | 
             modelse |  .0200108   .1008408
                     |  .0064567   .0328516
                     | 
             ciwidth |  .0638779   .3219757
                     |  .0262844   .1323942
                     | 
            relerror |   1377.58   1918.817
                     |  768.8784   1054.428
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
no                   |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0024861   .0079003
                     |    .00129   .0036689
                     | 
             pctbias |  .3314833   1.053377
                     |  .1719986   .4891908
                     | 
                mean |  .7524861   .7579004
                     |    .00129   .0036689
                     | 
               empse |    .00258   .0073379
                     |  .0010533   .0029957
                     | 
             relprec |            -87.63787
                     |             7.886221
                     | 
                 mse |  .0000112   .0001028
                     |  5.16e-06    .000071
                     | 
                rmse |  .0033426    .010139
                     |  .0007712   .0034994
                     | 
             modelse |  .0108591   .0582359
                     |  .0035503   .0197129
                     | 
             ciwidth |  .0344561   .1831336
                     |  .0144305   .0786852
                     | 
            relerror |  320.8985   693.6357
                     |  220.1428   420.8884
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2206593   .0233774
                     |  .0041815    .004482
                     | 
             pctbias | -29.42124   3.116989
                     |  .5575361   .5975972
                     | 
                mean |  .5293407   .7733774
                     |  .0041815    .004482
                     | 
               empse |   .008363    .008964
                     |  .0034142   .0036595
                     | 
             relprec |            -12.95799
                     |             76.19517
                     | 
                 mse |   .048743   .0006068
                     |  .0018416   .0002451
                     | 
                rmse |  .2207781   .0246327
                     |  .0041708    .004976
                     | 
             modelse |  .0570822   .2488987
                     |  .0106074   .0376741
                     | 
             ciwidth |  .2113285   .9419717
                     |   .042458   .1467558
                     | 
            relerror |  582.5536   2676.661
                     |  306.1601   1208.972
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2119835   .0188493
                     |  .0030571   .0117968
                     | 
             pctbias | -28.26446   2.513238
                     |  .4076081   1.572909
                     | 
                mean |  .5380166   .7688493
                     |  .0030571   .0117968
                     | 
               empse |  .0061141   .0235936
                     |  .0024961   .0096321
                     | 
             relprec |             -93.2845
                     |             5.051341
                     | 
                 mse |   .044965   .0007728
                     |   .001281   .0006672
                     | 
                rmse |  .2120496   .0277991
                     |  .0030205   .0119999
                     | 
             modelse |   .031122   .0951379
                     |  .0064895   .0245243
                     | 
             ciwidth |  .1138644   .3363164
                     |  .0252847   .0930426
                     | 
            relerror |  409.0186   303.2354
                     |  233.3433   194.6901
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2054068   .0212873
                     |   .001636   .0158392
                     | 
             pctbias | -27.38757   2.838312
                     |  .2181291   2.111895
                     | 
                mean |  .5445932   .7712873
                     |   .001636   .0158392
                     | 
               empse |  .0032719   .0316784
                     |  .0013358   .0129327
                     | 
             relprec |             -98.9332
                     |             .5258248
                     | 
                 mse |     .0422   .0012058
                     |  .0006703   .0010371
                     | 
                rmse |  .2054263   .0347245
                     |  .0016315   .0149333
                     | 
             modelse |  .0162591   .0487938
                     |  .0035159   .0130966
                     | 
             ciwidth |  .0592094   .1693696
                     |   .013618   .0513076
                     | 
            relerror |  396.9267   54.02834
                     |  229.5705   75.25497
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1496292   .0017182
                     |  .0034221   .0086557
                     | 
             pctbias | -19.95055   .2290964
                     |  .4562767   1.154097
                     | 
                mean |  .6003708   .7517182
                     |  .0034221   .0086557
                     | 
               empse |  .0068441   .0173114
                     |  .0027941   .0070674
                     | 
             relprec |            -84.36952
                     |              17.9218
                     | 
                 mse |   .022424   .0002277
                     |  .0010011   .0001511
                     | 
                rmse |  .1497465   .0150903
                     |  .0033428   .0050066
                     | 
             modelse |  .0452893   .2068946
                     |  .0123212   .0510383
                     | 
             ciwidth |  .1575303   .7409815
                     |   .047263   .1903389
                     | 
            relerror |  561.7225   1095.132
                     |  324.6362   570.0683
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1380663   .0110644
                     |  .0026687   .0095935
                     | 
             pctbias | -18.40883   1.475255
                     |  .3558209   1.279135
                     | 
                mean |  .6119337   .7610644
                     |  .0026687   .0095935
                     | 
               empse |  .0053373    .019187
                     |  .0021789   .0078331
                     | 
             relprec |            -92.26198
                     |             7.433784
                     | 
                 mse |  .0190837   .0003985
                     |  .0007373   .0003781
                     | 
                rmse |  .1381436   .0199632
                     |  .0026685   .0094696
                     | 
             modelse |  .0237444   .0929661
                     |  .0068496    .029234
                     | 
             ciwidth |  .0809073   .3065841
                     |  .0265656   .1137372
                     | 
            relerror |   344.875   384.5258
                     |  222.3856    249.684
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1337712    .012718
                     |  .0023669   .0122407
                     | 
             pctbias | -17.83616   1.695728
                     |   .315587     1.6321
                     | 
                mean |  .6162288    .762718
                     |  .0023669   .0122407
                     | 
               empse |  .0047338   .0244815
                     |  .0019326   .0099945
                     | 
             relprec |            -96.26109
                     |             4.223072
                     | 
                 mse |  .0179115   .0006113
                     |  .0006258   .0005881
                     | 
                rmse |   .133834   .0247236
                     |  .0023381    .011894
                     | 
             modelse |  .0125197   .0498932
                     |  .0035506   .0161877
                     | 
             ciwidth |  .0427236    .161802
                     |  .0139424   .0634316
                     | 
            relerror |  164.4738   103.7995
                     |  131.4665   106.2757
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0943852   .0084102
                     |  .0021701   .0092377
                     | 
             pctbias | -12.58469   1.121358
                     |   .289352   1.231697
                     | 
                mean |  .6556148   .7584102
                     |  .0021701   .0092377
                     | 
               empse |  .0043403   .0184755
                     |  .0017719   .0075426
                     | 
             relprec |            -94.48119
                     |             4.928472
                     | 
                 mse |  .0089227   .0003267
                     |  .0004129   .0002803
                     | 
                rmse |    .09446   .0180759
                     |  .0021855   .0077534
                     | 
             modelse |   .039085   .2000194
                     |  .0117769   .0587903
                     | 
             ciwidth |  .1288654   .6708274
                     |  .0478438   .2343382
                     | 
            relerror |  800.5168   982.6222
                     |  456.9242   544.6111
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0915833   .0067774
                     |  .0016383   .0102291
                     | 
             pctbias | -12.21111   .9036521
                     |  .2184437   1.363874
                     | 
                mean |  .6584167   .7567774
                     |  .0016383   .0102291
                     | 
               empse |  .0032767   .0204581
                     |  .0013377    .008352
                     | 
             relprec |            -97.43475
                     |             2.950839
                     | 
                 mse |  .0083956   .0003598
                     |   .000299   .0002967
                     | 
                rmse |  .0916272   .0189693
                     |  .0016315   .0078203
                     | 
             modelse |   .022578   .0997346
                     |  .0070692    .032046
                     | 
             ciwidth |  .0732013   .3195392
                     |  .0287203   .1300493
                     | 
            relerror |   589.057   387.5062
                     |  354.5128   253.2726
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0850126   .0177021
                     |   .002012   .0084814
                     | 
             pctbias | -11.33501    2.36028
                     |  .2682613   1.130847
                     | 
                mean |  .6649874   .7677021
                     |   .002012   .0084814
                     | 
               empse |  .0040239   .0169627
                     |  .0016428    .006925
                     | 
             relprec |            -94.37259
                     |             6.497476
                     | 
                 mse |  .0072393   .0005292
                     |  .0003384   .0003141
                     | 
                rmse |   .085084   .0230036
                     |  .0019884   .0068282
                     | 
             modelse |  .0114955   .0547305
                     |  .0038235   .0187957
                     | 
             ciwidth |  .0368276   .1708952
                     |  .0149918   .0748824
                     | 
            relerror |  185.6783   222.6521
                     |  150.4343   172.1298
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |   -.07569   .0097117
                     |  .0011122   .0069783
                     | 
             pctbias | -10.09199   1.294895
                     |  .1482984   .9304438
                     | 
                mean |    .67431   .7597117
                     |  .0011122   .0069783
                     | 
               empse |  .0022245   .0139567
                     |  .0009081   .0056978
                     | 
             relprec |            -97.45966
                     |             2.848079
                     | 
                 mse |  .0057327   .0002404
                     |  .0001682   .0002141
                     | 
                rmse |  .0757145   .0155051
                     |  .0011104   .0069055
                     | 
             modelse |  .0380224   .2041017
                     |   .012115   .0603386
                     | 
             ciwidth |  .1221532   .6768402
                     |  .0493054   .2462989
                     | 
            relerror |  1609.276   1362.396
                     |   885.183   737.1172
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0712663   .0146317
                     |  .0014906   .0074866
                     | 
             pctbias | -9.502169     1.9509
                     |  .1987497   .9982088
                     | 
                mean |  .6787337   .7646317
                     |  .0014906   .0074866
                     | 
               empse |  .0029812   .0149731
                     |  .0012171   .0061128
                     | 
             relprec |            -96.03567
                     |             4.299961
                     | 
                 mse |  .0050855   .0003822
                     |  .0002127   .0002603
                     | 
                rmse |   .071313   .0195508
                     |   .001491   .0066559
                     | 
             modelse |  .0185175   .0908626
                     |  .0056455   .0292322
                     | 
             ciwidth |  .0604339    .289776
                     |   .023214   .1195694
                     | 
            relerror |  521.1338   506.8379
                     |  316.4833    315.421
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
weak                 |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0673798   .0167262
                     |  .0014249    .007493
                     | 
             pctbias | -8.983968    2.23016
                     |  .1899844   .9990617
                     | 
                mean |  .6826202   .7667262
                     |  .0014249    .007493
                     | 
               empse |  .0028498   .0149859
                     |  .0011634    .006118
                     | 
             relprec |            -96.38381
                     |             3.861875
                     | 
                 mse |  .0045461   .0004482
                     |   .000191   .0003322
                     | 
                rmse |  .0674249   .0211707
                     |  .0014164    .007845
                     | 
             modelse |  .0100443     .05234
                     |  .0030517   .0168617
                     | 
             ciwidth |  .0326528   .1656556
                     |   .012702    .069887
                     | 
            relerror |  252.4608   249.2612
                     |  179.3667   181.6333
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.280488  -.0135206
                     |  .0028382    .011056
                     | 
             pctbias |  -37.3984  -1.802748
                     |  .3784308    1.47413
                     | 
                mean |   .469512   .7364794
                     |  .0028382    .011056
                     | 
               empse |  .0056765    .022112
                     |  .0023174   .0090272
                     | 
             relprec |            -93.40976
                     |             3.460395
                     | 
                 mse |  .0786977   .0005495
                     |   .001588   .0003608
                     | 
                rmse |  .2805311   .0234416
                     |  .0028303   .0076967
                     | 
             modelse |   .056726   .1936832
                     |   .010098    .044045
                     | 
             ciwidth |  .2116791   .7013735
                     |   .039314   .1678261
                     | 
            relerror |  899.3198    775.921
                     |  445.0682   409.3286
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2692752  -.0032472
                     |  .0033181   .0082502
                     | 
             pctbias | -35.90335  -.4329661
                     |  .4424158   1.100021
                     | 
                mean |  .4807248   .7467527
                     |  .0033181   .0082502
                     | 
               empse |  .0066362   .0165003
                     |  .0027092   .0067362
                     | 
             relprec |            -83.82445
                     |             12.54653
                     | 
                 mse |  .0725421   .0002147
                     |  .0017738   .0000821
                     | 
                rmse |  .2693365    .014654
                     |  .0032928   .0028017
                     | 
             modelse |  .0309887   .0799625
                     |  .0054548   .0242534
                     | 
             ciwidth |  .1158399   .2727838
                     |  .0211099   .0891405
                     | 
            relerror |  366.9613   384.6117
                     |  207.6021   246.4685
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2611985  -.0062255
                     |  .0019545   .0160305
                     | 
             pctbias | -34.82647  -.8300622
                     |  .2605946   2.137397
                     | 
                mean |  .4888015   .7437745
                     |  .0019545   .0160305
                     | 
               empse |  .0039089   .0320609
                     |  .0015958   .0130888
                     | 
             relprec |            -98.51351
                     |             .3771211
                     | 
                 mse |  .0682361   .0008097
                     |  .0010237   .0003591
                     | 
                rmse |  .2612204    .028455
                     |  .0019595   .0063093
                     | 
             modelse |  .0166033   .0430395
                     |  .0034356   .0145918
                     | 
             ciwidth |  .0610424   .1406338
                     |  .0130349   .0538076
                     | 
            relerror |  324.7548   34.24273
                     |  194.4076   71.23856
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1903618   .0020528
                     |  .0029537   .0105104
                     | 
             pctbias | -25.38157   .2737025
                     |  .3938307   1.401391
                     | 
                mean |  .5596382   .7520528
                     |  .0029537   .0105104
                     | 
               empse |  .0059075   .0210209
                     |  .0024117   .0085817
                     | 
             relprec |             -92.1023
                     |             9.107986
                     | 
                 mse |  .0362638   .0003356
                     |  .0011099    .000221
                     | 
                rmse |  .1904306     .01832
                     |  .0029142   .0060325
                     | 
             modelse |  .0446331   .1792902
                     |  .0123823   .0486365
                     | 
             ciwidth |  .1547781   .6177602
                     |  .0470963   .1934829
                     | 
            relerror |  655.5372   752.9158
                     |  372.9253   418.0638
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1803283   .0002415
                     |  .0017426    .012098
                     | 
             pctbias | -24.04377   .0321964
                     |  .2323402   1.613069
                     | 
                mean |  .5696718   .7502415
                     |  .0017426    .012098
                     | 
               empse |  .0034851    .024196
                     |  .0014228    .009878
                     | 
             relprec |            -97.92536
                     |             .8443724
                     | 
                 mse |  .0325274   .0004391
                     |   .000633   .0002383
                     | 
                rmse |  .1803535   .0209558
                     |  .0017549   .0056863
                     | 
             modelse |  .0241382   .0821843
                     |  .0065804   .0264152
                     | 
             ciwidth |  .0834341   .2679447
                     |  .0257664    .103264
                     | 
            relerror |  592.6118     239.66
                     |  340.0038   176.4839
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1754703   .0045733
                     |  .0021324   .0146994
                     | 
             pctbias | -23.39604   .6097714
                     |  .2843169   1.959924
                     | 
                mean |  .5745297   .7545733
                     |  .0021324   .0146994
                     | 
               empse |  .0042648   .0293989
                     |  .0017411    .012002
                     | 
             relprec |            -97.89561
                     |             1.359108
                     | 
                 mse |  .0308035   .0006691
                     |  .0007505   .0005631
                     | 
                rmse |  .1755091   .0258676
                     |   .002138   .0108839
                     | 
             modelse |  .0137354   .0490827
                     |  .0040088   .0174778
                     | 
             ciwidth |  .0466462   .1519178
                     |   .015525    .068164
                     | 
            relerror |  222.0686    66.9544
                     |  161.6288   90.44347
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.124092   .0109205
                     |  .0033454   .0111316
                     | 
             pctbias | -16.54559   1.456072
                     |  .4460515   1.484218
                     | 
                mean |   .625908   .7609205
                     |  .0033454   .0111316
                     | 
               empse |  .0066908   .0222633
                     |  .0027315   .0090889
                     | 
             relprec |            -90.96819
                     |             10.42588
                     | 
                 mse |  .0154324    .000491
                     |  .0008082   .0004258
                     | 
                rmse |  .1242272   .0221585
                     |  .0032527   .0096085
                     | 
             modelse |  .0379972   .1830333
                     |  .0118631   .0520726
                     | 
             ciwidth |  .1245927   .6150562
                     |  .0471229   .2132912
                     | 
            relerror |  467.9049   722.1309
                     |  291.8729   409.0924
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1189474   .0087786
                     |  .0017511   .0114628
                     | 
             pctbias | -15.85966   1.170484
                     |  .2334795   1.528372
                     | 
                mean |  .6310526   .7587786
                     |  .0017511   .0114628
                     | 
               empse |  .0035022   .0229256
                     |  .0014298   .0093593
                     | 
             relprec |            -97.66633
                     |             2.162933
                     | 
                 mse |  .0141577   .0004713
                     |  .0004151    .000447
                     | 
                rmse |  .1189861   .0217083
                     |  .0017442    .010296
                     | 
             modelse |   .021309   .0983059
                     |  .0064112   .0322554
                     | 
             ciwidth |  .0700873   .3088367
                     |   .026236   .1330614
                     | 
            relerror |   508.447   328.8042
                     |  308.5669   224.5905
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1133401   .0180123
                     |  .0022229     .01146
                     | 
             pctbias | -15.11202   2.401642
                     |  .2963923   1.527999
                     | 
                mean |  .6366599   .7680123
                     |  .0022229     .01146
                     | 
               empse |  .0044459     .02292
                     |   .001815    .009357
                     | 
             relprec |             -96.2374
                     |             4.339787
                     | 
                 mse |  .0128608   .0007184
                     |  .0004949   .0005666
                     | 
                rmse |  .1134055   .0268037
                     |  .0021819     .01057
                     | 
             modelse |  .0112812   .0520443
                     |  .0033129   .0171688
                     | 
             ciwidth |   .037412   .1624168
                     |  .0136121   .0712759
                     | 
            relerror |  153.7439   127.0694
                     |  127.6068   119.1828
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0961696   .0191385
                     |  .0051033   .0056264
                     | 
             pctbias | -12.82262   2.551796
                     |  .6804401    .750187
                     | 
                mean |  .6538303   .7691385
                     |  .0051033   .0056264
                     | 
               empse |  .0102066   .0112528
                     |  .0041668   .0045939
                     | 
             relprec |            -17.73015
                     |             86.12239
                     | 
                 mse |  .0093267   .0004613
                     |  .0009564   .0002758
                     | 
                rmse |   .096575   .0214767
                     |  .0049516   .0064212
                     | 
             modelse |  .0376865   .1917354
                     |  .0125889   .0614847
                     | 
             ciwidth |  .1206373   .6221689
                     |  .0492282   .2434419
                     | 
            relerror |  269.2361    1603.89
                     |  194.7703    884.545
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0956923   .0121155
                     |  .0011886   .0137902
                     | 
             pctbias | -12.75897   1.615399
                     |  .1584734   1.838694
                     | 
                mean |  .6543077   .7621155
                     |  .0011886   .0137902
                     | 
               empse |  .0023771   .0275804
                     |  .0009704   .0112597
                     | 
             relprec |            -99.25716
                     |             .8419302
                     | 
                 mse |  .0091612   .0007173
                     |  .0002262   .0005893
                     | 
                rmse |  .0957144   .0267824
                     |  .0011814   .0110017
                     | 
             modelse |  .0205413   .1015461
                     |  .0067518   .0369787
                     | 
             ciwidth |  .0656902   .3090735
                     |  .0268845   .1448218
                     | 
            relerror |  764.1324   268.1819
                     |  452.9123   201.4184
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
moderate             |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0926829   .0183662
                     |  .0009688   .0111877
                     | 
             pctbias | -12.35773   2.448831
                     |  .1291745   1.491693
                     | 
                mean |   .657317   .7683662
                     |  .0009688   .0111877
                     | 
               empse |  .0019376   .0223754
                     |   .000791   .0091347
                     | 
             relprec |            -99.25011
                     |             .6014416
                     | 
                 mse |  .0085929   .0007128
                     |  .0001799   .0006487
                     | 
                rmse |  .0926981   .0266985
                     |  .0009702   .0121492
                     | 
             modelse |  .0103571   .0555604
                     |  .0033656   .0203584
                     | 
             ciwidth |  .0332054   .1684244
                     |  .0134867   .0797222
                     | 
            relerror |  434.5256   148.3101
                     |  278.9109   136.2158
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3329245   -.050397
                     |  .0023149   .0072999
                     | 
             pctbias | -44.38993  -6.719601
                     |   .308655   .9733189
                     | 
                mean |  .4170755    .699603
                     |  .0023149   .0072999
                     | 
               empse |  .0046298   .0145998
                     |  .0018901   .0059603
                     | 
             relprec |            -89.94375
                     |             9.537528
                     | 
                 mse |  .1108548   .0026997
                     |  .0015487   .0008019
                     | 
                rmse |  .3329487   .0519589
                     |  .0023258   .0077162
                     | 
             modelse |  .0567089   .1502858
                     |  .0096178   .0356272
                     | 
             ciwidth |  .2131887   .5246882
                     |  .0363574   .1546528
                     | 
            relerror |  1124.861   929.3703
                     |  541.4806   485.9518
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3184531  -.0416202
                     |  .0016841   .0091314
                     | 
             pctbias | -42.46042  -5.549357
                     |  .2245492   1.217526
                     | 
                mean |  .4315469   .7083798
                     |  .0016841   .0091314
                     | 
               empse |  .0033682   .0182629
                     |  .0013751   .0074558
                     | 
             relprec |            -96.59853
                     |             .8556727
                     | 
                 mse |  .1014209   .0019824
                     |  .0010721    .000733
                     | 
                rmse |  .3184665    .044524
                     |  .0016832   .0082319
                     | 
             modelse |  .0309577   .0649395
                     |  .0050791   .0197365
                     | 
             ciwidth |  .1161859   .2165726
                     |  .0202252   .0772358
                     | 
            relerror |  819.1077   255.5815
                     |  404.3914    180.975
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3083768  -.0405139
                     |  .0016146    .012025
                     | 
             pctbias | -41.11691  -5.401854
                     |  .2152736   1.603327
                     | 
                mean |  .4416232   .7094861
                     |  .0016146    .012025
                     | 
               empse |  .0032291   .0240499
                     |  .0013183   .0098183
                     | 
             relprec |            -98.19724
                     |             .9550193
                     | 
                 mse |  .0951041   .0020752
                     |  .0009945   .0009333
                     | 
                rmse |  .3083895   .0455541
                     |  .0016123   .0102438
                     | 
             modelse |  .0164738   .0345181
                     |  .0032096    .011636
                     | 
             ciwidth |  .0609825   .1109245
                     |  .0122638   .0447369
                     | 
            relerror |  410.1663    43.5271
                     |  230.7769   75.98835
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2318441  -.0180983
                     |  .0016023   .0121745
                     | 
             pctbias | -30.91255  -2.413112
                     |  .2136457   1.623261
                     | 
                mean |  .5181559   .7319016
                     |  .0016023   .0121745
                     | 
               empse |  .0032047   .0243489
                     |  .0013083   .0099404
                     | 
             relprec |            -98.26775
                     |             .8631083
                     | 
                 mse |  .0537594   .0007722
                     |   .000748   .0003093
                     | 
                rmse |  .2318608   .0277885
                     |   .001613   .0055648
                     | 
             modelse |  .0460362   .1668207
                     |  .0127637   .0560354
                     | 
             ciwidth |  .1594029   .5289817
                     |    .04884   .2219582
                     | 
            relerror |  1336.529   585.1259
                     |  708.9174   362.2086
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2186071  -.0089894
                     |  .0015062   .0131977
                     | 
             pctbias | -29.14761  -1.198586
                     |  .2008227   1.759697
                     | 
                mean |  .5313929   .7410106
                     |  .0015062   .0131977
                     | 
               empse |  .0030123   .0263955
                     |  .0012298   .0107759
                     | 
             relprec |            -98.69759
                     |             .7677642
                     | 
                 mse |  .0477959   .0006033
                     |  .0006583   .0001563
                     | 
                rmse |  .2186227   .0245632
                     |  .0015056   .0031818
                     | 
             modelse |  .0245739   .0733307
                     |  .0062494   .0233373
                     | 
             ciwidth |  .0862147   .2321319
                     |  .0248063   .0978825
                     | 
            relerror |  715.7731   177.8156
                     |    392.37   143.8076
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.214252  -.0146431
                     |  .0004797   .0192464
                     | 
             pctbias | -28.56693   -1.95241
                     |  .0639607   2.566182
                     | 
                mean |   .535748   .7353569
                     |  .0004797   .0192464
                     | 
               empse |  .0009594   .0384927
                     |  .0003917   .0157146
                     | 
             relprec |            -99.93787
                     |             .0670696
                     | 
                 mse |  .0459046   .0013257
                     |  .0002058     .00033
                     | 
                rmse |  .2142536     .03641
                     |  .0004802   .0045322
                     | 
             modelse |  .0127932   .0463007
                     |  .0033925   .0175126
                     | 
             ciwidth |  .0446978   .1385413
                     |   .013127   .0676928
                     | 
            relerror |   1233.44   20.28435
                     |  649.1387   66.94223
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1542058   .0094461
                     |  .0020096    .014336
                     | 
             pctbias | -20.56078   1.259478
                     |  .2679459   1.911468
                     | 
                mean |  .5957942   .7594461
                     |  .0020096    .014336
                     | 
               empse |  .0040192    .028672
                     |  .0016408   .0117053
                     | 
             relprec |            -98.03501
                     |             .9958162
                     | 
                 mse |  .0237916   .0007058
                     |  .0006204   .0005615
                     | 
                rmse |  .1542451   .0265667
                     |   .002011   .0105687
                     | 
             modelse |  .0385966   .2691713
                     |  .0117077   .0730656
                     | 
             ciwidth |  .1280297   .8751388
                     |  .0465435   .3403114
                     | 
            relerror |  860.3087   838.7941
                     |  488.4178   460.2484
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
.75                  |
strong               |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1467036   .0114448
                     |  .0010253   .0168086
                     | 
             pctbias | -19.56048   1.525972
                     |  .1367001   2.241146
                     | 
                mean |  .6032964   .7614448
                     |  .0010253   .0168086
                     | 
               empse |  .0020505   .0336172
                     |  .0008371   .0137242
                     | 
             relprec |            -99.62795
                     |             .2950498
                     | 
                 mse |  .0215251   .0009786
                     |     .0003   .0008966
                     | 
                rmse |  .1467143   .0312821
                     |  .0010225   .0143305
                     | 
             modelse |  .0215534   .0879152
                     |  .0067594   .0325083
                     | 
             ciwidth |  .0708753   .2657961
                     |  .0265509   .1266443
                     | 
            relerror |  951.1265   161.5187
                     |  541.1198    144.048
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1395581   .0152063
                     |  .0020158   .0162109
                     | 
             pctbias | -18.60775   2.027502
                     |  .2687744   2.161457
                     | 
                mean |  .6104419   .7652063
                     |  .0020158   .0162109
                     | 
               empse |  .0040316   .0324219
                     |  .0016459   .0132362
                     | 
             relprec |            -98.45374
                     |             1.547347
                     | 
                 mse |  .0194887   .0010196
                     |  .0005625   .0009956
                     | 
                rmse |  .1396018   .0319314
                     |  .0020146   .0155901
                     | 
             modelse |    .01109   .0481477
                     |  .0032964   .0163226
                     | 
             ciwidth |  .0365085   .1476338
                     |  .0136252   .0678856
                     | 
            relerror |  175.0756   48.50386
                     |  138.9115   78.80434
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1205706    .020952
                     |  .0026067   .0130975
                     | 
             pctbias | -16.07607   2.793596
                     |  .3475644   1.746338
                     | 
                mean |  .6294295    .770952
                     |  .0026067   .0130975
                     | 
               empse |  .0052135   .0261951
                     |  .0021284   .0106941
                     | 
             relprec |            -96.03892
                     |             3.926656
                     | 
                 mse |  .0145576   .0009536
                     |  .0006277   .0008271
                     | 
                rmse |  .1206551   .0308808
                     |  .0026013   .0133913
                     | 
             modelse |  .0382586   .1890869
                     |  .0120909   .0588242
                     | 
             ciwidth |  .1233863    .602132
                     |  .0492175   .2495496
                     | 
            relerror |  633.8414   621.8417
                     |  378.8658   370.5007
                     | 
               cover |        25         75
                     |  21.65063   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1173714   .0146129
                     |  .0016501    .015648
                     | 
             pctbias | -15.64953   1.948382
                     |  .2200154   2.086395
                     | 
                mean |  .6326286   .7646129
                     |  .0016501    .015648
                     | 
               empse |  .0033002   .0312959
                     |  .0013473   .0127765
                     | 
             relprec |            -98.88798
                     |             1.186471
                     | 
                 mse |  .0137842   .0009481
                     |  .0003865   .0009366
                     | 
                rmse |  .1174062   .0307914
                     |   .001646   .0152092
                     | 
             modelse |  .0205786   .0947592
                     |  .0066619   .0345381
                     | 
             ciwidth |  .0662984   .2845808
                     |  .0265306   .1378262
                     | 
            relerror |  523.5502   202.7844
                     |  324.8846   165.7076
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
.75                  |
strong               |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1131078   .0193193
                     |  .0011557   .0167315
                     | 
             pctbias | -15.08105   2.575912
                     |  .1540969   2.230863
                     | 
                mean |  .6368921   .7693194
                     |  .0011557   .0167315
                     | 
               empse |  .0023115   .0334629
                     |  .0009436   .0136612
                     | 
             relprec |            -99.52287
                     |              .517504
                     | 
                 mse |  .0127974   .0012131
                     |  .0002614   .0011175
                     | 
                rmse |  .1131256   .0348291
                     |  .0011551   .0160433
                     | 
             modelse |  .0107621   .0528477
                     |   .003323   .0186089
                     | 
             ciwidth |  .0347105   .1609973
                     |  .0138433   .0752659
                     | 
            relerror |  365.6007   57.92916
                     |  238.3228    85.1438
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0034185   .0040012
                     |  .0021116   .0066571
                     | 
             pctbias |  .3418505   .4001245
                     |  .2111642     .66571
                     | 
                mean |  1.003418   1.004001
                     |  .0021116   .0066571
                     | 
               empse |  .0042233   .0133142
                     |  .0017241   .0054355
                     | 
             relprec |            -89.93832
                     |             11.59137
                     | 
                 mse |  .0000251    .000149
                     |  .0000218   .0001371
                     | 
                rmse |  .0050063    .012205
                     |  .0021741   .0056163
                     | 
             modelse |  .0558619    .375147
                     |  .0133558   .0660034
                     | 
             ciwidth |  .2014245   1.398901
                     |  .0495918   .2617833
                     | 
            relerror |  1222.712   2717.646
                     |  625.7819   1252.575
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100         75
                     |         0   21.65063
---------------------+---------------------
1                    |
no                   |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0014269  -.0001708
                     |   .001714   .0059851
                     | 
             pctbias | -.1426905  -.0170797
                     |   .171399   .5985123
                     | 
                mean |  .9985731   .9998292
                     |   .001714   .0059851
                     | 
               empse |   .003428   .0119702
                     |  .0013995   .0048868
                     | 
             relprec |            -91.79893
                     |             8.834344
                     | 
                 mse |  .0000108   .0001075
                     |  9.55e-06   5.26e-06
                     | 
                rmse |  .0032938   .0103679
                     |  .0014501   .0002534
                     | 
             modelse |  .0280365   .1294078
                     |  .0069377   .0296744
                     | 
             ciwidth |  .0995876   .4700532
                     |  .0268365   .1101093
                     | 
            relerror |  717.8735   981.0789
                     |  390.4427   506.2052
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0004461  -.0024776
                     |  .0027096   .0055087
                     | 
             pctbias | -.0446066  -.2477571
                     |  .2709599    .550872
                     | 
                mean |  .9995539   .9975224
                     |  .0027096   .0055087
                     | 
               empse |  .0054192   .0110174
                     |  .0022124   .0044979
                     | 
             relprec |            -75.80594
                     |              6.59418
                     | 
                 mse |  .0000222   .0000972
                     |   .000014   .0000568
                     | 
                rmse |  .0047143   .0098578
                     |  .0014895   .0028811
                     | 
             modelse |  .0148134   .0610684
                     |  .0037074   .0140867
                     | 
             ciwidth |   .052078   .2203732
                     |  .0148293   .0539762
                     | 
            relerror |  173.3508   454.2888
                     |  130.8956   259.9112
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0004152   .0053705
                     |  .0024163   .0107607
                     | 
             pctbias | -.0415161   .5370468
                     |  .2416319   1.076068
                     | 
                mean |  .9995849    1.00537
                     |  .0024163   .0107607
                     | 
               empse |  .0048326   .0215214
                     |  .0019729   .0087861
                     | 
             relprec |             -94.9577
                     |             1.778369
                     | 
                 mse |  .0000177   .0003762
                     |  .0000109   .0002596
                     | 
                rmse |  .0042057   .0193963
                     |  .0012938   .0066924
                     | 
             modelse |  .0414158   .2421722
                     |  .0112672   .0480895
                     | 
             ciwidth |  .1431747    .892921
                     |  .0441871   .1860628
                     | 
            relerror |  757.0016   1025.265
                     |  420.4366   510.8491
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0041551    .000404
                     |  .0025184   .0048037
                     | 
             pctbias |  -.415507   .0404045
                     |   .251837   .4803671
                     | 
                mean |   .995845   1.000404
                     |  .0025184   .0048037
                     | 
               empse |  .0050367   .0096073
                     |  .0020562   .0039222
                     | 
             relprec |            -72.51518
                     |             12.77721
                     | 
                 mse |  .0000363   .0000694
                     |  .0000204   .0000313
                     | 
                rmse |  .0060242     .00833
                     |  .0016901   .0018797
                     | 
             modelse |  .0235689    .106096
                     |  .0067384   .0285546
                     | 
             ciwidth |   .079486   .3659646
                     |  .0271883   .1140662
                     | 
            relerror |  367.9398   1004.322
                     |  233.2227   539.9927
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0028682  -.0014293
                     |  .0018083   .0029755
                     | 
             pctbias | -.2868161  -.1429349
                     |  .1808264   .2975517
                     | 
                mean |  .9971318   .9985707
                     |  .0018083   .0029755
                     | 
               empse |  .0036165    .005951
                     |  .0014764   .0024295
                     | 
             relprec |            -63.06834
                     |             17.24566
                     | 
                 mse |   .000018   .0000286
                     |  .0000161   .0000232
                     | 
                rmse |  .0042469   .0053483
                     |  .0018934   .0021703
                     | 
             modelse |  .0127495   .0566618
                     |  .0040426   .0178627
                     | 
             ciwidth |  .0419249   .1877714
                     |  .0157058   .0684955
                     | 
            relerror |  252.5341   852.1346
                     |  182.2316   491.1111
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0024307  -.0040844
                     |  .0024528   .0070999
                     | 
             pctbias |  .2430692  -.4084408
                     |  .2452842   .7099855
                     | 
                mean |  1.002431   .9959156
                     |  .0024528   .0070999
                     | 
               empse |  .0049057   .0141997
                     |  .0020027    .005797
                     | 
             relprec |            -88.06451
                     |              8.01641
                     | 
                 mse |   .000024   .0001679
                     |  9.52e-06   .0001409
                     | 
                rmse |  .0048946   .0129579
                     |  .0009727   .0054388
                     | 
             modelse |  .0390979   .2140353
                     |  .0117329   .0551516
                     | 
             ciwidth |  .1280434    .736421
                     |  .0486273   .2320991
                     | 
            relerror |  696.9924   1407.322
                     |   403.817   727.6839
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0011028  -.0039202
                     |  .0012501   .0032316
                     | 
             pctbias | -.1102805  -.3920153
                     |  .1250125   .3231626
                     | 
                mean |  .9988972   .9960799
                     |  .0012501   .0032316
                     | 
               empse |  .0025003   .0064633
                     |  .0010207   .0026386
                     | 
             relprec |            -85.03541
                     |             15.22686
                     | 
                 mse |  5.90e-06   .0000467
                     |  2.17e-06   .0000405
                     | 
                rmse |  .0024299   .0068336
                     |  .0004457   .0029614
                     | 
             modelse |  .0214876   .1031317
                     |   .007132   .0325016
                     | 
             ciwidth |  .0681684   .3364792
                     |  .0285641    .129377
                     | 
            relerror |  759.4174   1495.663
                     |  452.1808   822.9415
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0019841   .0022717
                     |  .0015055   .0012267
                     | 
             pctbias |   .198406   .2271652
                     |  .1505504   .1226683
                     | 
                mean |  1.001984   1.002272
                     |  .0015055   .0012267
                     | 
               empse |   .003011   .0024534
                     |  .0012292   .0010016
                     | 
             relprec |              50.6257
                     |             128.9535
                     | 
                 mse |  .0000107   9.67e-06
                     |  2.23e-06   7.43e-06
                     | 
                rmse |  .0032766   .0031104
                     |    .00034   .0011941
                     | 
             modelse |   .010824   .0544083
                     |  .0034164    .017141
                     | 
             ciwidth |  .0350355   .1756828
                     |  .0138174   .0698153
                     | 
            relerror |  259.4811     2117.7
                     |  185.5035   1143.609
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0027836   .0040378
                     |   .001401    .002032
                     | 
             pctbias | -.2783611   .4037753
                     |  .1401031   .2031983
                     | 
                mean |  .9972164   1.004038
                     |   .001401    .002032
                     | 
               empse |  .0028021    .004064
                     |  .0011439   .0016591
                     | 
             relprec |            -52.46042
                     |             29.10073
                     | 
                 mse |  .0000136   .0000287
                     |  6.09e-06   .0000183
                     | 
                rmse |  .0036929   .0053563
                     |  .0008245   .0017057
                     | 
             modelse |  .0370215   .1989145
                     |  .0113647    .058273
                     | 
             ciwidth |  .1199757   .6645258
                     |  .0471384   .2355033
                     | 
            relerror |  1221.223   4794.593
                     |  674.8608    2459.45
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  .0022211   .0014154
                     |  .0009638   .0035577
                     | 
             pctbias |  .2221137   .1415387
                     |  .0963839   .3557672
                     | 
                mean |  1.002221   1.001415
                     |  .0009638   .0035577
                     | 
               empse |  .0019277   .0071153
                     |   .000787   .0029048
                     | 
             relprec |            -92.66032
                     |             8.084519
                     | 
                 mse |  7.72e-06     .00004
                     |  4.23e-06   .0000153
                     | 
                rmse |  .0027786   .0063225
                     |  .0007605   .0012101
                     | 
             modelse |  .0205725    .100923
                     |  .0063967   .0321059
                     | 
             ciwidth |  .0659865   .3255629
                     |  .0267646   .1297649
                     | 
            relerror |  967.2159   1318.385
                     |  547.6682   734.1004
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
no                   |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0020012  -.0016795
                     |  .0020055   .0030035
                     | 
             pctbias | -.2001226  -.1679525
                     |  .2005464   .3003466
                     | 
                mean |  .9979988   .9983205
                     |  .0020055   .0030035
                     | 
               empse |  .0040109   .0060069
                     |  .0016375   .0024523
                     | 
             relprec |            -55.41545
                     |             18.05508
                     | 
                 mse |  .0000161   .0000299
                     |  .0000134   .0000272
                     | 
                rmse |  .0040088   .0054666
                     |  .0016763   .0024839
                     | 
             modelse |  .0107755     .05665
                     |    .00331   .0180184
                     | 
             ciwidth |  .0345227   .1799254
                     |  .0140514   .0751427
                     | 
            relerror |  168.6531   843.0776
                     |  137.2567   488.0664
                     | 
               cover |       100        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2855539  -.0104709
                     |  .0018183   .0105235
                     | 
             pctbias | -28.55539  -1.047087
                     |  .1818271   1.052353
                     | 
                mean |  .7144461   .9895291
                     |  .0018183   .0105235
                     | 
               empse |  .0036365   .0210471
                     |  .0014846   .0085924
                     | 
             relprec |            -97.01466
                     |             3.109226
                     | 
                 mse |  .0815509   .0004419
                     |  .0010331   .0002346
                     | 
                rmse |  .2855712   .0210208
                     |  .0018089   .0055798
                     | 
             modelse |  .0560182   .2692498
                     |  .0108873   .0435068
                     | 
             ciwidth |  .2068822   1.002455
                     |  .0424988   .1906457
                     | 
            relerror |  1440.426   1179.276
                     |  696.5033   561.6827
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2708028  -.0029895
                     |  .0036735   .0151019
                     | 
             pctbias | -27.08028  -.2989545
                     |  .3673466   1.510188
                     | 
                mean |  .7291971   .9970105
                     |  .0036735   .0151019
                     | 
               empse |  .0073469   .0302038
                     |  .0029994   .0123306
                     | 
             relprec |            -94.08316
                     |             5.818403
                     | 
                 mse |  .0733747   .0006931
                     |  .0019785   .0003107
                     | 
                rmse |  .2708776   .0263275
                     |   .003652      .0059
                     | 
             modelse |  .0299216   .0935427
                     |  .0068683   .0240808
                     | 
             ciwidth |  .1074957    .333334
                     |  .0270908   .0882104
                     | 
            relerror |  307.2667   209.7056
                     |  190.7453    149.475
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2612912  -.0029461
                     |  .0009058   .0247665
                     | 
             pctbias | -26.12912  -.2946109
                     |  .0905836   2.476647
                     | 
                mean |  .7387089   .9970539
                     |  .0009058   .0247665
                     | 
               empse |  .0018117   .0495329
                     |  .0007396   .0202217
                     | 
             relprec |            -99.86623
                     |             .1461072
                     | 
                 mse |  .0682755   .0018488
                     |  .0004719   .0009647
                     | 
                rmse |  .2612959   .0429978
                     |   .000903    .011218
                     | 
             modelse |  .0154199   .0492283
                     |  .0036561   .0149099
                     | 
             ciwidth |  .0549715    .166078
                     |  .0145112   .0567336
                     | 
            relerror |  751.1427  -.6149561
                     |  401.8306   50.52024
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1857225  -.0021705
                     |  .0036406   .0113746
                     | 
             pctbias | -18.57225  -.2170533
                     |  .3640649   1.137463
                     | 
                mean |  .8142775   .9978294
                     |  .0036406   .0113746
                     | 
               empse |  .0072813   .0227493
                     |  .0029726   .0092873
                     | 
             relprec |            -89.75569
                     |             11.34393
                     | 
                 mse |  .0345326   .0003929
                     |   .001338   .0002082
                     | 
                rmse |  .1858295   .0198206
                     |     .0036    .005253
                     | 
             modelse |  .0428486   .2162988
                     |  .0110896   .0566251
                     | 
             ciwidth |  .1487827   .7611277
                     |  .0450018    .215699
                     | 
            relerror |  488.4752   850.7948
                     |  284.4526   461.1122
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.177345  -.0117642
                     |  .0032035   .0188567
                     | 
             pctbias |  -17.7345  -1.176424
                     |  .3203487   1.885668
                     | 
                mean |   .822655   .9882358
                     |  .0032035   .0188567
                     | 
               empse |   .006407   .0377134
                     |  .0026156   .0153964
                     | 
             relprec |            -97.11387
                     |             3.131787
                     | 
                 mse |   .031482   .0012051
                     |  .0011282   .0003605
                     | 
                rmse |  .1774318   .0347148
                     |  .0031792   .0051924
                     | 
             modelse |   .024852    .097671
                     |  .0071237   .0291003
                     | 
             ciwidth |  .0839856   .3261842
                     |  .0284998   .1157413
                     | 
            relerror |  287.8905   158.9825
                     |   193.492   130.8915
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1751537  -.0118171
                     |  .0008868   .0175252
                     | 
             pctbias | -17.51537  -1.181711
                     |  .0886814   1.752516
                     | 
                mean |  .8248463   .9881829
                     |  .0008868   .0175252
                     | 
               empse |  .0017736   .0350503
                     |  .0007241   .0143092
                     | 
             relprec |            -99.74394
                     |             .2699602
                     | 
                 mse |  .0306812    .001061
                     |  .0003106    .000238
                     | 
                rmse |  .1751604   .0325736
                     |  .0008867   .0036535
                     | 
             modelse |  .0124402   .0519357
                     |  .0036051   .0171293
                     | 
             ciwidth |  .0418438   .1657637
                     |  .0144577   .0682373
                     | 
            relerror |  601.3959   48.17482
                     |  351.1513   77.76654
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1286745  -.0165212
                     |  .0044846   .0186222
                     | 
             pctbias | -12.86745  -1.652125
                     |   .448458   1.862224
                     | 
                mean |  .8713255   .9834788
                     |  .0044846   .0186222
                     | 
               empse |  .0089692   .0372445
                     |  .0036616    .015205
                     | 
             relprec |            -94.20065
                     |             4.884838
                     | 
                 mse |  .0166175   .0013133
                     |  .0011332    .000974
                     | 
                rmse |  .1289088   .0362397
                     |  .0043952   .0134385
                     | 
             modelse |  .0395827   .1802296
                     |    .01218   .0470029
                     | 
             ciwidth |  .1304894   .6210147
                     |  .0484684   .1944775
                     | 
            relerror |  341.3202   383.9095
                     |  225.6145   234.4243
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1198602  -.0020038
                     |  .0029594   .0166095
                     | 
             pctbias | -11.98602  -.2003789
                     |  .2959383   1.660955
                     | 
                mean |  .8801398   .9979962
                     |  .0029594   .0166095
                     | 
               empse |  .0059188   .0332191
                     |  .0024163   .0135616
                     | 
             relprec |            -96.82542
                     |             2.802452
                     | 
                 mse |  .0143927   .0008316
                     |  .0007264   .0004553
                     | 
                rmse |  .1199698   .0288383
                     |  .0030275   .0078932
                     | 
             modelse |   .021443   .0978404
                     |  .0068928   .0324783
                     | 
             ciwidth |   .069356   .3114152
                     |  .0274167   .1292462
                     | 
            relerror |   262.289   194.5306
                     |  188.2491   154.9743
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1137765   .0009107
                     |  .0005925   .0184657
                     | 
             pctbias | -11.37765   .0910714
                     |  .0592464   1.846575
                     | 
                mean |  .8862236   1.000911
                     |  .0005925   .0184657
                     | 
               empse |  .0011849   .0369315
                     |  .0004837   .0150772
                     | 
             relprec |            -99.89706
                     |             .0934398
                     | 
                 mse |  .0129461   .0010238
                     |  .0001355   .0006594
                     | 
                rmse |  .1137811   .0319966
                     |  .0005955   .0103042
                     | 
             modelse |  .0114432   .0565692
                     |  .0034159   .0185239
                     | 
             ciwidth |  .0372703   .1770706
                     |  .0144111   .0770667
                     | 
            relerror |  865.7305   53.17329
                     |    488.41   80.16296
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0951028   .0167983
                     |  .0016495   .0045645
                     | 
             pctbias | -9.510284   1.679829
                     |  .1649473    .456451
                     | 
                mean |  .9048972   1.016798
                     |  .0016495   .0045645
                     | 
               empse |  .0032989    .009129
                     |  .0013468   .0037269
                     | 
             relprec |            -86.94123
                     |             5.838502
                     | 
                 mse |  .0090527   .0003447
                     |  .0003134   .0001753
                     | 
                rmse |  .0951458   .0185657
                     |  .0016471   .0047217
                     | 
             modelse |  .0368625   .2077336
                     |  .0121195     .06949
                     | 
             ciwidth |  .1172561   .6616659
                     |  .0487537   .2740338
                     | 
            relerror |  1017.402    2175.53
                     |  585.7144   1201.012
                     | 
               cover |        25        100
                     |  21.65063          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0918673    .012234
                     |   .001212   .0085424
                     | 
             pctbias | -9.186728     1.2234
                     |  .1212021    .854244
                     | 
                mean |  .9081327   1.012234
                     |   .001212   .0085424
                     | 
               empse |   .002424   .0170849
                     |  .0009896   .0069749
                     | 
             relprec |            -97.98694
                     |             2.157763
                     | 
                 mse |   .008444   .0003686
                     |  .0002226   .0003298
                     | 
                rmse |  .0918913   .0191987
                     |  .0012115   .0085892
                     | 
             modelse |  .0211574   .1056835
                     |  .0073387   .0377315
                     | 
             ciwidth |   .066393   .3262131
                     |  .0286954   .1474291
                     | 
            relerror |   772.815    518.579
                     |  467.5712     335.48
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
weak                 |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.0897389   .0098348
                     |  .0010523   .0117867
                     | 
             pctbias | -8.973887   .9834751
                     |  .1052343   1.178671
                     | 
                mean |  .9102612   1.009835
                     |  .0010523   .0117867
                     | 
               empse |  .0021047   .0235734
                     |  .0008592   .0096238
                     | 
             relprec |            -99.20287
                     |             .9136202
                     | 
                 mse |  .0080564   .0005135
                     |  .0001873   .0004904
                     | 
                rmse |  .0897574   .0226606
                     |  .0010433   .0108216
                     | 
             modelse |  .0104045   .0567712
                     |  .0032103   .0194426
                     | 
             ciwidth |  .0335169   .1757557
                     |  .0134166   .0788112
                     | 
            relerror |  394.3477   140.8273
                     |  252.9738   128.3306
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3595431  -.0296198
                     |  .0020539   .0217692
                     | 
             pctbias | -35.95432  -2.961984
                     |   .205392   2.176924
                     | 
                mean |  .6404569   .9703802
                     |  .0020539   .0217692
                     | 
               empse |  .0041078   .0435385
                     |   .001677   .0177745
                     | 
             relprec |            -99.10982
                     |             1.016195
                     | 
                 mse |  .1292839    .002299
                     |  .0014717   .0014573
                     | 
                rmse |  .3595608   .0479482
                     |  .0020465   .0151965
                     | 
             modelse |   .056705   .2160787
                     |  .0101472    .050939
                     | 
             ciwidth |  .2110763   .7689282
                     |  .0402286   .2050854
                     | 
            relerror |  1280.409   396.2936
                     |  615.3102   233.9652
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3373106  -.0192764
                     |  .0031311   .0166041
                     | 
             pctbias | -33.73106  -1.927639
                     |  .3131091   1.660409
                     | 
                mean |  .6626894   .9807236
                     |  .0031311   .0166041
                     | 
               empse |  .0062622   .0332082
                     |  .0025565   .0135572
                     | 
             relprec |            -96.44401
                     |             3.210464
                     | 
                 mse |  .1138078   .0011987
                     |  .0021124   .0004808
                     | 
                rmse |  .3373542   .0346218
                     |  .0031309    .006944
                     | 
             modelse |   .031998   .0810475
                     |  .0075622   .0236804
                     | 
             ciwidth |  .1152771   .2752458
                     |  .0285414   .0916031
                     | 
            relerror |   410.972    144.059
                     |  241.0358   122.5251
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3306783  -.0198353
                     |   .001249   .0246767
                     | 
             pctbias | -33.06783  -1.983528
                     |  .1249049   2.467669
                     | 
                mean |  .6693217   .9801647
                     |   .001249   .0246767
                     | 
               empse |  .0024981   .0493534
                     |  .0010198   .0201484
                     | 
             relprec |             -99.7438
                     |             .2349471
                     | 
                 mse |  .1093528   .0022203
                     |  .0008232   .0007058
                     | 
                rmse |  .3306854   .0471196
                     |  .0012447   .0074899
                     | 
             modelse |  .0154644    .041329
                     |  .0030005    .012266
                     | 
             ciwidth |  .0569307   .1386518
                     |  .0120223   .0483799
                     | 
            relerror |  519.0473  -16.25904
                     |  279.8158   42.26636
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2452511  -.0136467
                     |  .0025051   .0192346
                     | 
             pctbias | -24.52511  -1.364672
                     |  .2505109   1.923459
                     | 
                mean |  .7547489   .9863533
                     |  .0025051   .0192346
                     | 
               empse |  .0050102   .0384692
                     |  .0020454    .015705
                     | 
             relprec |            -98.30376
                     |             1.241953
                     | 
                 mse |  .0601669   .0012961
                     |  .0012266   .0005189
                     | 
                rmse |  .2452895    .036002
                     |  .0025003   .0072065
                     | 
             modelse |  .0430642   .1991622
                     |  .0114689   .0567076
                     | 
             ciwidth |  .1497061    .684238
                     |  .0450349   .2170356
                     | 
            relerror |  759.5272   417.7188
                     |  418.9638   257.6858
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2311634  -.0126734
                     |  .0019764   .0211378
                     | 
             pctbias | -23.11634  -1.267339
                     |  .1976409    2.11378
                     | 
                mean |  .7688366   .9873266
                     |  .0019764   .0211378
                     | 
               empse |  .0039528   .0422756
                     |  .0016137   .0172589
                     | 
             relprec |            -99.12576
                     |             .9982012
                     | 
                 mse |  .0534482    .001501
                     |  .0009136    .000671
                     | 
                rmse |  .2311887   .0387432
                     |  .0019758   .0086595
                     | 
             modelse |  .0245827   .0931048
                     |  .0065105   .0316004
                     | 
             ciwidth |  .0850485   .2943301
                     |  .0261565   .1245907
                     | 
            relerror |  521.9039   120.2329
                     |  302.6359   116.9235
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2234324  -.0055521
                     |  .0010593   .0231768
                     | 
             pctbias | -22.34324  -.5552128
                     |  .1059282   2.317679
                     | 
                mean |  .7765676   .9944479
                     |  .0010593   .0231768
                     | 
               empse |  .0021186   .0463536
                     |  .0008649   .0189238
                     | 
             relprec |            -99.79111
                     |             .2352488
                     | 
                 mse |  .0499254   .0016423
                     |  .0004719   .0008071
                     | 
                rmse |  .2234399   .0405255
                     |   .001056   .0099576
                     | 
             modelse |  .0130503   .0475072
                     |  .0036431   .0144329
                     | 
             ciwidth |  .0444604   .1536722
                     |  .0146086   .0607305
                     | 
            relerror |  515.9968   2.488824
                     |  304.6516   52.15495
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1608412   .0056519
                     |  .0021303   .0149806
                     | 
             pctbias | -16.08412   .5651876
                     |   .213027   1.498062
                     | 
                mean |  .8391588   1.005652
                     |  .0021303   .0149806
                     | 
               empse |  .0042605   .0299612
                     |  .0017394   .0122316
                     | 
             relprec |            -97.97787
                     |             1.516738
                     | 
                 mse |  .0258835   .0007052
                     |  .0006914   .0005184
                     | 
                rmse |  .1608835   .0265556
                     |  .0021488   .0097615
                     | 
             modelse |  .0420298    .187592
                     |  .0138461   .0564975
                     | 
             ciwidth |  .1355498    .618624
                     |  .0540679   .2295209
                     | 
            relerror |  886.4888   526.1154
                     |  517.5025   317.6395
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1539701   .0027771
                     |  .0023353   .0190882
                     | 
             pctbias | -15.39701   .2777055
                     |  .2335309   1.908816
                     | 
                mean |  .8460299   1.002777
                     |  .0023353   .0190882
                     | 
               empse |  .0046706   .0381763
                     |  .0019068   .0155854
                     | 
             relprec |            -98.50321
                     |             1.390364
                     | 
                 mse |  .0237231   .0011008
                     |  .0007217   .0008065
                     | 
                rmse |  .1540232   .0331781
                     |  .0023427   .0121543
                     | 
             modelse |   .021175    .097242
                     |  .0062922     .03118
                     | 
             ciwidth |   .069706   .3076822
                     |   .026018   .1299118
                     | 
            relerror |  353.3655   154.7182
                     |  228.9239   132.2277
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1456492   .0096199
                     |  .0013029   .0201023
                     | 
             pctbias | -14.56492   .9619936
                     |  .1302864   2.010231
                     | 
                mean |  .8543508    1.00962
                     |  .0013029   .0201023
                     | 
               empse |  .0026057   .0402046
                     |  .0010638   .0164135
                     | 
             relprec |            -99.57995
                     |               .48484
                     | 
                 mse |  .0212188   .0013049
                     |  .0003808   .0011287
                     | 
                rmse |  .1456667   .0361227
                     |  .0013072   .0156229
                     | 
             modelse |  .0115309   .0541601
                     |   .003718   .0187616
                     | 
             ciwidth |  .0371517   .1662756
                     |   .014864   .0762129
                     | 
            relerror |  342.5213   34.71102
                     |  230.2102   72.12598
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1302398   .0079444
                     |  .0036257   .0161362
                     | 
             pctbias | -13.02398    .794445
                     |  .3625678   1.613621
                     | 
                mean |  .8697602   1.007944
                     |  .0036257   .0161362
                     | 
               empse |  .0072514   .0322724
                     |  .0029604   .0131752
                     | 
             relprec |            -94.95135
                     |             5.778615
                     | 
                 mse |  .0170018   .0008442
                     |  .0009553     .00066
                     | 
                rmse |  .1303911   .0290559
                     |  .0036633   .0113581
                     | 
             modelse |  .0362397   .1882711
                     |  .0117768   .0608961
                     | 
             ciwidth |  .1165248   .6057262
                     |  .0469116   .2434155
                     | 
            relerror |  399.7638   483.3807
                     |  260.7752   303.8546
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1262059    .001927
                     |  .0022687   .0208638
                     | 
             pctbias | -12.62059   .1927018
                     |  .2268715   2.086385
                     | 
                mean |  .8737941   1.001927
                     |  .0022687   .0208638
                     | 
               empse |  .0045374   .0417277
                     |  .0018524   .0170353
                     | 
             relprec |            -98.81758
                     |             1.160905
                     | 
                 mse |  .0159434   .0013096
                     |  .0005823   .0008639
                     | 
                rmse |  .1262671   .0361886
                     |  .0023056   .0119357
                     | 
             modelse |  .0218804    .107357
                     |  .0073862    .036377
                     | 
             ciwidth |  .0690343    .331822
                     |  .0293865    .149436
                     | 
            relerror |  382.2202   157.2799
                     |  255.4505   136.4991
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
moderate             |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1207927   .0102935
                     |  .0011073   .0191421
                     | 
             pctbias | -12.07927   1.029353
                     |  .1107317    1.91421
                     | 
                mean |  .8792073   1.010293
                     |  .0011073   .0191421
                     | 
               empse |  .0022146   .0382842
                     |  .0009041   .0156295
                     | 
             relprec |            -99.66537
                     |             .3575001
                     | 
                 mse |  .0145946   .0012052
                     |  .0002699   .0010924
                     | 
                rmse |   .120808   .0347162
                     |  .0011172   .0157338
                     | 
             modelse |  .0110427   .0557976
                     |  .0036034   .0197655
                     | 
             ciwidth |  .0351261   .1690926
                     |  .0146048   .0800984
                     | 
            relerror |  398.6262    45.7458
                     |  260.6002   78.77679
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
5%                   |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.4253688  -.0556226
                     |  .0020396   .0090367
                     | 
             pctbias | -42.53688  -5.562263
                     |  .2039588     .90367
                     | 
                mean |  .5746312   .9443774
                     |  .0020396   .0090367
                     | 
               empse |  .0040792   .0180734
                     |  .0016653   .0073784
                     | 
             relprec |            -94.90593
                     |             2.318606
                     | 
                 mse |  .1809511   .0033389
                     |  .0017411   .0009776
                     | 
                rmse |  .4253835   .0577829
                     |  .0020465   .0084592
                     | 
             modelse |  .0602618   .1790653
                     |  .0118695    .057403
                     | 
             ciwidth |   .222629   .5928993
                     |  .0455963   .2169228
                     | 
            relerror |  1377.303   890.7672
                     |  669.6309   514.2757
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
5%                   |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.4027674   -.047292
                     |  .0022123   .0183362
                     | 
             pctbias | -40.27674  -4.729199
                     |  .2212294   1.833619
                     | 
                mean |  .5972326    .952708
                     |  .0022123   .0183362
                     | 
               empse |  .0044246   .0366724
                     |  .0018063   .0149714
                     | 
             relprec |            -98.54431
                     |             1.163754
                     | 
                 mse |  .1622363   .0032452
                     |  .0017837   .0018061
                     | 
                rmse |  .4027856   .0569665
                     |  .0022142   .0158527
                     | 
             modelse |  .0327663   .0692517
                     |  .0075706   .0237089
                     | 
             ciwidth |  .1188665   .2218089
                     |   .028095   .0903551
                     | 
            relerror |  640.5505   88.83873
                     |   347.389   100.6133
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
5%                   |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.3938085  -.0558752
                     |  .0005315   .0253625
                     | 
             pctbias | -39.38086  -5.587523
                     |  .0531544   2.536248
                     | 
                mean |  .6061915   .9441248
                     |  .0005315   .0253625
                     | 
               empse |  .0010631    .050725
                     |   .000434   .0207084
                     | 
             relprec |            -99.95608
                     |             .0120086
                     | 
                 mse |   .155086   .0050518
                     |  .0004186   .0027063
                     | 
                rmse |  .3938096   .0710761
                     |  .0005315   .0190381
                     | 
             modelse |  .0179861   .0405742
                     |  .0038237   .0146685
                     | 
             ciwidth |  .0656661   .1256555
                     |   .014819   .0562936
                     | 
            relerror |  1591.872  -20.01143
                     |  778.7429   43.61881
                     | 
               cover |         0         50
                     |         0         25
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
10%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2969041  -.0244642
                     |  .0012912   .0267434
                     | 
             pctbias | -29.69041  -2.446418
                     |  .1291181   2.674344
                     | 
                mean |  .7030959   .9755358
                     |  .0012912   .0267434
                     | 
               empse |  .0025824   .0534869
                     |  .0010542   .0218359
                     | 
             relprec |             -99.7669
                     |             .2668916
                     | 
                 mse |   .088157   .0027441
                     |  .0007646   .0008922
                     | 
                rmse |  .2969125   .0523845
                     |  .0012876   .0085161
                     | 
             modelse |  .0437024   .1653311
                     |   .011154   .0479314
                     | 
             ciwidth |  .1525832   .5514243
                     |  .0449652   .1965931
                     | 
            relerror |  1592.343   209.1058
                     |   814.801   154.7739
                     | 
               cover |         0        100
                     |         0          0
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
10%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2812647  -.0189743
                     |  .0019939    .027235
                     | 
             pctbias | -28.12647  -1.897426
                     |  .1993942   2.723504
                     | 
                mean |  .7187353   .9810258
                     |  .0019939    .027235
                     | 
               empse |  .0039879   .0544701
                     |   .001628   .0222373
                     | 
             relprec |              -99.464
                     |             .1884941
                     | 
                 mse |  .0791218   .0025853
                     |  .0011203   .0008017
                     | 
                rmse |  .2812859   .0508455
                     |  .0019915   .0078839
                     | 
             modelse |  .0253914   .0816414
                     |  .0067858   .0285212
                     | 
             ciwidth |  .0876857   .2527478
                     |  .0271901   .1133385
                     | 
            relerror |   536.713   49.88311
                     |  310.6791   80.53485
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
10%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.2695917  -.0158506
                     |  .0016741   .0290547
                     | 
             pctbias | -26.95918   -1.58506
                     |  .1674083   2.905467
                     | 
                mean |  .7304083   .9841494
                     |  .0016741   .0290547
                     | 
               empse |  .0033482   .0581093
                     |  .0013669    .023723
                     | 
             relprec |            -99.66801
                     |             .2414329
                     | 
                 mse |  .0726881   .0027838
                     |  .0009035   .0008711
                     | 
                rmse |  .2696073   .0527614
                     |  .0016756   .0082548
                     | 
             modelse |  .0126236   .0452265
                     |  .0032776   .0164742
                     | 
             ciwidth |  .0440728   .1372846
                     |  .0129898   .0647631
                     | 
            relerror |  277.0297  -22.16997
                     |  182.4133   42.58317
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
20%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.200364   .0011584
                     |  .0017651   .0212808
                     | 
             pctbias |  -20.0364   .1158372
                     |  .1765071   2.128085
                     | 
                mean |   .799636   1.001158
                     |  .0017651   .0212808
                     | 
               empse |  .0035301   .0425617
                     |  .0014412   .0173757
                     | 
             relprec |            -99.31207
                     |             .7033059
                     | 
                 mse |  .0401551     .00136
                     |  .0007054   .0008925
                     | 
                rmse |  .2003873   .0368777
                     |    .00176   .0121007
                     | 
             modelse |  .0398768   .1856197
                     |  .0125081   .0644858
                     | 
             ciwidth |  .1313308   .5807846
                     |  .0489433   .2530576
                     | 
            relerror |  1029.608   336.1193
                     |  581.5615   233.7856
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
20%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.189072   .0035396
                     |   .002001   .0266249
                     | 
             pctbias |  -18.9072   .3539637
                     |  .2000985   2.662492
                     | 
                mean |   .810928    1.00354
                     |   .002001   .0266249
                     | 
               empse |   .004002   .0532498
                     |  .0016338   .0217392
                     | 
             relprec |            -99.43518
                     |             .5400288
                     | 
                 mse |  .0357602   .0021392
                     |  .0007617   .0015487
                     | 
                rmse |  .1891037   .0462514
                     |  .0020139   .0167425
                     | 
             modelse |  .0229117   .0961886
                     |  .0074339   .0350634
                     | 
             ciwidth |  .0740076   .2886312
                     |  .0293776   .1400722
                     | 
            relerror |  472.5113   80.63647
                     |  298.5526   98.86395
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
20%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1820389   .0075999
                     |  .0010592   .0263996
                     | 
             pctbias | -18.20389   .7599935
                     |  .1059195   2.639965
                     | 
                mean |  .8179612     1.0076
                     |  .0010592   .0263996
                     | 
               empse |  .0021184   .0527993
                     |  .0008648   .0215552
                     | 
             relprec |            -99.83903
                     |             .1843968
                     | 
                 mse |  .0331415   .0021486
                     |  .0003861    .001789
                     | 
                rmse |  .1820481   .0463528
                     |  .0010604   .0192975
                     | 
             modelse |  .0111297   .0517259
                     |  .0034377   .0176217
                     | 
             ciwidth |  .0364236   .1589052
                     |  .0138649    .072713
                     | 
            relerror |   425.387  -2.032892
                     |  268.9604   52.09108
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
30%                  |
5                    |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias |  -.158879   .0181774
                     |   .002951   .0240243
                     | 
             pctbias |  -15.8879   1.817736
                     |  .2950958   2.402433
                     | 
                mean |  .8411211   1.018177
                     |   .002951   .0240243
                     | 
               empse |  .0059019   .0480487
                     |  .0024094   .0196158
                     | 
             relprec |            -98.49123
                     |             1.736069
                     | 
                 mse |  .0252686   .0020619
                     |  .0009262   .0019137
                     | 
                rmse |  .1589611   .0454084
                     |  .0029133   .0210721
                     | 
             modelse |  .0368031   .1850137
                     |  .0116517   .0607879
                     | 
             ciwidth |   .119041   .5829769
                     |  .0470525   .2490727
                     | 
            relerror |  523.5792   285.0548
                     |  322.1549   201.7841
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
30%                  |
10                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1528135    .013804
                     |  .0019745    .025138
                     | 
             pctbias | -15.28135   1.380402
                     |  .1974481   2.513805
                     | 
                mean |  .8471864   1.013804
                     |  .0019745    .025138
                     | 
               empse |   .003949   .0502761
                     |  .0016122   .0205251
                     | 
             relprec |            -99.38306
                     |             .6653993
                     | 
                 mse |  .0233637   .0020863
                     |  .0006018   .0017951
                     | 
                rmse |  .1528518   .0456762
                     |  .0019686   .0196507
                     | 
             modelse |  .0214232   .0942634
                     |  .0069724   .0318399
                     | 
             ciwidth |  .0683361   .2908737
                     |  .0281802   .1315637
                     | 
            relerror |  442.5022   87.49152
                     |  283.2417   99.34555
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
---------------------+---------------------
1                    |
strong               |
30%                  |
20                   |
             estreps |         4          4
                     |                     
                     | 
              sereps |         4          4
                     |                     
                     | 
                bias | -.1458269   .0253678
                     |  .0006123   .0235786
                     | 
             pctbias | -14.58269   2.536784
                     |  .0612252   2.357863
                     | 
                mean |  .8541731   1.025368
                     |  .0006123   .0235786
                     | 
               empse |  .0012245   .0471573
                     |  .0004999   .0192519
                     | 
             relprec |            -99.93257
                     |             .0776704
                     | 
                 mse |  .0212666   .0023114
                     |  .0001782    .002275
                     | 
                rmse |  .1458308   .0480768
                     |   .000611   .0236605
                     | 
             modelse |  .0106914   .0542291
                     |  .0034144    .017852
                     | 
             ciwidth |  .0342909   .1675152
                     |   .013911   .0755565
                     | 
            relerror |  773.1219   14.99617
                     |  452.5578   60.30848
                     | 
               cover |         0         75
                     |         0   21.65063
                     | 
               power |       100        100
                     |         0          0
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot if `useit4', xtitle("test x-title") name("lollyplot_test7", replace)
Performance measures not specified: defaulting to bias empse cover
Ignoring non-varying dgm variable theta
Ignoring non-varying dgm variable rho
Ignoring non-varying dgm variable k
siman lollyplot will draw 1 graph with 12 panels (3 PMs by 4 DGMs)

. * without -if k==5- you get "too many sersets" error
. 
. siman nestloop mean, dgmorder(-theta rho -pc -k) ylabel(0.2 0.5 1) ytitle("Odds ratio") name("nest
> loop_test7", replace)
siman nestloop will draw 1 graphs (1 targets * 1 performance measures)

. 
. 
. /*
> * Testing warning messages correspond to the number of panels/graphs that will be printed
> * VERY LONG
> 
> clear all
> prog drop _all
> use $testpath/data/extendedtestdata.dta, clear
> order beta pmiss
> 
> * create a string dgm var as well for testing
> gen betastring = "0"
> replace betastring = "0.25" if beta == 2
> replace betastring = "0.5" if beta == 3
> drop beta
> rename betastring beta
> 
> siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(beta
> true)
> 
> * scatter
> siman scatter
> siman scatter if method == "CCA"
> siman scatter if estimand == "effect"
> siman scatter if mech =="MCAR": mech
>         * this means the value whose label is "MCAR" in the value label mech
> 
> siman scatter, by(pmiss)
> siman scatter, by(estimand)
> siman scatter, by(method)
> 
> * swarm, requires 2 methods
> siman swarm
> siman swarm if (method == "CCA" | method == "MeanImp")
> siman swarm if estimand == "effect"
> siman swarm if mech =="MCAR": mech
> 
> siman swarm, by(pmiss)
> siman swarm, by(estimand)
> 
> * blandaltman
> siman blandaltman
> siman blandaltman if estimand == "effect"
> siman blandaltman if mech =="MCAR": mech
> 
> siman blandaltman, by(pmiss)
> 
> siman blandaltman, methlist(Noadj MeanImp)
> 
> * comparemethodsscatter
> siman comparemethodsscatter
> siman comparemethodsscatter if estimand == "effect"
> siman comparemethodsscatter if mech =="MCAR": mech
> 
> siman comparemethodsscatter, methlist(Noadj MeanImp)
> 
> * zipplot
> siman zipplot
> siman zipplot if method == "CCA" 
> siman zipplot if estimand == "effect"
> siman zipplot if mech =="MCAR": mech
> 
> siman zipplot, by(pmiss)
> siman zipplot, by(method)
> */
. 
. 
. di as result "*** SIMAN GRAPHS HAVE PASSED ALL THE TESTS IN `filename'.do ***"
*** SIMAN GRAPHS HAVE PASSED ALL THE TESTS IN testing_graphs_main.do ***

. 
. log close
