
. siman which
C:\ian\git\siman\siman.ado
*!version 0.3  08aug2023
C:\ian\git\siman\siman_setup.ado
*!    version 0.8.8  14feb2024    
C:\ian\git\siman\siman_describe.ado
*! version 0.5.1   13mar2024
C:\ian\git\siman\siman_analyse.ado
*! version 0.6.15 14mar2024
C:\ian\git\siman\siman_table.ado
*! version 0.8.2   20dec2023
C:\ian\git\siman\siman_reshape.ado
*!  version 0.3.4   06nov2023
C:\ian\git\siman\siman_lollyplot.ado
*! version 1.13.2  15dec2023
C:\ian\git\siman\siman_zipplot.ado
*! version 1.8.12 25oct2023
C:\ian\git\siman\siman_comparemethodsscatter.ado
*! version 1.9.18 25oct2023
C:\ian\git\siman\siman_blandaltman.ado
*! version 1.6.11 16oct2023  EMZ produce error message if >=, <= or methlist(x/y) is used.
C:\ian\git\siman\siman_swarm.ado
*! version 1.9.7 03oct2023
C:\ian\git\siman\siman_scatter.ado
*! version 1.6.7 03oct2023
C:\ian\git\siman\siman_nestloop.ado
*! version 1.8.2   17aug2023

. 
.  
. * dgm defined by 1 variable
. use $testpath/data/simlongESTPM_longE_longM.dta, clear

. encode estimand, gen(estimand_num)

. drop estimand

. rename estimand_num estimand

. label define methodl 1 "A" 2 "B"

. label values method methodl

. gen dgm_str = ""
(8,000 missing values generated)

. replace dgm_str = "1" if dgm == 1
(4,000 real changes made)

. replace dgm_str = "2" if dgm == 2
(4,000 real changes made)

. drop dgm true

. rename dgm_str dgm

. 
. siman_setup, rep(rep) dgm(dgm) target(estimand) method(method) estimate(est) se(se) true(0)
  variable dgm was long now byte
  (24,000 bytes saved)
Warning: variable dgm, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode dgm
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         2
The target values are:            beta gamma

The number of methods is:         2
The method values are:            A B

Data generating mechanism (dgm)
The total number of dgms is:      2
The dgm variables (# levels):     dgm (2) 

Estimates are contained in the dataset

The estimates variable is:        est
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             _true
_____________________________________________________

. 
. 
. siman scatter
working.....

. if ${detail} == 1 siman scatter est se, name(est_onyaxis)
working.....

. if ${detail} == 1 siman scatter se est, name(se_onyaxis)
working.....

. * 1 panel per dgm, method and target combination
. 
. if ${detail} == 1 siman scatter, by(dgm)
working.....

. * by dgm only
. if ${detail} == 1 siman scatter if dgm == 1, by(method)
working.....

. * by method only
. if ${detail} == 1 siman scatter, by(estimand)
working.....

. * by estimand only
. 
. siman swarm
working.....

. * 1 panel per dgm and target combination, method on y-axis
. if ${detail} == 1 siman swarm if estimand == 1
working.....

. if ${detail} == 1 siman swarm if estimand == 2
working.....

. 
. siman comparemethodsscatter 
Working.....

. * 1 graph per dgm and target, comparing methods
. if ${detail} == 1 siman comparemethodsscatter if estimand == 1
Working.....

. * metlist option too
. 
. siman blandaltman 
working....

. * 1 graph per dgm and target combination, comparison of methods
. if ${detail} == 1 siman blandaltman if dgm ==1
working....

. if ${detail} == 1 siman blandaltman if estimand == 2
working....

. 
. siman zipplot

. * 1 panel per dgm, method and target combination
. if ${detail} == 1 siman zipplot, by(estimand) 

. if ${detail} == 1 siman zipplot, by(method) 

. 
. siman analyse
siman analyse has run successfully

-------------------------------------------
dgm, estimand and    |        method       
performance measure  |         A          B
---------------------+---------------------
1                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0043991  -.0025973
                     |  .0024993   .0035644
                     | 
               empse |  .0790336   .1127159
                     |  .0017681   .0025217
                     | 
             relprec |             -50.8353
                     |              2.28676
                     | 
                 mse |  .0062594   .0126989
                     |  .0002881   .0006187
                     | 
                rmse |  .0791165   .1126895
                     |  .0018209   .0027454
                     | 
             modelse |  .0787452   .1136343
                     |  .0001572   .0003405
                     | 
             ciwidth |  .3080681   .4434751
                     |  .0006123   .0013217
                     | 
            relerror | -.3649609   .8147949
                     |  2.237882   2.275551
                     | 
               cover |      94.7       95.7
                     |  .7084563   .6414907
                     | 
               power |       5.3        4.3
                     |  .7084561   .6414905
---------------------+---------------------
1                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005151   .0056354
                     |  .0025476   .0035789
                     | 
               empse |  .0805615   .1131762
                     |  .0018023    .002532
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0064839   .0128278
                     |  .0002847   .0005329
                     | 
                rmse |  .0805229   .1132599
                     |  .0017676   .0023524
                     | 
             modelse |  .0788425   .1140264
                     |  .0001466   .0003426
                     | 
             ciwidth |  .3085282   .4450112
                     |  .0005716   .0013243
                     | 
            relerror | -2.133844   .7512448
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
---------------------+---------------------
2                    |
beta                 |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
             pctbias |                     
                     |                     
                     | 
                mean | -.0046965  -.0058509
                     |  .0028908   .0039932
                     | 
               empse |  .0914144   .1262755
                     |  .0020451    .002825
                     | 
             relprec |            -47.59274
                     |             2.430245
                     | 
                 mse |  .0083703   .0159638
                     |  .0003797   .0007445
                     | 
                rmse |  .0914893   .1263479
                     |  .0020748   .0029462
                     | 
             modelse |  .0910296   .1313619
                     |  .0001752   .0003826
                     | 
             ciwidth |   .356176   .5127883
                     |   .000683   .0014841
                     | 
            relerror |  -.420924   4.028049
                     |  2.236001   2.346937
                     | 
               cover |        95       95.6
                     |  .6892024   .6485677
                     | 
               power |         5        4.4
                     |  .6892024   .6485677
---------------------+---------------------
2                    |
gamma                |
               bsims |      1000       1000
                     |                     
                     | 
              sesims |      1000       1000
                     |                     
                     | 
                bias |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
             pctbias |                     
                     |                     
                     | 
                mean |  .0005948   .0065072
                     |  .0029417   .0041326
                     | 
               empse |  .0930244   .1306846
                     |  .0020811   .0029237
                     | 
             relprec |            -49.33068
                     |             2.314097
                     | 
                 mse |  .0086452   .0171037
                     |  .0003795   .0007105
                     | 
                rmse |  .0929798   .1307813
                     |   .002041   .0027163
                     | 
             modelse |  .0910394   .1316664
                     |  .0001693   .0003955
                     | 
             ciwidth |  .3562577   .5138547
                     |  .0006601   .0015292
                     | 
            relerror | -2.133846    .751246
                     |  2.196998   2.274225
                     | 
               cover |      94.5       96.4
                     |  .7209369   .5891009
                     | 
               power |       5.5        3.6
                     |  .7209369    .589101
-------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot
Performance measures not specified: defaulting to bias empse cover
Drawing 2 graphs (one per target)...

. 
. serset clear

. siman nestloop
Performance measures not specified: defaulting to bias empse cover
Drawing 6 graphs (2 targets * 3 performance measures)...

. 
. 
. * dgm defined by >1 variable
. use $testpath/data/extendedtestdata.dta, clear

. 
. * create true values, corrected 25oct2023
. gen betatrue = beta if estimand == "effect"
(72,000 missing values generated)

. replace betatrue = 1 if estimand == "mean0"
(36,000 real changes made)

. replace betatrue = 1 + beta if estimand == "mean1"
(36,000 real changes made)

. 
. * remove non-integer values
. foreach var in beta pmiss {
  2.         gen `var'char = strofreal(`var')
  3.         drop `var'
  4.         sencode `var'char, gen(`var')
  5.         drop `var'char
  6. }

. order beta pmiss

. 
. * create a string dgm var as well for testing
. gen betastring = "0"

. replace betastring = "0.25" if beta == 2
variable betastring was str1 now str4
(36,000 real changes made)

. replace betastring = "0.5" if beta == 3
(36,000 real changes made)

. drop beta

. rename betastring beta

. 
. siman_setup, rep(rep) dgm(beta pmiss mech) method(method) target(estimand) est(b) se(se) true(beta
> true)
  variable beta was long now byte
  (324,000 bytes saved)
Warning: variable beta, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode beta
  as numeric before running -siman setup-.
  variable mech was long now byte
  (324,000 bytes saved)
Warning: variable mech, which appears in dgm(), was stored as a string. It has been encoded as
  numeric so that subsequent siman commands will work. If you require a different order, encode mech
  as numeric before running -siman setup-.

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         3
The target values are:            effect mean0 mean1

The number of methods is:         3
The method values are:            CCA MeanImp Noadj

Data generating mechanism (dgm)
The total number of dgms is:      12
The dgm variables (# levels):     beta (3) pmiss (2) mech (2) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             betatrue
_____________________________________________________

. 
. siman scatter
working.....
Warning: 108 panels will be created: consider using 'if' condition or 'by' option as detailed in
  siman scatter

. * 1 panel per dgm, target and method 
. if ${detail} == 1 siman scatter if method == "CCA"
working.....
Warning: 36 panels will be created: consider using 'if' condition or 'by' option as detailed in
  siman scatter

. 
. siman swarm
working.....
Warning: 36 panels will be created: consider using 'if' or 'by' options as detailed in siman swarm

. * 1 panel per dgm level(s) and target, method on y-axis
. * for the first panel in the all-graph display (beta level 1, pmiss level 1, mech level 1, estiman
> d == "effect"), the means per
. * method have a very small difference, visible as follows:
. if ${detail} == 1 siman swarm if beta == 1 & pmiss == 1 & mech == 1 & estimand == "effect"
working.....

. * FYI:
. * mean method CCA: 0.0025341
. * mean method meanlmp: 0.0021761
. * mean noadj: -0.0034964
. 
. serset clear

. * siman comparemethodsscatter
. * one graph per dgm and target combination, comparing methods - too slow
. siman comparemethodsscatter if beta == 1 & pmiss == 1 & mech == 2 
Working.....

. * one graph per target, comparing methods
. 
. siman blandaltman if beta == 1 & pmiss == 2 & mech == 2
working....

. * 1 graph per combination of dgm levels and target, by method difference
. 
. siman zipplot
Warning: 6 graphs each of 18 panels will be created: consider using 'if' condition or 'by' option as
  detailed in siman zipplot Drawing 6 graphs (1 per true value)

. * 1 panel per dgm, target and method combination, 1 graph per beta (as defines y-axis)
. 
. * different spelling
. siman analyze
siman analyse has run successfully

------------------------------------------------------
beta, pmiss, mech,   |
estimand and         |             method             
performance measure  |       CCA    MeanImp      Noadj
---------------------+--------------------------------
0                    |
.2                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0025341   .0021761  -.0034964
                     |  .0050018   .0048248   .0060434
                     | 
             pctbias |                                
                     |                                
                     | 
                mean |  .0025341   .0021761  -.0034964
                     |  .0050018   .0048248   .0060434
                     | 
               empse |  .1581701   .1525731   .1911095
                     |  .0035386   .0034133   .0042755
                     | 
             relprec |             7.471377    -31.501
                     |             3.958131   3.397247
                     | 
                 mse |  .0249992     .02326   .0364985
                     |  .0010772   .0009486   .0015959
                     | 
                rmse |  .1581113   .1525123   .1910459
                     |  .0034066     .00311   .0041767
                     | 
             modelse |  .1590372   .1556693   .2002325
                     |  .0003068   .0002637   .0003076
                     | 
             ciwidth |  .6222619   .6093404   .7839791
                     |  .0011989   .0010317   .0012007
                     | 
            relerror |  .5482441   2.029298   4.773726
                     |  2.257802    2.28912   2.349504
                     | 
               cover |      95.6       96.4         96
                     |  .6485677   .5891009   .6196774
                     | 
               power |       4.4        3.6          4
                     |  .6485677    .589101   .6196774
---------------------+--------------------------------
0                    |
.2                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0043802  -.0038922  -.0010559
                     |  .0034357   .0039994   .0044315
                     | 
             pctbias | -.4380242  -.3892164  -.1055921
                     |  .3435739   .3999397   .4431542
                     | 
                mean |  .9956198   .9961078   .9989441
                     |  .0034357   .0039994   .0044315
                     | 
               empse |  .1086476    .126472   .1401377
                     |  .0024306   .0028294   .0031351
                     | 
             relprec |            -26.20087  -39.89225
                     |             3.405392   2.978411
                     | 
                 mse |  .0118117   .0159943     .01962
                     |  .0005087   .0007259   .0008612
                     | 
                rmse |  .1086816   .1264687   .1400715
                     |  .0023403     .00287   .0030742
                     | 
             modelse |  .1124467   .1099436   .1415858
                     |  .0002233   .0001861   .0002175
                     | 
             ciwidth |  .4399201   .4303562   .5543569
                     |  .0008721    .000728    .000849
                     | 
            relerror |  3.496694  -13.06887   1.033348
                     |  2.324521   1.950369   2.265628
                     | 
               cover |        96       91.9       95.2
                     |  .6196774   .8627803   .6759884
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.2                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0018461   -.001716  -.0045523
                     |  .0036401   .0040642   .0044155
                     | 
             pctbias | -.1846102  -.1716031  -.4552272
                     |  .3640138   .4064189   .4415471
                     | 
                mean |  .9981539    .998284   .9954478
                     |  .0036401   .0040642   .0044155
                     | 
               empse |  .1151113    .128521   .1396295
                     |  .0025753   .0028753   .0031238
                     | 
             relprec |            -19.77907   -32.0356
                     |             3.561042   3.356048
                     | 
                 mse |  .0132408   .0165041   .0194976
                     |  .0005738   .0007252   .0009102
                     | 
                rmse |  .1150685   .1284681   .1396338
                     |  .0024935   .0028225   .0032592
                     | 
             modelse |  .1124886   .1099436   .1415858
                     |  .0002289   .0001861   .0002175
                     | 
             ciwidth |  .4400418   .4303562   .5543569
                     |  .0008935    .000728    .000849
                     | 
            relerror | -2.278399  -14.45476   1.401075
                     |  2.195239   1.919276   2.273874
                     | 
               cover |      95.1       90.4       94.7
                     |  .6826347   .9315792   .7084563
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.2                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0051652   .0069042   .0063999
                     |  .0050357   .0049677   .0062144
                     | 
             pctbias |                                
                     |                                
                     | 
                mean |  .0051652   .0069042   .0063999
                     |  .0050357   .0049677   .0062144
                     | 
               empse |  .1592432   .1570932   .1965152
                     |  .0035626   .0035145   .0043964
                     | 
             relprec |             2.755958  -34.33562
                     |              3.92513   3.254202
                     | 
                 mse |  .0253597   .0247013   .0386206
                     |  .0011447   .0010991   .0017162
                     | 
                rmse |  .1592474   .1571664   .1965211
                     |  .0035942   .0034967   .0043665
                     | 
             modelse |  .1586639   .1575551   .1997631
                     |  .0002984   .0002747   .0003192
                     | 
             ciwidth |  .6208577   .6166729   .7820668
                     |  .0011663    .001073   .0012456
                     | 
            relerror | -.3638003   .2940331   1.652786
                     |  2.236912   2.250566   2.279957
                     | 
               cover |      95.3       95.8       95.5
                     |  .6692606   .6343183   .6555532
                     | 
               power |       4.7        4.2        4.5
                     |  .6692608   .6343185   .6555532
---------------------+--------------------------------
0                    |
.2                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0002823  -.0030683  -.0028161
                     |  .0035256   .0039993   .0043733
                     | 
             pctbias |  .0282293  -.3068284  -.2816139
                     |  .3525591   .3999281   .4373308
                     | 
                mean |  1.000282   .9969317   .9971839
                     |  .0035256   .0039993   .0043733
                     | 
               empse |   .111489   .1264684   .1382961
                     |  .0024942   .0028293   .0030939
                     | 
             relprec |            -22.28588  -35.01042
                     |             3.553124    3.21204
                     | 
                 mse |  .0124174   .0159877   .0191146
                     |  .0005255   .0006866   .0008108
                     | 
                rmse |  .1114336   .1264424   .1382557
                     |  .0023581    .002715   .0029322
                     | 
             modelse |  .1133514   .1112796   .1412539
                     |  .0002246   .0001941   .0002257
                     | 
             ciwidth |  .4434629   .4355492   .5530047
                     |  .0008774   .0007582   .0008808
                     | 
            relerror |  1.670485  -12.00996   2.138705
                     |  2.283466   1.974473   2.290856
                     | 
               cover |      95.4       91.2       95.4
                     |  .6624499   .8958573   .6624499
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.2                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0054474   .0038359   .0035837
                     |  .0036017    .004159   .0045974
                     | 
             pctbias |  .5447446   .3835891   .3583745
                     |   .360167   .4158996   .4597352
                     | 
                mean |  1.005447   1.003836   1.003584
                     |  .0036017    .004159   .0045974
                     | 
               empse |  .1138948    .131519    .145381
                     |   .002548   .0029423   .0032524
                     | 
             relprec |            -25.00526  -38.62488
                     |             3.301581   2.976425
                     | 
                 mse |  .0129887   .0172947   .0211274
                     |   .000604   .0007995   .0009803
                     | 
                rmse |  .1139681   .1315092   .1453525
                     |  .0026499   .0030398   .0033721
                     | 
             modelse |   .113427   .1112796   .1412539
                     |  .0002256   .0001941   .0002257
                     | 
             ciwidth |  .4437514   .4355492   .5530047
                     |  .0008817   .0007582   .0008808
                     | 
            relerror | -.4107688  -15.38898  -2.838857
                     |  2.236787   1.898649   2.179215
                     | 
               cover |      94.6       90.8       94.4
                     |  .7147308   .9139802   .7270762
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.4                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0040346  -.0106284  -.0075639
                     |  .0058504   .0054603   .0064138
                     | 
             pctbias |                                
                     |                                
                     | 
                mean | -.0040346  -.0106284  -.0075639
                     |  .0058504   .0054603   .0064138
                     | 
               empse |  .1850048   .1726695   .2028226
                     |  .0041389   .0038629   .0045375
                     | 
             relprec |             14.79805  -16.79807
                     |             5.443054   4.371892
                     | 
                 mse |  .0342088   .0298979   .0411531
                     |  .0014917   .0013962   .0018602
                     | 
                rmse |  .1849563   .1729101   .2028622
                     |  .0040326   .0040372    .004585
                     | 
             modelse |  .1843259   .1682872   .2005376
                     |  .0004201   .0002874   .0003196
                     | 
             ciwidth |  .7207052   .6587221   .7851013
                     |    .00163   .0011208   .0012489
                     | 
            relerror | -.3669457  -2.537951   -1.12658
                     |  2.240513   2.186753   2.217587
                     | 
               cover |      94.4       94.1       94.4
                     |  .7270762   .7451108   .7270762
                     | 
               power |       5.6        5.9        5.6
                     |  .7270764   .7451108   .7270764
---------------------+--------------------------------
0                    |
.4                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |   .000462   .0008812   -.000651
                     |  .0041282   .0042365    .004576
                     | 
             pctbias |  .0462043   .0881226  -.0651027
                     |  .4128213   .4236481   .4575971
                     | 
                mean |  1.000462   1.000881    .999349
                     |  .0041282   .0042365    .004576
                     | 
               empse |  .1305456   .1339693   .1447049
                     |  .0029205   .0029971   .0032373
                     | 
             relprec |            -5.045934  -18.61251
                     |             4.802574   4.287085
                     | 
                 mse |  .0170253   .0179306    .020919
                     |  .0007045   .0007746   .0008935
                     | 
                rmse |  .1304811   .1339052    .144634
                     |  .0026998   .0028925   .0030887
                     | 
             modelse |  .1305939   .1188526   .1418015
                     |  .0003286   .0002027    .000226
                     | 
             ciwidth |   .510349   .4652237   .5551504
                     |  .0012674   .0007903   .0008831
                     | 
            relerror |  .0370401  -11.28368   -2.00644
                     |  2.252127   1.990506   2.197853
                     | 
               cover |      94.7       91.9       94.3
                     |  .7084563   .8627803   .7331505
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.4                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0035725  -.0097472  -.0082149
                     |  .0040727   .0041946   .0045016
                     | 
             pctbias | -.3572548  -.9747202  -.8214949
                     |  .4072705   .4194598   .4501559
                     | 
                mean |  .9964275   .9902528    .991785
                     |  .0040727   .0041946   .0045016
                     | 
               empse |  .1287902   .1326448   .1423518
                     |  .0028813   .0029675   .0031847
                     | 
             relprec |            -5.727448  -18.14595
                     |             4.702864   4.260022
                     | 
                 mse |  .0165831   .0176721   .0203112
                     |  .0007359   .0008387   .0009525
                     | 
                rmse |  .1287754   .1329363   .1425175
                     |  .0028572   .0031544   .0033416
                     | 
             modelse |  .1300832   .1188526   .1418015
                     |  .0003176   .0002027    .000226
                     | 
             ciwidth |  .5084248   .4652237   .5551504
                     |  .0012332   .0007903   .0008831
                     | 
            relerror |  1.003914  -10.39784   -.386567
                     |  2.273066   2.010381   2.234185
                     | 
               cover |      95.9         92       94.7
                     |  .6270486   .8579044   .7084563
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.4                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |   -.00534   .0017957   .0038512
                     |  .0058944   .0057885   .0063535
                     | 
             pctbias |                                
                     |                                
                     | 
                mean |   -.00534   .0017957   .0038512
                     |  .0058944   .0057885   .0063535
                     | 
               empse |  .1863973   .1830487   .2009145
                     |  .0041701   .0040951   .0044948
                     | 
             relprec |             3.692184  -13.92896
                     |             5.141973   4.535763
                     | 
                 mse |  .0347377   .0334766   .0403411
                     |  .0016028   .0014745   .0017617
                     | 
                rmse |  .1863806    .182966   .2008509
                     |  .0042998   .0040294   .0043855
                     | 
             modelse |  .1830743   .1775443   .1997327
                     |  .0004151   .0003043   .0003129
                     | 
             ciwidth |  .7158127     .69494    .781976
                     |  .0016184   .0011923   .0012275
                     | 
            relerror | -1.782753  -3.007068  -.5881864
                     |   2.20856    2.17627   2.229474
                     | 
               cover |      94.2       93.9       95.1
                     |  .7391618   .7568288   .6826347
                     | 
               power |       5.8        6.1        4.9
                     |  .7391617   .7568289   .6826346
---------------------+--------------------------------
0                    |
.4                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0009617  -.0026523  -.0036801
                     |  .0045246   .0041852   .0043757
                     | 
             pctbias | -.0961663   -.265235  -.3680087
                     |  .4524592   .4185209   .4375716
                     | 
                mean |  .9990383   .9973477   .9963199
                     |  .0045246   .0041852   .0043757
                     | 
               empse |  .1430802   .1323479   .1383723
                     |   .003201   .0029609   .0030956
                     | 
             relprec |             16.87576   6.920382
                     |             6.429841   6.006739
                     | 
                 mse |  .0204524   .0175055   .0191413
                     |  .0009372    .000719   .0007879
                     | 
                rmse |  .1430118   .1323083   .1383521
                     |  .0032765   .0027172   .0028474
                     | 
             modelse |  .1421672   .1253868   .1412324
                     |  .0003872   .0002146   .0002212
                     | 
             ciwidth |  .5552768   .4907883   .5529405
                     |  .0014956   .0008408   .0008679
                     | 
            relerror | -.6380477  -5.259725   2.066927
                     |  2.239327   2.125709   2.289019
                     | 
               cover |      94.6       93.3       95.5
                     |  .7147308   .7906388   .6555532
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0                    |
.4                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0063016  -.0008566   .0001711
                     |  .0045477   .0043392   .0045417
                     | 
             pctbias | -.6301643  -.0856612   .0171126
                     |  .4547732   .4339167   .4541733
                     | 
                mean |  .9936984   .9991434   1.000171
                     |  .0045477   .0043392   .0045417
                     | 
               empse |  .1438119   .1372165   .1436222
                     |  .0032173   .0030698   .0032131
                     | 
             relprec |             9.844188   .2643282
                     |             5.858572     5.4393
                     | 
                 mse |  .0207009   .0188103   .0206067
                     |  .0009174   .0008312   .0009067
                     | 
                rmse |  .1438781   .1371505   .1435505
                     |   .003188   .0030302   .0031581
                     | 
             modelse |  .1422711   .1253868   .1412324
                     |  .0004004   .0002146   .0002212
                     | 
             ciwidth |  .5555292   .4907883   .5529405
                     |  .0015526   .0008408   .0008679
                     | 
            relerror | -1.071406  -8.621186  -1.663993
                     |  2.230659   2.050287   2.205347
                     | 
               cover |      93.7       93.2         95
                     |  .7683165   .7960906   .6892024
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.2                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0027473   .0005009  -.0015566
                     |  .0050655   .0049291   .0063368
                     | 
             pctbias |  1.098923   .2003606  -.6226373
                     |  2.026209   1.971655   2.534731
                     | 
                mean |  .2527473   .2505009   .2484434
                     |  .0050655   .0049291   .0063368
                     | 
               empse |  .1601859    .155873   .2003881
                     |  .0035837   .0034872   .0044831
                     | 
             relprec |             5.610406   -36.0994
                     |             3.822774   3.145098
                     | 
                 mse |  .0256414   .0242724   .0401176
                     |  .0011251   .0011662    .001826
                     | 
                rmse |  .1601294   .1557959   .2002939
                     |  .0035131   .0037426   .0045584
                     | 
             modelse |   .158477   .1553216   .1998129
                     |  .0002866   .0002626   .0003235
                     | 
             ciwidth |  .6202054     .60798   .7822268
                     |  .0011221   .0010292   .0012676
                     | 
            relerror |  -1.06681  -.3537511   -.287028
                     |  2.220538   2.235628   2.236598
                     | 
               cover |      94.6       95.1       94.3
                     |  .7147308   .6826347   .7331505
                     | 
               power |      35.6       34.9       23.5
                     |  1.514147   1.507312   1.340802
---------------------+--------------------------------
0.25                 |
.2                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0046613  -.0053978   -.004369
                     |  .0036465   .0041445   .0045289
                     | 
             pctbias |  -.466126   -.539777  -.4369023
                     |  .3646494   .4144524   .4528905
                     | 
                mean |  .9953387   .9946022    .995631
                     |  .0036465   .0041445   .0045289
                     | 
               empse |  .1153123   .1310613   .1432165
                     |  .0025798   .0029321    .003204
                     | 
             relprec |            -22.58915  -35.17168
                     |             3.372301   3.178906
                     | 
                 mse |  .0133054    .017189   .0205096
                     |  .0005851   .0007573   .0009268
                     | 
                rmse |  .1153488    .131107   .1432116
                     |  .0025361   .0028879   .0032359
                     | 
             modelse |  .1120492   .1096937   .1412891
                     |   .000209   .0001854   .0002287
                     | 
             ciwidth |  .4384659   .4293774   .5531179
                     |  .0008165   .0007266   .0008963
                     | 
            relerror | -2.829776  -16.30358   -1.34585
                     |  2.181421   1.877781   2.212848
                     | 
               cover |      93.7       90.7       94.5
                     |  .7683165   .9184281   .7209369
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.2                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  -.001914  -.0048969  -.0059256
                     |  .0034785   .0039931   .0045322
                     | 
             pctbias |  -.153116  -.3917496  -.4740491
                     |  .2782773   .3194476   .3625721
                     | 
                mean |  1.248086   1.245103   1.244074
                     |  .0034785   .0039931   .0045322
                     | 
               empse |  .1099988   .1262728   .1433192
                     |  .0024609    .002825   .0032063
                     | 
             relprec |            -24.11494  -41.09301
                     |              3.44376   2.871909
                     | 
                 mse |  .0120913   .0159528    .020555
                     |  .0005686   .0007398    .000982
                     | 
                rmse |  .1099604   .1263046   .1433701
                     |  .0025856   .0029287   .0034247
                     | 
             modelse |  .1120856   .1096937   .1412891
                     |  .0002164   .0001854   .0002287
                     | 
             ciwidth |  .4385509   .4293774   .5531179
                     |  .0008471   .0007266   .0008963
                     | 
            relerror |  1.897122   -13.1296  -1.416533
                     |  2.288101   1.948991   2.211263
                     | 
               cover |      95.7       91.2       93.7
                     |  .6414907   .8958573   .7683165
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.2                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0021697  -.0030478  -.0032598
                     |  .0050535   .0049456   .0066448
                     | 
             pctbias |  .8678741  -1.219111  -1.303923
                     |    2.0214   1.978232   2.657936
                     | 
                mean |  .2521697   .2469522   .2467402
                     |  .0050535   .0049456   .0066448
                     | 
               empse |  .1598057    .156393   .2101283
                     |  .0035752   .0034988    .004701
                     | 
             relprec |             4.411891  -42.16171
                     |             3.964161     2.7453
                     | 
                 mse |   .025517   .0244436   .0441204
                     |  .0011012   .0010917   .0021423
                     | 
                rmse |  .1597405   .1563445   .2100485
                     |  .0034469   .0034913   .0050996
                     | 
             modelse |  .1595675   .1578927   .2002832
                     |  .0003036   .0002745   .0003213
                     | 
             ciwidth |  .6243665   .6180017   .7840847
                     |  .0011873    .001071   .0012602
                     | 
            relerror |  -.149025   .9589576  -4.685263
                     |  2.241916   2.265448   2.137843
                     | 
               cover |      94.2       95.5       94.6
                     |  .7391618   .6555532   .7147308
                     | 
               power |      33.8       33.9       24.6
                     |  1.495848   1.496927   1.361925
---------------------+--------------------------------
0.25                 |
.2                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0049183  -.0060418  -.0059357
                     |   .003674   .0040392   .0046376
                     | 
             pctbias | -.4918334  -.6041759  -.5935745
                     |  .3674032   .4039218   .4637622
                     | 
                mean |  .9950817   .9939582   .9940643
                     |   .003674   .0040392   .0046376
                     | 
               empse |  .1161831   .1277313   .1466545
                     |  .0025992   .0028576   .0032809
                     | 
             relprec |            -17.26461  -37.23823
                     |             3.746284   2.994491
                     | 
                 mse |  .0135092   .0163355   .0215213
                     |  .0005784   .0007132   .0009818
                     | 
                rmse |  .1162291   .1278103   .1467013
                     |  .0024882   .0027901   .0033462
                     | 
             modelse |  .1140788   .1115027   .1416216
                     |  .0002309   .0001935   .0002272
                     | 
             ciwidth |  .4462741   .4364309   .5544316
                     |  .0009003   .0007549   .0008911
                     | 
            relerror | -1.811223  -12.70522  -3.431776
                     |  2.205637   1.958812   2.165958
                     | 
               cover |      95.2       91.2       94.7
                     |  .6759884   .8958573   .7084563
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.2                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0027486  -.0090895  -.0091956
                     |  .0034781   .0038531    .004416
                     | 
             pctbias | -.2198919  -.7271631  -.7356442
                     |  .2782505   .3082445   .3532827
                     | 
                mean |  1.247251    1.24091   1.240804
                     |  .0034781   .0038531    .004416
                     | 
               empse |  .1099882   .1218443   .1396472
                     |  .0024606   .0027259   .0031242
                     | 
             relprec |            -18.51431  -37.96635
                     |             3.940328   3.194757
                     | 
                 mse |  .0120929   .0149138   .0195664
                     |  .0005401   .0006959   .0008664
                     | 
                rmse |  .1099675   .1221221     .13988
                     |  .0024558   .0028494   .0030971
                     | 
             modelse |  .1139007   .1115027   .1416216
                     |  .0002256   .0001935   .0002272
                     | 
             ciwidth |  .4456148   .4364309   .5544316
                     |  .0008803   .0007549   .0008911
                     | 
            relerror |  3.557214  -8.487556    1.41383
                     |  2.325831   2.053452   2.274642
                     | 
               cover |        95       91.8       94.6
                     |  .6892024   .8676173   .7147308
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.4                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0034342   .0005849   .0049402
                     |  .0060214   .0052363   .0063101
                     | 
             pctbias | -1.373691   .2339707    1.97607
                     |  2.408547   2.094518   2.524044
                     | 
                mean |  .2465658   .2505849   .2549402
                     |  .0060214   .0052363   .0063101
                     | 
               empse |  .1904123   .1655862   .1995432
                     |  .0042599   .0037045   .0044642
                     | 
             relprec |             32.23362  -8.942381
                     |             6.214656   4.843795
                     | 
                 mse |  .0362324   .0273917   .0398021
                     |  .0017131   .0012575   .0016522
                     | 
                rmse |  .1903481   .1655044   .1995046
                     |  .0044999   .0037991   .0041407
                     | 
             modelse |  .1835962    .167694    .199773
                     |  .0004158    .000289   .0003116
                     | 
             ciwidth |  .7178638   .6563814   .7821474
                     |  .0016184   .0011276   .0012189
                     | 
            relerror |  -3.57967   1.272905    .115136
                     |  2.168128   2.272378     2.2452
                     | 
               cover |      93.7       94.8         95
                     |  .7683165   .7021109   .6892024
                     | 
               power |      28.1       31.9       26.2
                     |  1.421404   1.473903   1.390525
---------------------+--------------------------------
0.25                 |
.4                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |   .004279   .0017235  -.0004541
                     |  .0041273   .0040722   .0043798
                     | 
             pctbias |  .4278979   .1723482  -.0454142
                     |  .4127342    .407225   .4379788
                     | 
                mean |  1.004279   1.001724   .9995459
                     |  .0041273   .0040722   .0043798
                     | 
               empse |   .130518   .1287758    .138501
                     |  .0029199    .002881   .0030985
                     | 
             relprec |             2.724042  -11.19553
                     |             5.187405   4.708285
                     | 
                 mse |  .0170362   .0165696   .0191636
                     |  .0008437   .0006861   .0008152
                     | 
                rmse |  .1305229    .128723   .1384325
                     |  .0032322   .0026649   .0029445
                     | 
             modelse |  .1298397   .1184202   .1412608
                     |  .0003154   .0002035   .0002203
                     | 
             ciwidth |   .507485   .4635191   .5530617
                     |   .001226   .0007944   .0008619
                     | 
            relerror | -.5197104  -8.041621   1.992588
                     |   2.23864   2.063343   2.287304
                     | 
               cover |      94.7         92       95.8
                     |  .7084563   .8579044   .6343183
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.4                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0008448   .0023084    .004486
                     |  .0040974   .0041912   .0046007
                     | 
             pctbias |  .0675802   .1846726   .3588827
                     |  .3277934   .3352997   .3680572
                     | 
                mean |  1.250845   1.252308   1.254486
                     |  .0040974   .0041912   .0046007
                     | 
               empse |  .1295717   .1325389   .1454874
                     |  .0028988   .0029651   .0032548
                     | 
             relprec |            -4.427241  -20.68234
                     |             4.850225   4.212103
                     | 
                 mse |  .0167728   .0175543   .0211655
                     |  .0007355   .0007671     .00089
                     | 
                rmse |  .1295097   .1324927   .1454838
                     |  .0028397    .002895   .0030588
                     | 
             modelse |  .1297947   .1184202   .1412608
                     |  .0003172   .0002035   .0002203
                     | 
             ciwidth |  .5072898   .4635191   .5530617
                     |  .0012336   .0007944   .0008619
                     | 
            relerror |  .1721137  -10.65248  -2.905118
                     |  2.254367   2.004761   2.177467
                     | 
               cover |      95.4       91.5         94
                     |  .6624499   .8819014   .7509993
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.4                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |   .003941  -.0028574   -.005644
                     |  .0059101   .0058369   .0065405
                     | 
             pctbias |  1.576388  -1.142965  -2.257613
                     |  2.364043   2.334766   2.616184
                     | 
                mean |   .253941   .2471426    .244356
                     |  .0059101   .0058369   .0065405
                     | 
               empse |   .186894   .1845794   .2068275
                     |  .0041812   .0041294   .0046271
                     | 
             relprec |             2.523628  -18.34663
                     |              4.99531   4.235552
                     | 
                 mse |    .03491   .0340437   .0427667
                     |  .0015901    .001559   .0019589
                     | 
                rmse |  .1868421   .1845092   .2068011
                     |  .0042551   .0042247   .0047362
                     | 
             modelse |  .1842587   .1780058   .2000978
                     |  .0004117   .0002979   .0003147
                     | 
             ciwidth |  .7205022   .6967896    .783397
                     |  .0016027   .0011697   .0012351
                     | 
            relerror | -1.410059  -3.561427  -3.253749
                     |  2.216616   2.163541   2.169735
                     | 
               cover |      95.5         94       93.6
                     |  .6555532   .7509993   .7739768
                     | 
               power |        30       30.3       23.9
                     |  1.449138   1.453241   1.348625
---------------------+--------------------------------
0.25                 |
.4                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0064733  -.0015826  -.0001893
                     |  .0045101   .0042524   .0045012
                     | 
             pctbias | -.6473321   -.158258   -.018927
                     |  .4510087   .4252355   .4501229
                     | 
                mean |  .9935267   .9984174   .9998108
                     |  .0045101   .0042524   .0045012
                     | 
               empse |  .1426215   .1344713   .1423413
                     |  .0031907   .0030084   .0031844
                     | 
             relprec |             12.48923   .3940071
                     |             6.118313   5.592515
                     | 
                 mse |  .0203624   .0180669   .0202408
                     |  .0009043   .0008215   .0009234
                     | 
                rmse |  .1426971   .1344133   .1422703
                     |  .0031685    .003056   .0032453
                     | 
             modelse |  .1430059   .1257121   .1414905
                     |  .0003851     .00021   .0002225
                     | 
             ciwidth |  .5585811   .4920928   .5539454
                     |  .0014938   .0008246   .0008734
                     | 
            relerror |  .2695387  -6.513753  -.5977263
                     |  2.259407   2.097287   2.229302
                     | 
               cover |      95.2       92.8       94.6
                     |  .6759884   .8174104   .7147308
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.25                 |
.4                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0025324    -.00444  -.0058333
                     |  .0046609   .0042129   .0044636
                     | 
             pctbias | -.2025881  -.3551992  -.4666643
                     |  .3728699   .3370284   .3570871
                     | 
                mean |  1.247468    1.24556   1.244167
                     |  .0046609   .0042129   .0044636
                     | 
               empse |  .1473898   .1332222   .1411511
                     |  .0032974   .0029804   .0031578
                     | 
             relprec |             22.40011   9.035122
                     |             6.657785   6.000536
                     | 
                 mse |  .0217084   .0177501   .0199377
                     |  .0010044   .0008242   .0009239
                     | 
                rmse |  .1473378   .1332295    .141201
                     |  .0034086   .0030931   .0032716
                     | 
             modelse |  .1433395   .1257121   .1414905
                     |  .0003901     .00021   .0002225
                     | 
             ciwidth |   .559858   .4920928   .5539454
                     |   .001507   .0008246   .0008734
                     | 
            relerror | -2.748019  -5.637216   .2404965
                     |  2.191748   2.116951     2.2481
                     | 
               cover |        93       93.6       95.3
                     |  .8068457   .7739768   .6692606
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.2                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  -.003586  -.0019055  -.0040095
                     |  .0049575   .0048105   .0065433
                     | 
             pctbias |  -.717203   -.381095  -.8019052
                     |  .9914938   .9621063   1.308655
                     | 
                mean |   .496414   .4980945   .4959905
                     |  .0049575   .0048105   .0065433
                     | 
               empse |  .1567689   .1521224   .2069165
                     |  .0035072   .0034033   .0046291
                     | 
             relprec |             6.202289  -42.59763
                     |             4.026737   2.862491
                     | 
                 mse |  .0245648   .0231217   .0427877
                     |  .0010558   .0009687   .0019013
                     | 
                rmse |  .1567316   .1520582   .2068519
                     |  .0033682   .0031851   .0045957
                     | 
             modelse |  .1589754   .1557034   .1997051
                     |  .0002998     .00027   .0003102
                     | 
             ciwidth |  .6220698   .6094374   .7818854
                     |  .0011721   .0010532   .0012162
                     | 
            relerror |  1.407441   2.354018  -3.485154
                     |  2.276719    2.29672   2.164417
                     | 
               cover |      95.6       95.4       93.8
                     |  .6485677   .6624499   .7626007
                     | 
               power |      88.2       90.2       69.6
                     |  1.020177   .9401916   1.454593
---------------------+--------------------------------
0.5                  |
.2                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0012828  -.0023641  -.0013121
                     |  .0035545   .0038132   .0043888
                     | 
             pctbias | -.1282813  -.2364119  -.1312095
                     |  .3554459   .3813201   .4388826
                     | 
                mean |  .9987172   .9976359   .9986879
                     |  .0035545   .0038132   .0043888
                     | 
               empse |  .1124019    .120584   .1387869
                     |  .0025146   .0026977   .0031049
                     | 
             relprec |            -13.11044  -34.40808
                     |              3.89834   3.265604
                     | 
                 mse |  .0126232   .0145316   .0192443
                     |  .0005259   .0006566     .00082
                     | 
                rmse |   .112353   .1205469   .1387237
                     |  .0023402   .0027236   .0029556
                     | 
             modelse |  .1124665   .1099383   .1412129
                     |   .000223   .0001902   .0002194
                     | 
             ciwidth |  .4399979   .4303114   .5528764
                     |  .0008722   .0007422     .00086
                     | 
            relerror |  .0575289  -8.828434   1.747992
                     |  2.247252   2.045771   2.281774
                     | 
               cover |      95.2         93       95.8
                     |  .6759884   .8068457   .6343183
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.2                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0048688  -.0042696  -.0053216
                     |  .0035244   .0039181    .004524
                     | 
             pctbias | -.3245885  -.2846395  -.3547747
                     |  .2349589   .2612065   .3016017
                     | 
                mean |  1.495131    1.49573   1.494678
                     |  .0035244   .0039181    .004524
                     | 
               empse |  .1114508   .1239011   .1430622
                     |  .0024934   .0027719   .0032006
                     | 
             relprec |            -19.08746  -39.31012
                     |              3.81138   3.068431
                     | 
                 mse |  .0124326   .0153544   .0204747
                     |  .0005433   .0006378   .0008719
                     | 
                rmse |  .1115014   .1239127   .1430897
                     |  .0024363   .0025736   .0030467
                     | 
             modelse |  .1123107   .1099383   .1412129
                     |  .0002198   .0001902   .0002194
                     | 
             ciwidth |  .4394151   .4303114   .5528764
                     |  .0008574   .0007422     .00086
                     | 
            relerror |  .7715725  -11.26929  -1.292712
                     |  2.263057   1.991001   2.213584
                     | 
               cover |      94.9       91.4       94.6
                     |  .6956938   .8865889   .7147308
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.2                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0062239   -.000872  -.0051354
                     |  .0049747   .0050995   .0066234
                     | 
             pctbias | -1.244777  -.1743976  -1.027078
                     |  .9949353   1.019894   1.324672
                     | 
                mean |  .4937761    .499128   .4948646
                     |  .0049747   .0050995   .0066234
                     | 
               empse |  .1573131   .1612593   .2094489
                     |  .0035194   .0036077   .0046858
                     | 
             relprec |            -4.834381  -43.58776
                     |              3.65376   2.785994
                     | 
                 mse |  .0247614   .0259793   .0438514
                     |  .0011348   .0011562   .0019782
                     | 
                rmse |  .1573576    .161181   .2094072
                     |  .0036058   .0035868   .0047234
                     | 
             modelse |  .1586881   .1570945   .1993961
                     |  .0002964   .0002771   .0003162
                     | 
             ciwidth |  .6209638   .6148421   .7806245
                     |  .0011603   .0010858   .0012467
                     | 
            relerror |  .8740371  -2.582691  -4.799671
                     |  2.264594   2.186172   2.135153
                     | 
               cover |        95       94.1       93.7
                     |  .6892024   .7451108   .7683165
                     | 
               power |      87.2       88.1       69.7
                     |  1.056485   1.023909   1.453241
---------------------+--------------------------------
0.5                  |
.2                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias |  .0022508  -.0014848   .0006469
                     |  .0036447   .0041133   .0046357
                     | 
             pctbias |  .2250815  -.1484761   .0646943
                     |   .364466   .4113289   .4635696
                     | 
                mean |  1.002251   .9985152   1.000647
                     |  .0036447   .0041133   .0046357
                     | 
               empse |  .1152543   .1300736   .1465936
                     |  .0025785     .00291   .0032796
                     | 
             relprec |            -21.48809  -38.18638
                     |             3.474391   3.002674
                     | 
                 mse |  .0132753   .0169044   .0214686
                     |  .0006154   .0007466   .0009522
                     | 
                rmse |  .1152186   .1300171   .1465217
                     |  .0026705   .0028712   .0032493
                     | 
             modelse |  .1134385    .110935   .1409943
                     |   .000226   .0001955   .0002236
                     | 
             ciwidth |  .4437968   .4341825   .5519848
                     |  .0008816   .0007661   .0008815
                     | 
            relerror | -1.575469  -14.71369  -3.819581
                     |  2.210655   1.913925   2.157135
                     | 
               cover |      94.5       90.3       93.6
                     |  .7209369   .9359005   .7739768
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.2                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0039731  -.0023567  -.0044885
                     |  .0035517   .0041173   .0046167
                     | 
             pctbias | -.2648714  -.1571165    -.29923
                     |  .2367772   .2744879     .30778
                     | 
                mean |  1.496027   1.497643   1.495512
                     |  .0035517   .0041173   .0046167
                     | 
               empse |  .1123133    .130201   .1459929
                     |  .0025127   .0029128   .0032661
                     | 
             relprec |             -25.5896  -40.81672
                     |             3.301878    2.87058
                     | 
                 mse |  .0126174   .0169409   .0213128
                     |  .0005855   .0007378   .0009074
                     | 
                rmse |  .1123274   .1301572   .1459889
                     |   .002606   .0028343   .0031079
                     | 
             modelse |  .1133144    .110935   .1409943
                     |  .0002247   .0001955   .0002236
                     | 
             ciwidth |  .4433189   .4341825   .5519848
                     |  .0008769   .0007661   .0008815
                     | 
            relerror |  .8913633  -14.79714  -3.423841
                     |  2.265977   1.912052    2.16601
                     | 
               cover |      94.8       90.7         94
                     |  .7021109   .9184281   .7509993
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.4                   |
MCAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0038328  -.0003171   .0025005
                     |  .0058314   .0053224   .0061952
                     | 
             pctbias | -.7665548   -.063415   .5000941
                     |   1.16629   1.064481   1.239045
                     | 
                mean |  .4961672   .4996829   .5025005
                     |  .0058314   .0053224   .0061952
                     | 
               empse |  .1844066   .1683093   .1959102
                     |  .0041255   .0037654   .0043829
                     | 
             relprec |             20.04303  -11.39891
                     |             5.738354   4.584891
                     | 
                 mse |  .0339865   .0282998   .0383487
                     |  .0014887   .0012391   .0016748
                     | 
                rmse |  .1843542   .1682254   .1958281
                     |  .0040375   .0036828   .0042762
                     | 
             modelse |   .183931   .1683373   .2002281
                     |  .0004252   .0002925   .0003172
                     | 
             ciwidth |  .7190954   .6588723   .7838923
                     |  .0016554   .0011476   .0012452
                     | 
            relerror | -.2579166   .0166356   2.204033
                     |  2.243296   2.244297   2.292222
                     | 
               cover |      94.9       94.3       94.6
                     |  .6956938   .7331505   .7147308
                     | 
               power |      76.7         84       71.5
                     |  1.336828    1.15931   1.427498
---------------------+--------------------------------
0.5                  |
.4                   |
MCAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0013829  -.0023255  -.0037343
                     |  .0040298   .0040163   .0043476
                     | 
             pctbias |  -.138286  -.2325508   -.373428
                     |  .4029827   .4016278   .4347562
                     | 
                mean |  .9986171   .9976745   .9962657
                     |  .0040298   .0040163   .0043476
                     | 
               empse |  .1274343   .1270059    .137482
                     |  .0028509   .0028414   .0030757
                     | 
             relprec |             .6758362  -14.08257
                     |              5.21626    4.57631
                     | 
                 mse |  .0162252   .0161198   .0188963
                     |  .0007514   .0007493   .0008695
                     | 
                rmse |  .1273781   .1269636    .137464
                     |  .0029495   .0029507   .0031627
                     | 
             modelse |  .1301364   .1188966   .1415826
                     |  .0003241   .0002064   .0002243
                     | 
             ciwidth |  .5085692   .4653625   .5542955
                     |  .0012597     .00081   .0008805
                     | 
            relerror |  2.120365  -6.384953   2.982693
                     |  2.298739   2.100641   2.309685
                     | 
               cover |      95.2       92.9       95.6
                     |  .6759884   .8121514   .6485677
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.4                   |
MCAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0052156  -.0026426  -.0012338
                     |  .0042386   .0042832   .0045389
                     | 
             pctbias | -.3477089  -.1761721   -.082254
                     |  .2825763   .2855477   .3025927
                     | 
                mean |  1.494784   1.497357   1.498766
                     |  .0042386   .0042832   .0045389
                     | 
               empse |  .1340377   .1354472   .1435323
                     |  .0029987   .0030302   .0032111
                     | 
             relprec |            -2.070426   -12.7924
                     |             4.834758   4.441568
                     | 
                 mse |  .0179753   .0183346   .0205825
                     |  .0008045   .0008314    .000925
                     | 
                rmse |  .1340721   .1354052   .1434659
                     |  .0030004   .0030701   .0032239
                     | 
             modelse |  .1300619   .1188966   .1415826
                     |  .0003222   .0002064   .0002243
                     | 
             ciwidth |  .5083001   .4653625   .5542955
                     |  .0012501     .00081   .0008805
                     | 
            relerror | -2.966143  -12.21922  -1.358368
                     |  2.184098   1.969725   2.212324
                     | 
               cover |        95       90.5         94
                     |  .6892024    .927227   .7509993
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.4                   |
MNAR                 |
effect               |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0029705  -.0054573  -.0062674
                     |  .0059098   .0057716   .0064853
                     | 
             pctbias | -.5940987  -1.091464  -1.253487
                     |  1.181958   1.154313   1.297068
                     | 
                mean |  .4970295   .4945427   .4937326
                     |  .0059098   .0057716   .0064853
                     | 
               empse |   .186884   .1825129   .2050845
                     |  .0041809   .0040832   .0045881
                     | 
             relprec |             4.847274  -16.96164
                     |             5.283276   4.412323
                     | 
                 mse |  .0348995   .0333074   .0420569
                     |  .0016159   .0014769   .0018584
                     | 
                rmse |  .1868142   .1825032   .2050777
                     |   .004325   .0040461   .0045309
                     | 
             modelse |  .1846398   .1781741   .2005397
                     |  .0004248   .0002976   .0003082
                     | 
             ciwidth |  .7218812   .6974498   .7851714
                     |  .0016553   .0011701   .0012094
                     | 
            relerror | -1.200878  -2.377249  -2.216031
                     |  2.221978   2.190083   2.192766
                     | 
               cover |        95       93.8       93.9
                     |  .6892024   .7626007   .7568288
                     | 
               power |      76.1       77.8       69.5
                     |  1.348625   1.314215   1.455936
---------------------+--------------------------------
0.5                  |
.4                   |
MNAR                 |
mean0                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0049292  -.0045021  -.0040971
                     |  .0046364   .0043276   .0045824
                     | 
             pctbias | -.4929183  -.4502139   -.409708
                     |  .4636404   .4327626   .4582449
                     | 
                mean |  .9950708   .9954979   .9959029
                     |  .0046364   .0043276   .0045824
                     | 
               empse |   .146616   .1368515   .1449098
                     |  .0032801   .0030616   .0032419
                     | 
             relprec |             14.77918   2.368726
                     |             6.094008   5.510614
                     | 
                 mse |   .021499   .0187299   .0209946
                     |  .0010073   .0008145   .0009085
                     | 
                rmse |  .1466255   .1368572   .1448952
                     |  .0034351   .0029757   .0031351
                     | 
             modelse |  .1432406   .1258355    .141803
                     |  .0004015   .0002094   .0002179
                     | 
             ciwidth |  .5593777   .4925785      .5552
                     |  .0015406   .0008237   .0008552
                     | 
            relerror | -2.302162  -8.049639  -2.143926
                     |  2.202773   2.062787   2.194383
                     | 
               cover |        94       92.5       94.8
                     |  .7509993   .8329166   .7021109
                     | 
               power |       100        100        100
                     |         0          0          0
---------------------+--------------------------------
0.5                  |
.4                   |
MNAR                 |
mean1                |
               bsims |      1000       1000       1000
                     |                                
                     | 
              sesims |      1000       1000       1000
                     |                                
                     | 
                bias | -.0078997  -.0099595  -.0103645
                     |  .0044765   .0041298   .0043771
                     | 
             pctbias | -.5266451  -.6639639  -.6909679
                     |  .2984332   .2753192   .2918066
                     | 
                mean |    1.4921   1.490041   1.489635
                     |  .0044765   .0041298   .0043771
                     | 
               empse |  .1415593   .1305953    .138416
                     |  .0031669   .0029217   .0030966
                     | 
             relprec |             17.49554   4.593358
                     |             6.484474   5.899247
                     | 
                 mse |  .0200814   .0171373   .0192473
                     |  .0009067   .0007285   .0008286
                     | 
                rmse |  .1417088   .1309094   .1387345
                     |  .0031992   .0027823   .0029861
                     | 
             modelse |  .1432662   .1258355    .141803
                     |  .0003876   .0002094   .0002179
                     | 
             ciwidth |  .5595873   .4925785      .5552
                     |  .0015004   .0008237   .0008552
                     | 
            relerror |  1.205773   -3.64473   2.446964
                     |  2.280658   2.161605   2.297332
                     | 
               cover |      94.8       94.5       94.7
                     |  .7021109   .7209369   .7084563
                     | 
               power |       100        100        100
                     |         0          0          0
------------------------------------------------------
NOTE: Where there are 2 entries in the table, the first entry is the performance measure and the
  second entry is its Monte Carlo error.

. 
. siman lollyplot
Performance measures not specified: defaulting to bias empse cover
Drawing 3 graphs (one per target)...
Warning: each graph will have 12 columns of panels: consider using 'if' condition as detailed in 
  siman lollyplot

. 
. siman nestloop
Performance measures not specified: defaulting to bias empse cover
Drawing 9 graphs (3 targets * 3 performance measures)...

. 
. 
. * examples in paper
. use "https://raw.githubusercontent.com/UCL/siman/master/simpaper1.dta", clear
(simcheck99 data from Analysis\Simulations\simcheck\missing confounder code)

. siman setup, rep(repno) dgm(dgm) method(method) est(b) se(se) true(0)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 1: long-long
The format for targets is:        long
The format for methods is:        long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            Full CCA MI

Data generating mechanism (dgm)
The total number of dgms is:      3
The dgm variables (# levels):     dgm (3) 

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             _true
_____________________________________________________

. set scheme mrc

. 
. siman scatter 
working.....

. 
. siman swarm
working.....

. 
. siman comparemethodsscatter 
Working.....

. 
. siman blandaltman 
working....

. 
. siman zipplot

. 
. 
. * trellis
. 
. * nestloop
. 
. use $testpath/nestloop/res.dta, clear

. * theta as dgmvar must be encoded, but theta as true value mustn't be
. gen theta_new = 1

. replace theta_new = 0 if theta == 0.5
(192 real changes made)

. replace theta_new = 2 if theta == 0.75
(192 real changes made)

. replace theta_new = 3 if theta == 1
(192 real changes made)

. label define theta_newl 0 "0.5" 1 "0.6666667" 2 "0.75" 3 "1"

. label values theta_new theta_newl

. 
. * also encode tau2
. gen tau2_new = 0

. replace tau2_new = 1 if round(tau2,0.01) == 0.05
(192 real changes made)

. replace tau2_new = 2 if round(tau2,0.01) == 0.1
(192 real changes made)

. replace tau2_new = 3 if round(tau2,0.01) == 0.2
(192 real changes made)

. label define tau2_newl 0 "0" 1 "0.05" 2 "0.1" 3 "0.2"

. label values tau2_new tau2_newl

. drop tau2

. rename tau2_new tau2

. 
. drop expfem exprem expmh msefem mserem msemh msepeto mseg2 mselimf covfem covrem covmh covpeto cov
> g2 covlimf msepeters covpeters expexpect mseexpect covexpect msetrimfill covtrimfill biasfem biasr
> em biasmh biaspeto biaspeters biassfem biassrem biasg2 biaslimf biaslimr biasexpect biastrimfill v
> ar2fem var2rem var2mh var2expect

. 
. siman setup, rep(v1) dgm(theta_new rho pc tau2 k) method(peto g2 limf peters trimfill) estimate(ex
> p) se(var2) true(theta)

                   SUMMARY OF DATA
_____________________________________________________

The siman format is:              format 3: long-wide
The format for targets is:        long
The format for methods is:        wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         5
The method values are:            peto g2 limf peters trimfill

Data generating mechanism (dgm)
The total number of dgms is:      768
The dgm variables (# levels):     theta_new (4) rho (4) pc (4) tau2 (4) k (3) 

Estimates are contained in the dataset

The estimates stub is:            exp
The se stub is:                   var2
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true variable is:             theta
_____________________________________________________

. 
. * siman analyse needs force option to cope with only 1 repetition per dgm [NB gets many lines of r
> ed output, suppressed by cap], and notable option because siman table fails
. cap siman analyse, force 

. assert _rc == 198

. 
. * Recreating Gerta's graph, Figure 2
. siman nestloop mean, dgmorder(-theta_new rho -pc tau2 -k) ylabel(0.2 0.5 1) ytitle("Odds ratio") x
> label(none) xtitle("")
Drawing graph...

. 
. di as result "*** SIMAN GRAPHS HAVE PASSED ALL THE TESTS IN `filename'.do ***"
*** SIMAN GRAPHS HAVE PASSED ALL THE TESTS IN Testing_IRW_TPM_EMZ.do ***

. 
. log close
